/*
Navicat MySQL Data Transfer

Source Server         : hjr
Source Server Version : 50717
Source Host           : localhost:3306
Source Database       : thesis

Target Server Type    : MYSQL
Target Server Version : 50717
File Encoding         : 65001

Date: 2018-09-02 22:38:31
*/

SET FOREIGN_KEY_CHECKS=0;

-- ----------------------------
-- Table structure for advice
-- ----------------------------
DROP TABLE IF EXISTS `advice`;
CREATE TABLE `advice` (
  `id` bigint(10) NOT NULL AUTO_INCREMENT,
  `orgid` bigint(10) DEFAULT NULL,
  `topic` varchar(100) DEFAULT NULL,
  `content` text,
  `target` tinyint(4) DEFAULT NULL,
  `creator` bigint(10) DEFAULT NULL,
  `cdate` datetime DEFAULT NULL,
  `publish` tinyint(2) DEFAULT NULL,
  `top` tinyint(2) DEFAULT NULL,
  `mdate` datetime DEFAULT NULL,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=32 DEFAULT CHARSET=utf8;

-- ----------------------------
-- Records of advice
-- ----------------------------
INSERT INTO `advice` VALUES ('20', '0', '全体注意！！！', '全体注意！！！全体注意！！！全体注意！！！全体注意！！！', '0', '1', '2017-08-13 12:44:29', '0', '1', '2017-08-19 09:41:06');
INSERT INTO `advice` VALUES ('21', '1', 'another教师公告', 'test', '1', '2', '2017-08-13 13:32:05', '1', '0', '2017-08-13 13:32:05');
INSERT INTO `advice` VALUES ('22', '1', 'another管理员公告', 'test', '3', '2', '2017-08-13 13:32:22', '1', '0', '2017-08-13 13:32:22');
INSERT INTO `advice` VALUES ('23', '1', 'another学生公告', 'test', '2', '2', '2017-08-13 13:32:40', '1', '0', '2017-08-13 15:41:06');
INSERT INTO `advice` VALUES ('24', '2', '给教师的公告-From管理员', '<p>hello teacher！</p>', '1', '3', '2017-08-19 09:30:30', '1', '0', '2017-08-19 10:24:02');
INSERT INTO `advice` VALUES ('25', '2', '给学生的公告-from管理员', '', '2', '3', '2017-08-19 09:30:52', '1', '0', '2017-08-19 10:23:58');
INSERT INTO `advice` VALUES ('26', '2', '给管理员的公告-from管理员', '<p>hello manager！hello manager！hello manager！hello manager！hello manager！hello manager！hello manager！hello manager！hello manager！hello manager！hello manager！hello manager！hello manager！hello manager！hello manager！hello manager！hello manager！hello manager！hello manager！hello manager！hello manager！hello manager！hello manager！hello manager！hello manager！hello manager！hello manager！hello manager！hello manager！hello manager！hello manager！hello manager！hello manager！hello manager！hello manager！hello manager！hello manager！hello manager！hello manager！hello manager！hello manager！hello manager！hello manager！hello manager！hello manager！hello manager！hello manager！hello manager！hello manager！hello manager！hello manager！</p>', '3', '3', '2017-08-19 09:31:15', '1', '0', '2017-08-19 10:23:55');
INSERT INTO `advice` VALUES ('27', '0', '关于做好2017届本科生毕业论文（设计）工作的通知', '<p>各学院：</p>\r\n\r\n<p>为做好本科生毕业论文（设计）工作，保证本科生毕业论文（设计）质量，根据《华南农业大学本科生毕业论文（设计）管理办法》（华南农办【2017】18号）及《华南农业大学本科生毕业论文（设计）相似性检测实施办法》（华南农办【2016】185号）文件精神，现将相关事宜通知如下：</p>\r\n\r\n<p><strong>一、加强过程管理，注重质量监控</strong></p>\r\n\r\n<p>各学院要高度重视本科生毕业论文（设计）工作，加强学生诚信教育，结合学校相关规章制度，合理制定本科生毕业论文（设计）工作的实施方案，确定工作进度、质量要求及检查安排等，抓好开题报告、中期检查、论文答辩等关键环节。</p>\r\n\r\n<p><strong>二、启用毕业论文（设计）智能管理系统</strong></p>\r\n\r\n<p>学校引进了毕业论文（设计）智能管理系统，2017年为试用期，欢迎学院师生使用。现将系统使用简介如下：</p>\r\n\r\n<p>1、毕业论文（设计）智能管理系统登录网址为：http://202.116.163.98/index.aspx，也可由教务处网站点击右侧相关链接&ldquo;毕业论文（设计）系统&rdquo;登录。</p>\r\n\r\n<p>2、论文指导教师和学生登录账号与正方教务管理系统登录账号一致，初始密码与登录账号相同，请登录后自行修改。</p>\r\n\r\n<p>3、详细操作流程见附件。</p>\r\n\r\n<p><strong>三、毕业论文（设计）相似性检测</strong></p>\r\n\r\n<p>为杜绝本科生毕业论文（设计）抄袭等学术不端行为，学校将采用第三方论文规范检测系统对2017届本科生毕业论文（设计）相似性进行检测。学校将于5月10日前对全校本科生毕业论文（设计）相似性进行抽查检测，未按要求参加检测的毕业论文（设计）成绩以零分计，具体要求另行通知。</p>\r\n\r\n<p>学校为本科毕业生提供1次毕业论文（设计）免费检测服务。学生可在答辩前登录&ldquo;毕业论文（设计）智能管理系统&rdquo;提交毕业论文（设计），系统将自动进行检测并反馈检测结果。</p>\r\n\r\n<p>联系人：黄老师、李老师</p>\r\n\r\n<p>联系电话：85280051</p>\r\n\r\n<p>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; 教 务 处</p>\r\n\r\n<p>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; 2017年2月22日</p>', '0', '1', '2017-08-19 09:38:40', '1', '1', '2017-08-19 09:38:40');
INSERT INTO `advice` VALUES ('28', '2', '给管理员的公告2-from管理员', '', '3', '3', '2017-08-19 10:25:19', '1', '0', '2017-08-19 10:25:19');
INSERT INTO `advice` VALUES ('29', '2', '面向工业工程的公告', '<p>公告丨CBN越野梦计划5~8月奖励名单</p>\r\n\r\n<p>2017-09-06 09:09<a href=\"http://www.sohu.com/tag/59409\" target=\"_blank\">越野赛</a></p>\r\n\r\n<p><strong>2017</strong></p>\r\n\r\n<p><strong>CBN越野梦计划</strong></p>\r\n\r\n<p>为检验CBN越野俱乐部队员训练水平，提高队员参赛积极性和为组织争取荣誉，CBN越野俱乐部已于3月底发布了&ldquo;梦计划&rdquo;，规定对于4月份后所有ITRA认证赛事，俱乐部给予报名费补贴奖励，具体如下：</p>\r\n\r\n<p>一、获得男女里程组别名次，奖励对应组别报名费</p>\r\n\r\n<table>\r\n	<tbody>\r\n		<tr>\r\n			<td>第1名</td>\r\n			<td>100%</td>\r\n		</tr>\r\n		<tr>\r\n			<td>第2名</td>\r\n			<td>80%</td>\r\n		</tr>\r\n		<tr>\r\n			<td>第3名</td>\r\n			<td>50%</td>\r\n		</tr>\r\n		<tr>\r\n			<td>第4至10名</td>\r\n			<td>20%</td>\r\n		</tr>\r\n	</tbody>\r\n</table>\r\n\r\n<p>二、对于各合作赛事赞助商名额，CBN越野俱乐部将奖励优秀义工、领队、活动积极分子等忠实队员免报名费的资格。（注：免费名额即为100%全额补贴奖励，不再参与名次奖励）</p>\r\n\r\n<p>申请CBN越野俱乐部&ldquo;梦计划&rdquo;</p>\r\n\r\n<p>奖励条件的队员要求：</p>\r\n\r\n<p>1、 CBN越野活动签到系统须有本人注册信息和约跑记录</p>\r\n\r\n<p>2、 比赛时须穿CBN越野队服</p>\r\n\r\n<p>CBN越野于4月已发布过一次奖励公告，具体参考》》公告丨CBN越野梦计划4月奖励名单</p>\r\n\r\n<p>夏季虽为比赛淡季，但队员们仍在多场赛事中取得了优异的成绩：有短距离速度王，也有长距离的耐力大神。奖励只是形式，目的在于鼓励更多队员参赛，体验越野的乐趣，成为自己心中的英雄。</p>\r\n\r\n<p>现公布5~8月参赛奖励情况，具体如下：</p>\r\n\r\n<p><img src=\"http://5b0988e595225.cdn.sohucs.com/images/20170906/11421aa5da4a4798a5b0c627eef13e39.jpeg\" style=\"width:100%\" /></p>\r\n\r\n<p><strong>丽江</strong></p>\r\n\r\n<p><strong>水赳赳</strong></p>\r\n\r\n<p>水赳赳</p>\r\n\r\n<p>玉龙雪山超级越野跑</p>\r\n\r\n<p>21KM组 女子第六名</p>\r\n\r\n<p>比赛日期：5月13日</p>\r\n\r\n<p><img src=\"http://5b0988e595225.cdn.sohucs.com/images/20170906/3215059bb86e4274900e1fca8354fc03.jpeg\" style=\"width:100%\" /></p>\r\n\r\n<p><strong>广州</strong></p>\r\n\r\n<p><strong>mofong</strong></p>\r\n\r\n<p>mofong</p>\r\n\r\n<p>2017 龙洞越野赛</p>\r\n\r\n<p>BTB组 男子第三名</p>\r\n\r\n<p>比赛日期：5月13日</p>\r\n\r\n<p><img src=\"http://5b0988e595225.cdn.sohucs.com/images/20170906/6ec3fb611ce64969b1395dab806eb894.jpeg\" style=\"width:100%\" /></p>\r\n\r\n<p><strong>广州</strong></p>\r\n\r\n<p>Time.温暖</p>\r\n\r\n<p>Time.温暖</p>\r\n\r\n<p>2017 龙洞越野赛</p>\r\n\r\n<p>50KM组 女子第二名</p>\r\n\r\n<p>比赛日期：5月14日</p>\r\n\r\n<p><img src=\"http://5b0988e595225.cdn.sohucs.com/images/20170906/8a6367e05d29455b900c69049413460c.jpeg\" style=\"width:100%\" /></p>\r\n\r\n<p><strong>广州</strong></p>\r\n\r\n<p><strong>阿 光</strong></p>\r\n\r\n<p>阿光</p>\r\n\r\n<p>2017 龙洞越野赛</p>\r\n\r\n<p>50KM组 男子第六名</p>\r\n\r\n<p>比赛日期：5月14日</p>\r\n\r\n<p><img src=\"http://5b0988e595225.cdn.sohucs.com/images/20170906/01cac38bd9d349c888c63811e335813c.jpeg\" style=\"width:100%\" /></p>\r\n\r\n<p><strong>广州</strong></p>\r\n\r\n<p><strong>易欢</strong></p>\r\n\r\n<p>易欢</p>\r\n\r\n<p>2017 龙洞越野赛</p>\r\n\r\n<p>50KM组 男子第八名</p>\r\n\r\n<p>比赛日期：5月14日</p>\r\n\r\n<p><img src=\"http://5b0988e595225.cdn.sohucs.com/images/20170906/f0533d0c4ba04e838171d675a973cf33.jpeg\" style=\"width:100%\" /></p>\r\n\r\n<p><strong>毕节</strong></p>\r\n\r\n<p><strong>木 头</strong></p>\r\n\r\n<p>木头</p>\r\n\r\n<p>百里杜鹃国际越野跑挑战赛</p>\r\n\r\n<p>100KM组 男子第三名</p>\r\n\r\n<p>比赛日期：8月5日</p>\r\n\r\n<p><img src=\"http://5b0988e595225.cdn.sohucs.com/images/20170906/11e3a4890be34d6686c7f9348be97270.jpeg\" style=\"width:100%\" /></p>\r\n\r\n<p><strong>毕节</strong></p>\r\n\r\n<p><strong>真 子</strong></p>\r\n\r\n<p>真子</p>\r\n\r\n<p>百里杜鹃国际越野跑挑战赛</p>\r\n\r\n<p>50KM组 女子第七名</p>\r\n\r\n<p>比赛日期：8月5日</p>\r\n\r\n<p><img src=\"http://5b0988e595225.cdn.sohucs.com/images/20170906/eda62e2e05fb408794095a56d665f4f6.jpeg\" style=\"width:100%\" /></p>\r\n\r\n<p><strong>毕节</strong></p>\r\n\r\n<p><strong>思 念</strong></p>\r\n\r\n<p>思念</p>\r\n\r\n<p>百里杜鹃国际越野跑挑战赛</p>\r\n\r\n<p>30KM组 男子第七名</p>\r\n\r\n<p>比赛日期：8月5日</p>\r\n\r\n<p><img src=\"http://5b0988e595225.cdn.sohucs.com/images/20170906/579f19df9d674f1b83b6f467778cb84d.jpeg\" style=\"width:100%\" /></p>\r\n\r\n<p><strong>崇礼</strong></p>\r\n\r\n<p>宝 丁</p>\r\n\r\n<p>宝丁</p>\r\n\r\n<p>崇礼100超级天路越野赛</p>\r\n\r\n<p>110KM组&nbsp;女子第九名</p>\r\n\r\n<p>比赛日期：8月12~13日</p>\r\n\r\n<p><img src=\"http://5b0988e595225.cdn.sohucs.com/images/20170906/ffdb7f3ba19d43e694bd3b5f97f1d737.jpeg\" style=\"width:100%\" /></p>\r\n\r\n<p><strong>崇礼</strong></p>\r\n\r\n<p><strong>肥 猫</strong></p>\r\n\r\n<p>肥猫</p>\r\n\r\n<p>崇礼100超级天路越野赛</p>\r\n\r\n<p>168KM组 男子第五名</p>\r\n\r\n<p>比赛日期：8月12~13日</p>\r\n\r\n<p>我是挖坑的分割线</p>\r\n\r\n<p>想要奖励？首先</p>\r\n\r\n<p>&hellip;&hellip;</p>\r\n\r\n<p>你得报个比赛啊！！！</p>\r\n\r\n<p>以下是各大坑主精心挑选的赛（da）事（keng）</p>\r\n\r\n<p>坑已挖好 等你来跳</p>\r\n\r\n<p>◆ 放肆野&bull;GZ100越野赛</p>\r\n\r\n<p>地点：广东广州从化区</p>\r\n\r\n<p>日期：2017年10月28日</p>\r\n\r\n<p>报名链接：http://www.geexek.com/cmpt/detail?Y2lkPTY4NDY=</p>\r\n\r\n<p><strong>详情请关注公众号：放肆野</strong></p>\r\n\r\n<p>◆ 凯乐石环四姑娘山超级越野跑</p>\r\n\r\n<p>地点：四川省阿坝州</p>\r\n\r\n<p>日期：2017年11月4日</p>\r\n\r\n<p>官网：http://www.utms.com.cn/</p>\r\n\r\n<p><strong>现重新开放报名（9月10日截止）</strong></p>\r\n\r\n<p>◆&nbsp;HK168</p>\r\n\r\n<p>地点：香港大美督</p>\r\n\r\n<p>日期：2017年12月1~3日</p>\r\n\r\n<p>组别：168Km/半程84Km/55Km/20Km</p>\r\n\r\n<p>已报名：30人+（已报名全程）</p>\r\n\r\n<p>◆ 广州CH50越野赛</p>\r\n\r\n<p>地点：广州市从化区</p>\r\n\r\n<p>日期：2018年3月初</p>\r\n\r\n<p>预计组别：50Km/30Km/体验组</p>\r\n\r\n<p>◆&nbsp;天狼杭州100越野赛</p>\r\n\r\n<p>日期：2018年3月</p>\r\n\r\n<p>地点：浙江杭州</p>\r\n\r\n<p>官网：http://www.hz100cc.com/</p>\r\n\r\n<p>团报地址：https://jinshuju.net/f/sBm8Zs （跑团机构名称填写<strong>&ldquo;CBN越野&rdquo;</strong>）</p>\r\n\r\n<p>已报名：个人组，双人组，团报有优惠，福利多多，N多报名时神兽</p>\r\n\r\n<p>◆&nbsp;括苍-柴古唐斯越野赛</p>\r\n\r\n<p>日期：2018年4月</p>\r\n\r\n<p>地点：浙江临海</p>\r\n\r\n<p><strong>报名登记将于2017年10月20日早上10点开始</strong></p>\r\n\r\n<p>◆&nbsp;林贾尼100极限越野赛（亚洲最难越野赛）</p>\r\n\r\n<p>日期：2018年5月</p>\r\n\r\n<p>地点：印尼龙目岛<a href=\"http://www.sohu.com/?strategyid=00001\" id=\"backsohucom\" target=\"_blank\" title=\"点击进入搜狐首页\">返回搜狐，查看更多</a></p>\r\n\r\n<p>声明：本文由入驻搜狐号的作者撰写，除搜狐官方账号外，观点仅代表作者本人，不代表搜狐立场。</p>\r\n\r\n<p>&nbsp;</p>', '2', '3', '2017-09-06 11:43:56', '1', '1', '2017-09-06 11:44:57');
INSERT INTO `advice` VALUES ('30', '2', '教师公告', '<p><a href=\"http://www.xinhuanet.com/\" target=\"_blank\"><img src=\"http://www.newsimg.cn/xl2017/images/net_logo.png\" /></a></p>\r\n\r\n<p>八项规定，激浊扬清之剑&mdash;&mdash;党的十八大以来以习近平同志为核心的党中央贯彻执行八项规定、推动作风建设综述</p>\r\n\r\n<p>2017-09-29 00:14:06&nbsp;来源： 新华社</p>\r\n\r\n<p><img src=\"http://www.newsimg.cn/xl2017/images/wx.png\" /></p>\r\n\r\n<p>关注新华网</p>\r\n\r\n<p>微信</p>\r\n\r\n<p>微博</p>\r\n\r\n<p>Qzone</p>\r\n\r\n<p>&nbsp;</p>\r\n\r\n<p>图集</p>\r\n\r\n<p>　　新华社北京9月28日电&nbsp;&nbsp;<strong>题：八项规定，激浊扬清之剑</strong></p>\r\n\r\n<p><strong>　　&mdash;&mdash;党的十八大以来以习近平同志为核心的党中央贯彻执行八项规定、推动作风建设综述</strong></p>\r\n\r\n<p>　　新华社记者朱基钗、罗沙、荣启涵、李亚红</p>\r\n\r\n<p>　　八项规定，一个改变中国的政治语汇，开启了中国共产党激浊扬清的作风之变。</p>\r\n\r\n<p>　　2012年12月4日，中央政治局审议通过关于改进工作作风、密切联系群众的八项规定，即&ldquo;中央八项规定&rdquo;，至今已近5年。</p>\r\n\r\n<p>　　5年徙木立信。以习近平同志为核心的党中央以强烈的历史担当和顽强的意志品质，直面党内存在的种种问题和弊端，从制定和执行中央八项规定破题，严字当头、刀刃向内，坚定不移推进全面从严治党，解决了许多过去认为不可能解决的问题，党风政风和社会风气发生了全面深刻、影响深远、鼓舞人心的变化。中央八项规定，试出了人心向背，厚植了党的执政根基。</p>\r\n\r\n<p><img id=\"{70CD433F-2453-4762-9A5D-C3F8BB25C86C}\" src=\"http://news.xinhuanet.com/politics/2017-09/29/1121741709_15066414205801n.jpg\" style=\"height:599px; width:440px\" title=\"\" /></p>\r\n\r\n<p>　　2014年1月27日，在杭州西湖十景之一的&ldquo;曲院风荷&rdquo;内，高档会所&ldquo;西湖会&rdquo;的&ldquo;荷香酒溢&rdquo;招牌（上图）被换成大众化的&ldquo;开心茶馆&rdquo;（下图）（拼版照片）。转型后的&ldquo;西湖会&rdquo;从一家高档经营场所变身为服务大众、经营大众餐饮的场所。新华社记者 王定昶 摄</p>\r\n\r\n<p>　　5年春风化雨。各级党组织、各地区各部门、广大党员干部在思想上政治上行动上同以习近平同志为核心的党中央保持高度一致，把贯彻落实中央八项规定精神作为一项重大政治任务来抓，牢固树立政治意识、大局意识、核心意识、看齐意识，驰而不息纠&ldquo;四风&rdquo;、改作风。时至今日，八项规定成为十八届党中央抓全面从严治党的亮丽名片，成为改变中国党风政风社会风气的标志性话语。</p>\r\n\r\n<p>　　<strong>以行动作号令　以身教作榜样</strong></p>\r\n\r\n<p>　　&mdash;&mdash;以习近平同志为核心的党中央始终从政治上认识和对待作风问题，率先垂范、以上率下，为全党树立起光辉典范</p>\r\n\r\n<p>　　人们依然清晰记得5年前的这一幕场景&mdash;&mdash;</p>\r\n\r\n<p>　　2012年12月7日下午，广东深圳，通向前海深港合作区的道路畅通如常，一个由8辆车组成的车队融入车流，与公交、出租车、私家车并行，按照交通信号灯的指令行进。</p>\r\n\r\n<p>　　不腾道、不封路、不扰民，不铺红地毯、没有欢迎横幅，没有层层陪同，与群众不期而遇，习近平总书记在党的十八大后首次出京考察令人印象深刻。</p>\r\n\r\n<p>　　就在3天前，中央政治局会议审议通过了中央八项规定。</p>\r\n\r\n<p>　　中央八项规定，短短600多字，却内涵丰富，从调查研究、会议活动、文件简报、出访活动、警卫工作、新闻报道、文稿发表、勤俭节约等8个方面对加强作风建设立下规矩，不搞四平八稳，不喊空洞口号，直面现实问题，提出具体要求。这是以习近平同志为核心的党中央深刻洞察党内存在的问题，抓全面从严治党的&ldquo;第一刀&rdquo;。</p>\r\n\r\n<p>　　正是在这次会议上，习近平总书记带头作出承诺、发起号召，对新一届中央政治局委员提出要求：</p>\r\n\r\n<p>　　&ldquo;党风廉政建设，要从领导干部做起，领导干部首先要从中央领导做起。正所谓己不正，焉能正人。&rdquo;</p>\r\n\r\n<p>　　&ldquo;规矩是起约束作用的，所以要紧一点。&rdquo;&ldquo;我们不舒服一点、不自在一点，老百姓的舒适度就好一点、满意度就高一点，对我们的感觉就好一点。这也是新形象新气象。&rdquo;</p>\r\n\r\n<p>　　善禁者，先禁其身而后人。</p>\r\n\r\n<p>　　接过历史接力棒的新一代共产党人，从立规矩开始，从作风建设切入，从最高领导层做起，开启了再塑自身形象的&ldquo;第一行动&rdquo;。</p>\r\n\r\n<p>　　36次中央政治局常委会会议、21次中央政治局会议，对贯彻执行中央八项规定、加强作风建设进行专门研究部署；</p>\r\n\r\n<p>　　每年召开的中央全会、中央纪委全会、中央经济工作会议等重要会议，习近平总书记都对作风建设提出明确要求；</p>\r\n\r\n<p>　　党中央先后部署开展党的群众路线教育实践活动、&ldquo;三严三实&rdquo;专题教育、&ldquo;两学一做&rdquo;学习教育，把贯彻执行中央八项规定精神、解决作风建设方面的问题作为重要内容；</p>\r\n\r\n<p>　　中央政治局先后召开3次民主生活会，对照检查执行中央八项规定的情况，进行党性分析，开展批评和自我批评，研究加强自身建设和作风建设的措施。</p>\r\n\r\n<p>　　&hellip;&hellip;</p>\r\n\r\n<p>　　5年来，以习近平同志为核心的党中央始终把贯彻执行中央八项规定精神、加强作风建设放在突出位置来抓，作出了一系列重大决策部署。</p>\r\n\r\n<p>　　&ldquo;工作作风上的问题绝对不是小事，如果不坚决纠正不良风气，任其发展下去，就会像一座无形的墙把我们党和人民群众隔开。&rdquo;</p>\r\n\r\n<p>　　&ldquo;党的作风就是党的形象，关系人心向背，关系党的生死存亡。执政党如果不注重作风建设，听任不正之风侵蚀党的肌体，就有失去民心、丧失政权的危险。&rdquo;</p>\r\n\r\n<p>　　&ldquo;我们要与人民心心相印、与人民同甘共苦、与人民团结奋斗。&rdquo;&ldquo;一定要一块过、一块干，保持和发扬党的光荣传统和优良作风，保持同人民群众的血肉联系，切实把工作做好。&rdquo;</p>\r\n\r\n<p>　　&ldquo;只有坚持问题导向，从细处入手，向实处着力，一环紧着一环拧，一锤接着一锤敲，才能积小胜为大胜。&rdquo;</p>\r\n\r\n<p>　　&ldquo;在改进作风问题上，我们不能退，也退不得。&rdquo;&ldquo;必须抓常、抓细、抓长，持续努力、久久为功。&rdquo;</p>\r\n\r\n<p>　　&hellip;&hellip;</p>\r\n\r\n<p>　　5年来，习近平总书记始终从关乎党的兴衰存亡、巩固党的执政地位、实现党的执政使命的政治高度，严肃对待作风问题，高度重视作风建设，在不同阶段、不同场合发表了一系列重要讲话，并先后作出51次重要批示，为贯彻落实中央八项规定精神指出明确方向，提出根本遵循。</p>\r\n\r\n<p>　　言出必信，行胜于言。</p>\r\n\r\n<p>　　5年来，习近平总书记以身作则、率先垂范，始终带头严格执行中央八项规定，给全党树立了典范，向全国人民持续传递信心和力量。</p>\r\n\r\n<p>　　深入地方考察调研50次、151天，足迹遍及全国各地，深入农村、社区、工厂车间、港口码头、边关哨所，每次考察调研都是轻车简从，深入基层，察实情、重实效。</p>\r\n\r\n<p>　　从赴广东考察工作时吃自助餐，到赴河北调研时吃大盆菜；从在河北阜平住16平方米的房间，到在四川芦山地震灾区住临时板房；从在湘西同村民一起摘柚子，到去北京庆丰包子铺排队点餐；从在陕北梁家河用自己的钱为乡亲购买年货，到在长白山下的田间地头关心农业生产&hellip;&hellip;点滴之间，彰显共产党人的政治本色和为民情怀。</p>\r\n\r\n<p><img id=\"{19FACE24-FAFB-421F-836E-F710D3728316}\" src=\"http://news.xinhuanet.com/politics/2017-09/29/1121741709_15066414271171n.jpg\" style=\"height:399px; width:599px\" title=\"\" /></p>\r\n\r\n<p>　　福建武夷山市纪委组织的检查组人员在武夷山度假区一家私人会所进行公款消费检查（2014年9月1日摄）。新华社记者 张国俊 摄</p>\r\n\r\n<p>　　习近平总书记始终把群众放在心中最高位置，特别关心贫困群众生产生活，每到一个地方都要到贫困村和贫困户看望慰问、了解情况，与困难群众共商脱贫办法，鼓励他们早日致富奔小康。2015年2月，在陕西延安主持召开陕甘宁革命老区脱贫致富座谈会，强调要让老区人民都过上幸福美满的日子；2015年6月，在贵州贵阳主持召开扶贫攻坚座谈会，强调要在精准扶贫、精准脱贫上下更大功夫；2016年7月，在宁夏银川主持召开东西部扶贫协作座谈会，强调要真扶贫、扶真贫、真脱贫；2017年6月，在山西太原主持召开深度贫困地区脱贫攻坚座谈会，强调要确保深度贫困地区和贫困群众同全国人民一道进入全面小康社会。</p>\r\n\r\n<p>　　出国访问28次、191天，到访五大洲52个国家，每次出访都严格做到切实精简随行人员，日程安排紧凑合理，活动开展务实高效，带头执行中央八项规定中关于外事活动的要求，严禁随行人员收受驻外使领馆任何馈赠&hellip;&hellip;言行细节，展现大国领袖的务实担当和崇高风范。</p>\r\n\r\n<p>　　与此同时，习近平总书记每年都以普通党员身份参加所在党支部活动，模范践行党章和党内政治生活准则，体现了一名共产党员坚如磐石的党性观念、以上率下的领袖风范、从严从实的执政品格，为全党作出了表率。</p>\r\n\r\n<p>　　李克强、张德江、俞正声、刘云山、王岐山、张高丽同志和其他中央政治局同志严于律己、以实际行动模范践行中央八项规定，并切实抓好分管领域、分管部门、分管地方的贯彻落实。</p>\r\n\r\n<p>　　一份份督查报告，展现出党中央贯彻执行八项规定、推进作风建设的扎实成效&mdash;&mdash;</p>\r\n\r\n<p>　　在改进调查研究方面。5年来，中央政治局同志深入地方和基层开展调研共1587次、3212天，平均每人每年调研17次、34天。考察调研坚持轻车简从，减少陪同，简化接待，务求实效。</p>\r\n\r\n<p>　　在精简会议活动方面。严格控制以中央名义召开的全国性会议，精简一般性事务性会议活动。持续简化中央领导同志节日活动，不再举办首都春节联欢文艺晚会和元宵晚会。坚持开短会、讲短话，不讲空话套话。中央全会、全国&ldquo;两会&rdquo;等重要会议会风不断改善。</p>\r\n\r\n<p>　　在精简文件简报方面。科学编制中央年度发文计划，从严把好发文关，较好控制了发文数量，提高了文件质量。严格实施简报备案制度，地方和部门报送党中央、国务院的简报数量分别从原来的500多种、300多种减少到130多种、200多种。</p>\r\n\r\n<p>　　在规范出访活动方面。紧紧围绕党和国家中心工作和外交战略需要，统筹安排领导同志外事活动，科学制定出访计划，严格控制访问次数、天数、国家数、随访人数，按规定乘坐交通工具。</p>\r\n\r\n<p>　　在改进警卫工作方面。严格落实不封路不腾道、不清场不闭馆要求，坚持内紧外松、防范在先，使安全措施扎实严密、形式缓和宽松，努力实现政治效果、安全效果和社会效果的有机统一。</p>\r\n\r\n<p>　　在改进新闻报道方面。严控一般性会议活动新闻报道，认真执行字数、时长等规定，规范新闻体裁运用、职务表述、列名方式等。创新新闻宣传方式，充分发挥全媒体优势。</p>\r\n\r\n<p>　　在严格文稿发表方面。除党中央统一安排外，中央政治局同志没有公开出版著作、讲话单行本，没有发贺信贺电，没有题词题字。</p>\r\n\r\n<p>　　在厉行勤俭节约方面。按照&ldquo;保障工作需要、待遇适当从低&rdquo;的原则，制定出台党和国家领导人有关待遇的系列文件，对办公用房、住房、用车、交通、工作人员配备、休假休息等待遇进一步作出规定。这些规定从十八届中央政治局率先做起。</p>\r\n\r\n<p>　　&hellip;&hellip;</p>\r\n\r\n<p>　　以身教者从，以言教者讼。</p>\r\n\r\n<p>　　以习近平同志为核心的党中央认真贯彻执行中央八项规定，不打折扣、不做变通，以行动作无声的号令、以身教作执行的榜样，诠释了改进作风的根本要求，为全党同志树立了标杆，形成了巨大的&ldquo;头雁效应&rdquo;。</p>\r\n\r\n<p>　　<strong>始终动真碰硬　坚持标本兼治</strong></p>\r\n\r\n<p>　　&mdash;&mdash;以习近平同志为核心的党中央直面人民群众反映强烈的突出问题，出实招、动真格，作风建设成绩斐然</p>\r\n\r\n<p>　　2013年9月28日，中央纪委公开通报了一起违反中央八项规定精神的典型问题：海南省卫生学校违规购买384份月饼券，发放给教职工共计12万余元，所需费用在学费收入财政返还资金中列支。</p>\r\n\r\n<p>　　这是全国第一起因违规购买月饼而被处理并通报的案例。小小月饼背后，折射出抓作风的清晰思路。</p>\r\n\r\n<p>　　世间事，做于细，成于严。</p>\r\n\r\n<p>　　习近平总书记深刻指出：&ldquo;我们抓中央八项规定贯彻落实，看起来是小事，但体现的是一种精神&rdquo;&ldquo;作风问题有的看起来不大，几顿饭，几杯酒，几张卡，但都与公私问题有联系，都与公款、公权有关系。&rdquo;</p>\r\n\r\n<p>　　作风问题常起于毫末、积于忽微，作风之变也成于抓早抓小、防微杜渐。</p>\r\n\r\n<p><img id=\"{8267A950-27CE-40E3-8557-CDB02D289E61}\" src=\"http://news.xinhuanet.com/politics/2017-09/29/1121741709_15066414914981n.jpg\" style=\"height:419px; width:600px\" title=\"\" /></p>\r\n\r\n<p>　　市民在广州白云山山顶的&ldquo;望景餐厅&rdquo;吃米粉、赏美景（2015年5月1日摄）。这里曾是不少官员涉足的私人会所，最低消费8888元。中央整治&ldquo;会所中的歪风&rdquo;后，这家会所开始向大众化经营转型。新华社记者 卢汉欣 摄</p>\r\n\r\n<p>　　从针对中央政治局出台的中央八项规定，到将其贯彻落实到各地区各部门的中央八项规定精神，八项规定在以上率下的示范和引导中，不断扩展到每一名党员和每一个党组织。</p>\r\n\r\n<p>　　中央八项规定，治全党，靠全党。</p>\r\n\r\n<p>　　各级党组织、各地区各部门、广大党员干部不断提高政治站位，将能不能贯彻落实中央八项规定精神，作为是否同以习近平同志为核心的党中央保持高度一致，是否具有坚定的&ldquo;四个意识&rdquo;，是否是一名合格的党员干部的高度来对待，主动、自觉执行中央八项规定精神，形成上下联动、齐抓共管的强大力量。</p>\r\n\r\n<p>　　5年来，在以习近平同志为核心的党中央坚强领导下，一系列剑指作风之弊的实招硬招频频出击，一项项针对作风建设的组合拳效果空前，每年都有新招数，不断释放新信号。</p>\r\n\r\n<p>　　&mdash;&mdash;细处着眼，以点带面。</p>\r\n\r\n<p>　　先从公款购买赠送月饼、贺年卡、烟花爆竹等群众反映强烈的具体问题抓起，一连下发3道禁令；之后又拓展到抓违规公款吃喝送礼、公款旅游、公车私用、违规建设楼堂馆所、大办婚丧喜庆、滥发钱物、出入私人会所等12个方面具体问题。</p>\r\n\r\n<p>　　一个节点一个节点坚守，一个阶段一个阶段推进。中央办公厅、国务院办公厅每年元旦春节都要专门印发通知，强调贯彻落实中央八项规定精神，提出具体要求，坚决杜绝&ldquo;节日腐败&rdquo;。纪检监察机关端午抓公款购买粽子等节礼、中秋抓公款购买月饼等节礼、春节抓公款购买爆竹等年货节礼，抓早抓小、串点成线，以一个个具体问题的突破，带动面上问题的解决。</p>\r\n\r\n<p>　　从群众反映最强烈的公款吃喝、公款送礼、公款旅游这三类问题来看，截至2016年12月，全国查处的公款吃喝、送礼、旅游（国内）这三类问题共3.18万起，违纪行为发生在2013、2014年的占到76.1%，发生在2015年的占16.7%，发生在2016年的仅为7.2%，逐年大幅下降。</p>\r\n\r\n<p>　　许多党员干部感慨，过去上百个文件管不住一张嘴，没想到一个八项规定就把嘴管住了。</p>\r\n\r\n<p>　　新加坡《联合早报》这样描述八项规定：当时很少人预见到，公款吃喝、文山会海等中国官场的&ldquo;老大难&rdquo;问题，竟然出现如此明显的改善。</p>\r\n\r\n<p>　　&mdash;&mdash;专项整治，攻克顽疾。</p>\r\n\r\n<p>　　习近平总书记针对&ldquo;舌尖上的浪费&rdquo;&ldquo;会所中的歪风&rdquo;&ldquo;车轮上的铺张&rdquo;等现象作出重要批示，强调&ldquo;奢靡之始、危亡之渐&rdquo;，对群众深恶痛绝的突出问题，必须严厉惩处、坚决刹住。</p>\r\n\r\n<p>　　各地区各部门按照党中央部署开展专项整治任务，扭住不放、精准发力，刹住了一些曾被认为不可能刹住的歪风邪气，攻克了一些曾被认为司空见惯的顽瘴痼疾。</p>\r\n\r\n<p>　　全国共整顿各类会所512家、处置456家，关停高尔夫球场187个，核查清理625家驻京办事机构，做到应撤尽撤；</p>\r\n\r\n<p>　　中央和国家机关、29个省区市直属机关公车改革完成，节支率分别达到14%、7.9%；</p>\r\n\r\n<p>　　停止新建楼堂馆所，全面完成办公用房清理，全国共调整清理办公用房2227.6万平方米。</p>\r\n\r\n<p><img id=\"{DE745739-A840-4F01-AEAA-4D9B1733AFA2}\" src=\"http://news.xinhuanet.com/politics/2017-09/29/1121741709_15066415510111n.jpg\" style=\"height:400px; width:600px\" title=\"\" /></p>\r\n\r\n<p>　　江西省上饶市万年县陈营镇马塘社区纪检监察干事黄中华在为党员和群众做题为&ldquo;把纪律挺在前面&rdquo;的专题宣讲（2015年10月28日摄）。新华社记者 万象 摄</p>\r\n\r\n<p>　　清理党政领导干部在企业兼职4万余人次、国有企事业单位领导人员在企业兼职2万余人次，其中中管干部358人次，清理退（离）休领导干部在社团兼职5.6万余人次。</p>\r\n\r\n<p>　　&mdash;&mdash;铁面执纪，寸步不让。</p>\r\n\r\n<p>　　一大批党员领导干部因为&ldquo;小节&rdquo;不仅受到党纪政纪处分，还上了&ldquo;曝光台&rdquo;。</p>\r\n\r\n<p>　　从高级干部违纪违法典型案例暴露出来的问题看，有一些就是在党的十八大后严重违反中央八项规定精神的，如周本顺、王珉、王三运等。</p>\r\n\r\n<p>　　坚决查处、严肃问责、一律曝光！</p>\r\n\r\n<p>　　5年来，各级党委（党组）以最讲认真的精神、零容忍的态度，猛药去疴、严查严处，充分发挥巡视巡察利剑作用，有力维护了中央八项规定的权威性和严肃性，真正使中央八项规定成为&ldquo;铁八条&rdquo;。</p>\r\n\r\n<p>　　强化党内监督，充分发挥社会监督、舆论监督作用，注重运用新媒体，设立曝光平台、手机随手拍和微信一键通，形成了无处不在的监督网。</p>\r\n\r\n<p>　　动真格，成为了人们对中央抓八项规定的突出印象；持续动真格，成为过去5年的常态，形成了知畏知止、收敛收手的压倒性态势。</p>\r\n\r\n<p>　　坚持发现一起、查实处置一起，持续释放越往后越严的信号。5年来，全国共查处违反中央八项规定精神问题17.61万起，处理党员干部23.9万人，给予党纪政纪处分12.8万人，平均每天约有140人受处理。</p>\r\n\r\n<p>　　加大点名道姓通报曝光力度，中央纪委共通报曝光31批、167起典型问题，涉及中管干部30人，对2016年以后发生的违反中央八项规定精神受到党纪政纪处分人员，原则上都要点名道姓通报曝光。</p>\r\n\r\n<p>　　2015年、2016年，全国因违反中央八项规定精神问题被追究主体责任、监督责任的领导干部分别为6010余人、6770余人，2017年仅上半年就追责3960余人，问责力度不断加大。</p>\r\n\r\n<p>　　有的党员干部坦言，中央八项规定开始时，觉得&ldquo;吃点喝点&rdquo;&ldquo;转转看看&rdquo;不是多大个事儿，现在给机会也不敢干了，因为一顿饭、一点小礼挨处分被通报，不仅自己在单位&ldquo;挺不起腰&rdquo;，家里人也跟着&ldquo;丢面子&rdquo;，实在不值得。</p>\r\n\r\n<p>　　&hellip;&hellip;</p>\r\n\r\n<p>　　善除害者查其本，善理疾者绝其源。</p>\r\n\r\n<p>　　抓作风建设，如何既治标又治本？习近平总书记明确强调：&ldquo;坚持破立并举，注重建章立制&rdquo;&ldquo;在坚持中见常态，向制度建设要长效&rdquo;。</p>\r\n\r\n<p>　　2013年10月，《党政机关厉行节约反对浪费条例》印发施行。随后包括《党政机关国内公务接待管理规定》《关于严禁党政机关到风景名胜区开会的通知》《关于调整中央和国家机关差旅住宿费标准等有关问题的通知》等20多个配套制度，为贯彻落实中央八项规定精神、从源头上刹住奢侈浪费之风提供了一个可执行、可操作的顶层规范。</p>\r\n\r\n<p>　　党中央制定出台党内政治生活准则、廉洁自律准则、党内监督条例、纪律处分条例、问责条例等一批党内法规，把中央八项规定精神要求纳入其中，为作风建设提供有力保障；各地区各部门普遍结合实际制定了贯彻落实中央八项规定精神的实施办法、细则及配套制度。</p>\r\n\r\n<p><img id=\"{04B0FC1E-083B-416D-B0C4-4834D30DCC62}\" src=\"http://news.xinhuanet.com/politics/2017-09/29/1121741709_15066416092351n.jpg\" style=\"height:402px; width:600px\" title=\"\" /></p>\r\n\r\n<p>　　江苏省省级机关公车改革中取消车辆的首场公开拍卖在南京国际展览中心举行（2016年1月10日摄）。新华社记者 孙参 摄</p>\r\n\r\n<p>　　党员干部普遍反映，随着规矩越来越明晰，许多事都有硬&ldquo;杠杠&rdquo;，别说&ldquo;禁区&rdquo;&ldquo;红线&rdquo;不能踩，打个&ldquo;擦边球&rdquo;也不行了，一条条制度红线绑住了&ldquo;任性的权力&rdquo;。</p>\r\n\r\n<p>　　立规矩&ldquo;治身&rdquo;，更需强信念&ldquo;治心&rdquo;。</p>\r\n\r\n<p>　　抓作风建设，如何筑牢根基？习近平总书记深刻指出：&ldquo;作风问题本质上是党性问题。抓作风建设，就要返璞归真、固本培元，重点突出坚定理想信念、践行根本宗旨、加强道德修养。&rdquo;</p>\r\n\r\n<p>　　5年来，不断深入的思想政治建设和连续开展的党内教育活动，为中央八项规定精神落地生根打下了坚实的思想基础。</p>\r\n\r\n<p>　　2013年至2014年开展的党的群众路线教育实践活动，以为民务实清廉为主题，聚焦&ldquo;四风&rdquo;突出问题，对作风之弊、行为之垢进行大排查、大检修、大扫除，通过召开高质量的民主生活会，开展严肃认真的批评和自我批评，党员干部受到了一次深刻的群众路线再教育，强化了宗旨意识，锤炼了党性修养。</p>\r\n\r\n<p>　　2015年启动的&ldquo;三严三实&rdquo;专题教育把贯彻落实中央八项规定精神作为重要内容，聚焦对党忠诚、个人干净、敢于担当，着力解决&ldquo;不严不实&rdquo;问题。</p>\r\n\r\n<p>　　2016年推开的&ldquo;两学一做&rdquo;学习教育，把党的思想政治建设延伸到了所有基层党组织和全体党员，全体党员党章党规党纪意识明显增强，严肃党内政治生活，自觉接受监督，实现了在思想、作风、纪律上的新进步。</p>\r\n\r\n<p>　　这不仅是一次直面现实的&ldquo;问题清扫&rdquo;，也是一次回归传统的&ldquo;思想整风&rdquo;，更是一次党内政治生态的&ldquo;集中净化&rdquo;。</p>\r\n\r\n<p>　　数字是最有力的证明&mdash;&mdash;</p>\r\n\r\n<p>　　中央纪委数据显示，在截至2016年12月查处的15.53万起问题中，违纪行为发生在2013、2014年的为12.15万起，占到78.2%；违纪行为发生在2015年的有2.34万起，占15.1%；违纪行为发生在2016年的有1.04万起，仅为6.7%，表明违纪增量不断减少，违反中央八项规定精神问题得到有效遏制。</p>\r\n\r\n<p>　　财政部数据显示，从2012年到2016年，中央本级&ldquo;三公&rdquo;经费实现&ldquo;四连降&rdquo;，2016年中央本级&ldquo;三公&rdquo;经费比2012年累计减少26亿元，累计降幅达35.0%，其中因公出国（境）费、公务用车购置及运行费、公务接待费分别累计下降6.5%、36.4%和70.3%。</p>\r\n\r\n<p>　　久久为功，善作善成。</p>\r\n\r\n<p>　　以习近平同志为核心的党中央以讲认真的态度、有担当的行动、求实效的精神、务长远的思维，推动中央八项规定精神落地生根。</p>\r\n\r\n<p>　　<strong>党内正气上升　社会风气上扬</strong></p>\r\n\r\n<p>　　&mdash;&mdash;以习近平同志为核心的党中央始终立足根本、着眼长远，以可知可感的切实变化，凝聚起继续前进的磅礴力量</p>\r\n\r\n<p>　　&ldquo;以前逢年过节，我的车都会被人包下，拉着一车礼品满北京城转悠，这几年没有这种现象了。&rdquo;对于中央八项规定实施前后的变化，北京出租车司机黄师傅这样描述。</p>\r\n\r\n<p>　　细微之处见变化，百姓心中自有秤。</p>\r\n\r\n<p>　　作风建设的目的是什么？成效如何评判？</p>\r\n\r\n<p>　　习近平总书记深刻指出：&ldquo;作风问题，核心是党和人民群众的关系问题，根本是始终保持党同人民群众的血肉联系。&rdquo;</p>\r\n\r\n<p>　　&ldquo;老百姓看作风建设，主要不是看开了多少会、讲了多少话、发了多少文件，而是看解决了什么问题。&lsquo;春江水暖鸭先知&rsquo;，有没有变化，老百姓体会最深。&rdquo;</p>\r\n\r\n<p>　　一年一个样，五年大变样。</p>\r\n\r\n<p>　　5年来，中央八项规定在整个神州大地涤荡起一股激浊扬清的净化之风，广大干部群众在一个又一个细节、一件又一件小事中感受到了切切实实的变化。</p>\r\n\r\n<p>　　公款送礼之风基本刹住了&mdash;&mdash;</p>\r\n\r\n<p>　　曾几何时，公款收送节礼的歪风让大量名烟、名酒等过剩礼品流向市场，让许多高档礼品回收店赚得盆满钵满。但近年来，人们发现，街头巷尾曾经随处可见的&ldquo;高档烟酒回收&rdquo;等字样的牌子正在悄然消失。</p>\r\n\r\n<p>　　&ldquo;八项规定前，一个端午或者中秋下来光卖回收的烟酒就能赚上万元，现在很冷清了。&rdquo;江西南昌市滕王阁周边的一家烟酒店老板说。</p>\r\n\r\n<p>　　粽子、月饼、大闸蟹这些一度被&ldquo;天价&rdquo;异化的食品，重新回归百姓餐桌，成为庆祝佳节的应景美味；寓意亲人团聚、祈盼美满的传统节日，找回应有的民俗特色和文化底蕴；&ldquo;八元一碗的面没人吃，八十元一碗的面销路好&rdquo;的现象成为历史。</p>\r\n\r\n<p>　　高档会所、酒店也开始走&ldquo;亲民&rdquo;路线&mdash;&mdash;</p>\r\n\r\n<p>　　位于广州著名景区白云山山顶的&ldquo;望景餐厅&rdquo;，曾是包括已落马的广州市委原书记万庆良在内的不少官员涉足的私人会所，最低消费8888元。中央整治&ldquo;会所中的歪风&rdquo;后，这家会所开始向大众化经营转型。</p>\r\n\r\n<p>　　如今，过去的会所已经变成一家米粉店。&ldquo;以前经过这里总是大门紧闭，现在爬山爬到这里正好吃一碗米粉，歇歇脚，看看周围美丽的景色。&rdquo;市民张彬彬说。</p>\r\n\r\n<p>　　位于杭州西湖风景区内的几十家会所一时间全部关停转型，按照公益性、大众化、可进入性原则，还湖于民、还园于民、还景于民。</p>\r\n\r\n<p>　　如今，普通杭州市民能够走进当年&ldquo;可望而不可进&rdquo;的&ldquo;神秘会所&rdquo;中喝茶了。&ldquo;党中央抓八项规定，真是说到做到，真真切切为老百姓着想呐。&rdquo;年过八旬的退休职工孙枫说。</p>\r\n\r\n<p>　　踏石留印，抓铁有痕。</p>\r\n\r\n<p>　　&mdash;&mdash;5年来，中央八项规定精神的贯彻落实，在政治上打造&ldquo;青山绿水&rdquo;，党内政治生态得以改善。</p>\r\n\r\n<p>　　&ldquo;这些年变化最大的是干部们的观念。&rdquo;工作30多年的广东省一名副厅长说，&ldquo;现在有了八项规定，公务接待简单一点，甚至不接待也没关系，大家都习以为常了。&rdquo;</p>\r\n\r\n<p>　　党内上下级关系、同志关系变清爽了，党员干部逐渐摆脱应付人际关系的烦恼，繁文缛节、迎来送往的少了，生活方式变了，干事创业的精气神明显提升。</p>\r\n\r\n<p>　　抓作风密切了党群、干群关系。&ldquo;只顾自己奔小康、不管他人喝米汤&rdquo;&ldquo;办事不公、优亲厚友、吃拿卡要&rdquo;式的干部少了，一大批&ldquo;合格党员&rdquo;&ldquo;担当干部&rdquo;&ldquo;贴心党组织&rdquo;以务实的改革精神、清廉的工作作风，察民情、晓民意、解民忧、排民难。</p>\r\n\r\n<p>　　&mdash;&mdash;5年来，中央八项规定精神的贯彻落实，让一度笼罩在潜规则之下的政商关系回归正常。</p>\r\n\r\n<p>　　&ldquo;给县领导的烟，被退回到自己手里，当时心里真没底，担心以后不好办事。&rdquo;2014年8月，来自辽宁的一家企业与河南兰考签订了招商引资协议，送礼送不出去的尴尬让项目负责人心里没了底。2016年1月，一条投资10亿元的生产线顺利投产。这位没花一分钱请客吃饭的负责人感慨，干部作风过硬，让企业得了真实惠。</p>\r\n\r\n<p>　　&ldquo;相敬如宾，切莫勾肩搭背。&rdquo;</p>\r\n\r\n<p>　　&ldquo;亲&rdquo;&ldquo;清&rdquo;新型政商关系，消除了那些抑制市场主体活力、损害公平竞争的不利因素，为经济发展营造出更良性长久的市场环境。</p>\r\n\r\n<p>　　&mdash;&mdash;5年来，中央八项规定精神的贯彻落实，把匡正党风与弘扬良好道德风尚结合起来，让勤俭节约蔚然成风，社会主义核心价值观日益深入人心。</p>\r\n\r\n<p>　　曾几何时，在沿海侨乡福建长乐市，婚丧喜庆讲排场、比阔气，大操大办、分发红包之风甚嚣尘上，&ldquo;结不起婚&rdquo;&ldquo;死不起人&rdquo;成为当地老百姓的难言之隐、心头之痛。</p>\r\n\r\n<p>　　去年以来，在中央八项规定精神深化落实中，一场移风易俗的&ldquo;清风运动&rdquo;让多年的歪风陋俗得到根本整治，群众如释重负，拍手称快。</p>\r\n\r\n<p>　　褪尽奢华见真淳。</p>\r\n\r\n<p>　　从铺张浪费到勤俭节约，从注重&ldquo;人情消费&rdquo;回归友善真情，从违背本心适应潜规则到理直气壮坚守明规矩&hellip;&hellip;</p>\r\n\r\n<p>　　人心是最大的政治，民意是最好的褒奖。</p>\r\n\r\n<p>　　国家统计局2017年6月进行的民情民意电话调查显示，94.8%的受调查对象肯定以习近平同志为核心的党中央制定和落实中央八项规定的成效，91.8%对中央八项规定长期执行有信心，85.5%认为中央八项规定实施以来身边党员干部工作作风有明显改进，89.5%认为党员干部工作作风带动社会风气有明显改进。</p>\r\n\r\n<p>　　2017年全国党风廉政建设民意调查同时显示，92.7%的群众认为党的十八大以来落实中央八项规定精神、纠正&ldquo;四风&rdquo;有很大的效果，比2013年提高11.4个百分点。</p>\r\n\r\n<p>　　风清则气正，气正则心齐，心齐则事成。</p>\r\n\r\n<p>　　中央八项规定精神的深入贯彻落实，极大提升了党在人民心目中的形象和威信，极大增强了对以习近平同志为核心的党中央的高度信赖和衷心拥戴，为党和国家事业全面开创新局面提供了坚强保证。</p>\r\n\r\n<p>　　回望过往，成绩令人振奋，启示愈加深刻：</p>\r\n\r\n<p>　　&mdash;&mdash;坚持从政治上认识和对待作风问题，旗帜鲜明讲政治，不断强化&ldquo;四个意识&rdquo;，坚决维护以习近平同志为核心的党中央权威和集中统一领导。</p>\r\n\r\n<p>　　&mdash;&mdash;坚持以上率下层层带动，抓住&ldquo;关键少数&rdquo;，压实管党治党主体责任，形成全党上下齐抓作风建设的强大声势。</p>\r\n\r\n<p>　　&mdash;&mdash;坚持以人民为中心的工作导向，凡是人民群众不满意的就改，凡是人民群众期盼的就做，以实实在在的工作成效兑现承诺、取信于民。</p>\r\n\r\n<p>　　&mdash;&mdash;坚持以钉钉子精神抓牢抓实抓成，锲而不舍、持之以恒，在坚持中深化、在深化中坚持，不断把作风建设推向前进。</p>\r\n\r\n<p><img id=\"{CDA4C477-8240-4C23-B75C-248239339EF5}\" src=\"http://news.xinhuanet.com/politics/2017-09/29/1121741709_15066416633061n.jpg\" style=\"height:450px; width:600px\" title=\"\" /></p>\r\n\r\n<p>　　在泉南高速莲花收费站，江西省萍乡市莲花县纪委暗访督察组在检查公车私用情况（2016年9月14日摄）。新华社记者 赖星 摄</p>\r\n\r\n<p>　　&mdash;&mdash;坚持破立并举标本兼治，用改革的思路和办法破解作风顽症，扎牢织密制度之笼，铲除不良作风滋生蔓延的温床和土壤。</p>\r\n\r\n<p>　　&hellip;&hellip;</p>\r\n\r\n<p>　　展望未来，问题令人清醒，犹须敬终如始：</p>\r\n\r\n<p>　　&mdash;&mdash;&ldquo;不敢&rdquo;的问题已初步解决，&ldquo;不想&rdquo;&ldquo;不愿&rdquo;的内在自觉尚未普遍形成；</p>\r\n\r\n<p>　　&mdash;&mdash;不良作风树倒根在，隐形变异问题时有发生，反弹回潮的隐患和压力犹存；</p>\r\n\r\n<p>　　&mdash;&mdash;责任落实压力传导不到位，有的领导机关、领导干部存在&ldquo;灯下黑&rdquo;、&ldquo;手电筒只照别人不照自己&rdquo;等问题；</p>\r\n\r\n<p>　　&mdash;&mdash;制度体系尚不完备，制度落地生根还有差距。</p>\r\n\r\n<p>　　&hellip;&hellip;</p>\r\n\r\n<p>　　逆水行舟，一篙不可放缓；滴水穿石，一滴不可弃滞。</p>\r\n\r\n<p>　　习近平总书记明确强调：&ldquo;作风建设是攻坚战，也是持久战&rdquo;&ldquo;作风建设永远在路上，永远没有休止符&rdquo;。</p>\r\n\r\n<p>　　党的十九大即将胜利召开，这是在全面建成小康社会决胜阶段、中国特色社会主义发展关键时期召开的一次十分重要的大会。</p>\r\n\r\n<p>　　我们坚信，在以习近平同志为核心的党中央坚强领导下，全党上下团结一心，持续深入推进全面从严治党，驰而不息正风肃纪，我们党必将凝聚起更加磅礴的力量，带领全体人民在实现中华民族伟大复兴中国梦的伟大征程上不断迈向新的胜利！</p>\r\n\r\n<p>　<strong>　相关链接：</strong></p>\r\n\r\n<p><strong>　　新华社评论员：坚决打赢作风建设这场硬仗</strong></p>\r\n\r\n<p>　　党的作风就是党的形象，关系人心向背，关系党的生死存亡。作风建设始终是党的建设的重要课题。</p>\r\n\r\n<p>　　党的十八大以来，以习近平同志为核心的党中央直面党内存在的突出问题，以制定和执行中央八项规定为切入口，严字当头、刀刃向内，解决了新形势下作风建设抓什么、怎么抓的问题，有力推动了全面从严治党。５年雷厉风行，５年春风化雨，以八项规定为肇始的作风建设刷新了党风政风，净化了社会风气，提振了人心士气，为党的建设和经济社会发展注入了强大正能量。&nbsp;<a href=\"http://news.xinhuanet.com/politics/2017-09/28/c_1121741703.htm\" target=\"_blank\">&gt;&gt;</a></p>\r\n\r\n<p>&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp;<a href=\"javascript:void(0);\">【纠错】</a>&nbsp;责任编辑： 钱中兵</p>', '1', '3', '2017-09-29 11:44:39', '1', '1', '2017-09-29 11:44:39');
INSERT INTO `advice` VALUES ('31', '2', 'hhhhhhh', '<p>adsfasfasdf</p>', '1', '6', '2017-10-07 11:15:43', '0', '0', '2017-10-07 11:15:43');

-- ----------------------------
-- Table structure for apply
-- ----------------------------
DROP TABLE IF EXISTS `apply`;
CREATE TABLE `apply` (
  `id` bigint(10) NOT NULL AUTO_INCREMENT,
  `projid` bigint(10) DEFAULT NULL COMMENT '论文工作ID',
  `thesisid` bigint(10) DEFAULT NULL COMMENT '论文题目ID',
  `studentid` bigint(10) DEFAULT NULL COMMENT '确认学生ID',
  `apply_info` varchar(1000) DEFAULT NULL COMMENT '选题信息，对题目的想法',
  `apply_time` datetime DEFAULT NULL COMMENT '选题时间',
  `teacherid` bigint(10) DEFAULT NULL COMMENT '教师ID',
  `reply_info` varchar(1000) DEFAULT NULL COMMENT '教师回复意见',
  `reply_time` datetime DEFAULT NULL COMMENT '回复时间',
  `valid` tinyint(1) DEFAULT NULL COMMENT '是否可用（也即是否删除）',
  `cdate` datetime DEFAULT NULL COMMENT '创建时间',
  `mdate` datetime DEFAULT NULL COMMENT '更新时间',
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=939 DEFAULT CHARSET=utf8;

-- ----------------------------
-- Records of apply
-- ----------------------------
INSERT INTO `apply` VALUES ('1', '2', '128', '199', '1.生产线人员设备的合理配置（基于标准工时的线平衡）\r\n2.员工技能水平的培养\r\n3.少人化，多能工，自动化方向的发展趋势\r\n4.相应的奖励制度\r\n5.作业标准，空间位置，工夹具的改善（修正标准工时）\r\n6.拉动式与推动式的生产模式\r\n7.“水蜘蛛”活动的准时性（物料供应）\r\n8.生产线现场的5S（文明作业，提供一个良好的工作环境）\r\n9.提高效率，保证质量（优化返工过程）', '2016-10-16 05:31:35', '21', '同意', '2016-10-17 08:26:41', '1', '2016-10-16 05:31:35', '2016-10-17 08:26:41');
INSERT INTO `apply` VALUES ('2', '1', '296', '43', '我对数据挖掘技术研究有一定兴趣，也有想学习这方面的意向', '2016-10-16 16:58:13', '14', '已入选题目[物联网环境下的农产品流通质量安全风险评估与预警方法]，该申请无效', '2017-08-12 22:20:02', '1', '2016-10-16 16:58:13', '2017-08-12 22:20:02');
INSERT INTO `apply` VALUES ('3', '2', '91', '191', '喜欢这个题目，有信心完成', '2016-10-16 17:30:22', '12', '可以', '2016-10-17 16:54:33', '1', '2016-10-16 17:30:22', '2016-10-17 16:54:33');
INSERT INTO `apply` VALUES ('4', '2', '133', '160', '库存控制作为企业生产活动中的重要环节,尤其是近年来物流与供应链管理的发展,研究供应链管理环境下企业库存控制策略,对于节约供应链成本,提高供应链整体效率有重要的意义。', '2016-10-16 22:42:59', '21', '同意', '2016-10-17 10:33:03', '1', '2016-10-16 22:42:59', '2016-10-17 10:33:03');
INSERT INTO `apply` VALUES ('5', '2', '331', '157', '有相关数据', '2016-10-16 23:00:51', '13', null, null, '1', '2016-10-16 23:00:51', '2016-10-16 23:00:51');
INSERT INTO `apply` VALUES ('7', '2', '129', '160', '随着环保法规的出台、消费者环保意识的日益提高，企业为了降低污染治理费用及污染处罚费用，减少废弃物堆放量，树立良好的形象，企业的逆向物流活动渐渐被提上了日程，逆向物流作为一个新兴业态，许多企业原有的物流体系都没有包含逆向物流子系统。对于中小企业而言，其实力不够雄厚，无力投资进行逆向物流子系统的建设，需要把逆向物流业务外包。对于大型企业，在竞争日益激烈的今天，也有必要把自己不擅长的逆向物流业务外包，把精力放在核心竞争力的培养和发展上面。据报道，国际物流巨头如UPS、联邦快递等公司已经进入我国并专门提供逆向物流管理服务。因此我们可以看到，第三方逆向物流是企业逆向物流发展的必然趋势。', '2016-10-16 23:08:12', '21', '已入选题目[供应链环境下的库存管理研究]，该申请无效', '2016-10-17 10:33:03', '1', '2016-10-16 23:08:12', '2016-10-17 10:33:03');
INSERT INTO `apply` VALUES ('8', '2', '129', '143', '未来希望向物流与供应链方向发展，研究生也希望申请这个专业。\r\n物流在国内未来有一定的发展前景，而且随着一些环保法规，逆向物流会有一定的发展空间，而大部分企业原本的物流体系中不包含逆向物流，在这方面缺乏专业程度，因此未来应该会有更多的第三方物流公司提供此类的逆向物流，会是一个发展趋势。', '2016-10-16 23:15:53', '21', '同意', '2016-10-17 10:29:57', '1', '2016-10-16 23:15:53', '2016-10-17 10:29:57');
INSERT INTO `apply` VALUES ('9', '2', '90', '159', '这个暑假在天猫超市的华南区仓库实习，深入参与到现场的订单生产环节，对库区里的布置设计有比较深刻的了解和体会，充分认识到设施布局的合理性对于整体作业效率的影响是极大的。我想选这个课题，来深入研究基于slp方法的设施布局，加强自己的专业知识与专业技能，也希望能发现多一些可优化点并进行优化。', '2016-10-16 23:16:48', '28', '已入选题目[我国民营快递公司发展过程中的问题及对策研究]，该申请无效', '2016-10-18 17:02:02', '1', '2016-10-16 23:16:48', '2016-10-18 17:02:02');
INSERT INTO `apply` VALUES ('10', '2', '136', '157', '在真功夫送过半年外卖，可以获得相关数据信息，也确实发现不少问题', '2016-10-16 23:30:02', '21', '申请未通过，该题已有同学入选！', '2016-10-17 10:31:55', '1', '2016-10-16 23:30:02', '2016-10-17 10:31:55');
INSERT INTO `apply` VALUES ('11', '2', '136', '160', '随着餐饮业的不断发展、移动终端的普及和外卖平台的出现，通过网上订餐变得更方便，掀起了互联网外卖的竞争热潮。但是，配送问题一直是外卖的难点，我们学校外卖配送时间经常四十分钟以上，有时两个钟情况也经常发生', '2016-10-16 23:38:27', '21', '已入选题目[供应链环境下的库存管理研究]，该申请无效', '2016-10-17 10:33:03', '1', '2016-10-16 23:38:27', '2016-10-17 10:33:03');
INSERT INTO `apply` VALUES ('13', '2', '333', '171', '杨老师，您好！我选您这个课题是基于我非常对大数据、电商这块很有兴趣，自己也在校期间做了两个创业分析，其中对电商有些小研究。', '2016-10-16 23:46:13', '13', '已入选题目[基于第三方物流的农产品供应模式研究]，该申请无效', '2016-10-17 21:04:21', '1', '2016-10-16 23:46:13', '2016-10-17 21:04:21');
INSERT INTO `apply` VALUES ('16', '2', '22', '145', '1.贴近生活的工业工程优化设计\r\n2.对平面图，效果图、视角图有一定的了解\r\n3.希望能通过自己的设计为母校留下一些印记', '2016-10-16 23:53:59', '26', '已入选题目[我国快递企业的智能快递柜选址策略研究]，该申请无效', '2016-10-18 07:26:39', '1', '2016-10-16 23:53:59', '2016-10-18 07:26:39');
INSERT INTO `apply` VALUES ('17', '2', '22', '171', '曹老师，您好！我是工工2班的杜永伟，很希望能选上好你的课题，我自身对宿舍、室内的布局设计有着浓厚的兴趣，同时，在这块，希望能在您的指导下能更深入的研究。谢谢！', '2016-10-16 23:55:46', '26', '已入选题目[基于第三方物流的农产品供应模式研究]，该申请无效', '2016-10-17 21:04:21', '1', '2016-10-16 23:55:46', '2016-10-17 21:04:21');
INSERT INTO `apply` VALUES ('18', '2', '136', '171', '方老师，您好！我是工工2班的杜永伟，很希望能选上好你的课题，我自身对曾想做餐饮项目时候对外卖的配送有过一些小探究，同时，也非常关注现在外卖配上的动态，希望在这个课题上能在您的指导下能更深入的研究。谢谢！', '2016-10-16 23:58:52', '21', '已入选题目[基于第三方物流的农产品供应模式研究]，该申请无效', '2016-10-17 21:04:21', '1', '2016-10-16 23:58:52', '2016-10-17 21:04:21');
INSERT INTO `apply` VALUES ('19', '2', '212', '171', '宋老师，您好！我是工工2班的杜永伟，很希望能选上好你的课题，我自身对农产品输送、电商发展等问题有着浓厚的兴趣，也一直想做农产品电商创业项目。希望能在您的指导下在农产品第三方物流这个问题上进行更深入的研究。谢谢！', '2016-10-17 00:03:02', '14', '同意选题，但是这个题目在文字表达上可能会有小小的修改。我们可以商量。', '2016-10-17 21:04:21', '1', '2016-10-17 00:03:02', '2016-10-17 21:04:21');
INSERT INTO `apply` VALUES ('21', '2', '22', '174', '之前学的课程当中，人因工程是非常有趣的一门课。确实，人类的生活中接触的很多东西，通常只是考虑到最基本的作用性，往往会忽略很多人性化的细节设计。比如，饭堂的椅子之间的间距是否太窄，吃饭的时候不太方便？课室的投影屏幕是否太偏于一侧，导致另一侧的同学不容易观看屏幕？这些都是很有趣的话题。因为人类现在所处的环境非常复杂，就我们所经常使用的产品都成千上万、数不胜数。这些产品如何设计，才能从生理、心理、安全、精神等多个层次符合人类的要求，或者如何协调产品之间的关系，才能促使它们达到最大的使用效益。宿舍，也许是一名学生从小学起，到大学结束的将近20年的时间里面一直待的地方。宿舍，也是众多伟大奇迹诞生的地方。扎克伯格的脸书，拉里佩奇的谷歌公司等等都是在大学宿舍诞生的。学生是每个国家未来的花朵，而宿舍就是培育的花盆。宿舍是每一名学生都需要待很长一段时间的地方，然而我们还是能看到宿舍中存在非常多不人性化的设计。这些缺乏人因工程的思想的建设起来的宿舍，无疑极大的影响了学生们的创造知识的环境，迫使不少的学生把心思浪费在其他的事情中。因此，我非常希望能够研究曹咏老师的课题“学', '2016-10-17 00:17:16', '26', '申请未通过，该题已有同学入选！', '2016-10-17 15:27:26', '1', '2016-10-17 00:17:16', '2016-10-17 15:27:26');
INSERT INTO `apply` VALUES ('22', '1', '295', '65', '对课题方向感兴趣，希望获得指导。', '2016-10-17 01:20:45', '14', '申请未通过，该题已有同学入选！', '2016-10-17 20:34:40', '1', '2016-10-17 01:20:45', '2016-10-17 20:34:40');
INSERT INTO `apply` VALUES ('23', '1', '296', '65', '对课题方向感兴趣，希望获得指导。', '2016-10-17 01:21:22', '14', '申请未通过，该题已有同学入选！', '2016-10-17 20:35:33', '1', '2016-10-17 01:21:22', '2016-10-17 20:35:33');
INSERT INTO `apply` VALUES ('24', '1', '337', '65', '对课题方向感兴趣，希望获得指导。', '2016-10-17 01:25:37', '11', '同意。', '2016-10-17 19:43:33', '1', '2016-10-17 01:25:37', '2016-10-17 19:43:33');
INSERT INTO `apply` VALUES ('25', '1', '335', '65', '对课题方向感兴趣，希望获得指导。', '2016-10-17 01:26:25', '11', '已入选题目[互联网思维下用户参与产品设计研究——以某某企业为例]，该申请无效', '2016-10-17 19:43:33', '1', '2016-10-17 01:26:25', '2016-10-17 19:43:33');
INSERT INTO `apply` VALUES ('26', '2', '325', '171', '宋老师，您好！我是工工2班的杜永伟，很希望能选上好你的课题，我自身对快递物流的布局有着浓厚的兴趣，同时，在这块，希望能在您的指导下能更深入的研究。谢谢！', '2016-10-17 08:09:48', '19', '申请未通过，该题已有同学入选！', '2016-10-18 17:02:02', '1', '2016-10-17 08:09:48', '2016-10-18 17:02:02');
INSERT INTO `apply` VALUES ('27', '2', '136', '156', '方老师，早上好，我是工工1班吴思彬同学。以下是申请理由:首先外卖配送是非常重要的一项活动，是直接与消费者相连的环节。而且配送成本占餐饮企业运营成本相当的一部分比例，配送线路规划的合理与否对配送的速度、成本、效益、消费者对该餐饮企业线下体验评价的影响明显，特别是多消费者配送路线的规划更复杂。我们知道如今“互联网+餐饮”的潮流造就一大批o2o的餐饮企业，其中外卖配送的规划质量更是参差不齐，因此可以观察分析出餐饮企业外卖配送的优化研究课题具有十分重要的研究意义和必要性、及时性。作为一名华农大学生，在经过3年多的学术熏陶，在老师们的教导中，激发起我对路线规划和成本优化这一块的兴趣，希望用所学的知识和这段时间的实习经历，在老师您的指导下完成这项课题。', '2016-10-17 08:12:36', '21', '同意', '2016-10-17 10:31:55', '1', '2016-10-17 08:12:36', '2016-10-17 10:31:55');
INSERT INTO `apply` VALUES ('28', '2', '327', '171', '宋老师，您好！我是工工2班的杜永伟，很希望能选上好你的课题，我自身对智能快递物流的布局有着浓厚的兴趣，同时，在这块，希望能在您的指导下能更深入的研究。谢谢！', '2016-10-17 08:12:43', '19', '申请未通过，该题已有同学入选！', '2016-10-18 07:26:39', '1', '2016-10-17 08:12:43', '2016-10-18 07:26:39');
INSERT INTO `apply` VALUES ('29', '2', '130', '195', '本人选择本题目不是盲目的选择，而是经过仔细的考虑，结合本人对本课题知识的掌握程度与出题老师的要求，而做出的选择。我承诺在完成毕业论文期间，通过查阅和阅读文献及相关书籍，大致确定好论文中所要表现的方向，在巩固复习质量控制知识的基础上进一步提高论文的质量。我将会严格要求自己，端正自己的态度，认真合理的按要求完成论文，不会出现抄袭应付差事的行为。一定要作出让自己和导师满意的论文。恳请老师批准通过我的申请。', '2016-10-17 08:47:56', '21', '同意', '2016-10-17 10:42:45', '1', '2016-10-17 08:47:56', '2016-10-17 10:42:45');
INSERT INTO `apply` VALUES ('30', '2', '133', '195', '本人经过考虑，觉得我对于供应链还有库存管理方面的知识较为感兴趣，而且本人喜欢老师这种干脆利落的行事风格，觉得在完成毕业论文期间，在严格要求自己的基础上，通过老师的指导，可以更好的完成毕业论文。本人承诺在完成论文过程中，积极主动参考相关文献和学习相关知识，收集相关资料，为毕业论文的编写打下扎实基础，按时按量完成任务，不抄袭不应付，争取做出让自己和老师满意的毕业论文。', '2016-10-17 08:56:18', '21', '已入选题目[生产过程质量控制研究]，该申请无效', '2016-10-17 10:42:45', '1', '2016-10-17 08:56:18', '2016-10-17 10:42:45');
INSERT INTO `apply` VALUES ('31', '2', '129', '195', '本人经过考虑，觉得我对于物流与供应链方面的知识掌握得比较扎实且较为感兴趣。同时在完成毕业论文期间，在严格要求自己的基础上，通过老师的指导，可以更好的完成毕业论文。本人承诺在完成论文过程中，不仅会积极主动参考相关文献和学习相关知识，收集相关资料，为毕业论文的编写打下扎实基础，同时按时按量完成任务，不抄袭不应付了事，争取做出让自己和老师满意的毕业论文。恳请老师通过本人的申请。', '2016-10-17 09:00:47', '21', '已入选题目[生产过程质量控制研究]，该申请无效', '2016-10-17 10:42:45', '1', '2016-10-17 09:00:47', '2016-10-17 10:42:45');
INSERT INTO `apply` VALUES ('32', '2', '22', '195', '本人慎重考虑，基于对人因工程方面知识的掌握程度与兴趣程度，结合出题老师的要求，做出了对本题目的选择。同时本题目是以学生宿舍作为研究对象，不仅贴近我们的生活，与我们的生活环境息息相关，同时能使论文的资料收集方面的工作更加容易展开，这样就能很好的去研究与完成本题目的毕业论文编写。同时本人承若在完成论文期间，主动参考文献，收集资料，做到不抄袭不应付了事，认真踏实完成本题目的毕业论文，争取做出一份让老师和自己都满意的毕业论文。恳请老师批准我的申请。', '2016-10-17 09:08:59', '26', '申请未通过，该题已有同学入选！', '2016-10-17 15:27:26', '1', '2016-10-17 09:08:59', '2016-10-17 15:27:26');
INSERT INTO `apply` VALUES ('33', '2', '21', '195', '本人慎重考虑，基于对人因工程方面知识的掌握程度与兴趣程度，结合出题老师的要求，做出了对本题目的选择。同时本题目是生产作业空间作为研究对象，在各行各业都会涉及到生产作业，与我们的生活也息息相关，所以我可以更好地对此进行研究与资料收集，能很好的去研究与完成本题目毕业论文的编写。同时本人承若在完成论文期间，主动参考文献，收集资料，做到不抄袭不应付了事，认真踏实完成本题目的毕业论文，争取做出一份让老师和自己都满意的毕业论文。恳请老师批准我的申请。', '2016-10-17 09:12:04', '26', '申请未通过，该题已有同学入选！', '2016-10-17 16:17:47', '1', '2016-10-17 09:12:04', '2016-10-17 16:17:47');
INSERT INTO `apply` VALUES ('34', '2', '23', '172', '我现于一家物流供应链公司实习——心怡科技供应链管理有限公司增城分公司，部门为工程部，主要实习地为该公司自动化仓库，因该公司的所有机器及设备均由工程部管控，所以每天都在接触各种机器设备，希望通过这次论文，提高对人机系统分析和改善的理解和能力', '2016-10-17 09:32:14', '26', '已入选题目[绿色物流系统体系评价方法研究]，该申请无效', '2016-10-17 20:37:56', '1', '2016-10-17 09:32:14', '2016-10-17 20:37:56');
INSERT INTO `apply` VALUES ('35', '2', '22', '142', '这个论文题目的实用性很强，可以通过人因工程的分析帮助学生改善宿舍的居住舒适感，增强学生幸福感，我也对人因工程这方面的毕业设计抱有非常大的热情', '2016-10-17 09:45:50', '26', '同意', '2016-10-17 15:27:26', '1', '2016-10-17 09:45:50', '2016-10-17 15:27:26');
INSERT INTO `apply` VALUES ('36', '1', '147', '49', '张老师您好，我是信管1班的杨媚。实习期间接触过人力资源管理方面的实习，因此对此题目产生了兴趣。随着经济的增速发展，人才的培养变得十分关键，如何培养出企业需要的人才也变得不容忽视。我希望能通过自己的调研和实践，以及老师的指导完成此论文，分析人才需求，探寻如何培养出优秀的创新型人才。谢谢！', '2016-10-17 09:48:01', '15', '申请未通过，该题已有同学入选！', '2016-10-17 23:55:03', '1', '2016-10-17 09:48:01', '2016-10-17 23:55:03');
INSERT INTO `apply` VALUES ('40', '2', '22', '178', '高中开始住宿，平时也会关注不同学校的学生宿舍，对于不同的学生宿舍环境有所了解。\r\n\r\n平时在宿舍活动的时候会发现许多不符合人因设计的地方，希望能对此提出一定的改善意见。\r\n\r\n大二学习人因工程课程的时候我的研究对象也主要是学生宿舍环境。', '2016-10-17 10:17:22', '26', '已入选题目[基于大数据的自动问卷情感分析]，该申请无效', '2016-10-19 13:47:39', '1', '2016-10-17 10:17:22', '2016-10-19 13:47:39');
INSERT INTO `apply` VALUES ('41', '2', '330', '178', '实习期间能够跟各种不同类型的客户接触，有机会提供社会各个不同层次，不同岗位的人员的数据。\r\n\r\n对大数据分析感兴趣，希望能在毕业论文的完成过程中一边学习，一边提升自己。', '2016-10-17 10:29:34', '13', '同意', '2016-10-19 13:47:39', '1', '2016-10-17 10:29:34', '2016-10-19 13:47:39');
INSERT INTO `apply` VALUES ('42', '1', '296', '49', '宋老师您好，我是13信管1班的杨媚。目前，农业信息化建设进入了快速发展阶段,各个涉农网站中都存有大量的农业数据,并且数据每天仍在以指数级的速度增长。但这些数据只是原始信息,包含大量模糊的,带有噪声的信息,如果想让他们作为知识被人们所直接利用，过程中必不可少的就是进行数据分析和挖掘。因此，希望能有机会通过实践和老师的指导，做进一步的调查研究，完成此论文。', '2016-10-17 10:35:20', '14', '已入选题目[数据挖掘在股票分析中的应用]，该申请无效', '2016-10-17 21:01:32', '1', '2016-10-17 10:35:20', '2016-10-17 21:01:32');
INSERT INTO `apply` VALUES ('43', '1', '335', '53', '毕业实习从事相关工作', '2016-10-17 10:41:27', '11', '已入选题目[电子政务数据开放与利用研究]，该申请无效', '2016-10-17 19:43:11', '1', '2016-10-17 10:41:27', '2016-10-17 19:43:11');
INSERT INTO `apply` VALUES ('44', '2', '94', '178', 'MATLAB的学习虽然不是很优秀但是也算认真，希望在之前的基础上有所突破。\r\n\r\n希望自己的毕业论文不仅是一篇文章，更有实际的成品得出。', '2016-10-17 10:42:02', '12', '已入选题目[基于大数据的自动问卷情感分析]，该申请无效', '2016-10-19 13:47:39', '1', '2016-10-17 10:42:02', '2016-10-19 13:47:39');
INSERT INTO `apply` VALUES ('46', '2', '92', '178', '可以以学校图书馆，大学城各个图书馆和新旧广州图书馆，中山图书馆为对象进行研究', '2016-10-17 10:48:59', '28', '已入选题目[基于大数据的自动问卷情感分析]，该申请无效', '2016-10-19 13:47:39', '1', '2016-10-17 10:48:59', '2016-10-19 13:47:39');
INSERT INTO `apply` VALUES ('47', '2', '22', '161', '之前曾经做过同样的分析，而且大学几年对宿舍的设计有深入是观察过！', '2016-10-17 10:51:55', '26', '已入选题目[基于人因学的数字化人机界面分析与改善]，该申请无效', '2016-10-17 16:25:57', '1', '2016-10-17 10:51:55', '2016-10-17 16:25:57');
INSERT INTO `apply` VALUES ('48', '2', '93', '161', '超市是城市里普遍的存在，一个大型的超市其布局和设计，离不开工业工程的基本方法，工业工程应该应用于生活各方面，而不止是制造业上！', '2016-10-17 10:57:14', '28', '申请未通过，该题已有同学入选！', '2016-10-18 15:17:07', '1', '2016-10-17 10:57:14', '2016-10-18 15:17:07');
INSERT INTO `apply` VALUES ('49', '1', '334', '53', '想学习了解人力资源管理', '2016-10-17 11:00:32', '11', '已入选题目[电子政务数据开放与利用研究]，该申请无效', '2016-10-17 19:43:11', '1', '2016-10-17 11:00:32', '2016-10-17 19:43:11');
INSERT INTO `apply` VALUES ('50', '1', '337', '53', '想从事相关工作', '2016-10-17 11:04:00', '11', '申请未通过，该题已有同学入选！', '2016-10-17 19:43:33', '1', '2016-10-17 11:04:00', '2016-10-17 19:43:33');
INSERT INTO `apply` VALUES ('52', '1', '341', '53', '对于该题目感兴趣', '2016-10-17 11:05:31', '11', '同意。', '2016-10-17 19:43:11', '1', '2016-10-17 11:05:31', '2016-10-17 19:43:11');
INSERT INTO `apply` VALUES ('54', '2', '87', '161', '车站是人流密集的公共场所，建设者对于车站的建立已经很成熟，所以其中一定包含着工业工程的一些方法，对其进行系统的研究，可以证明工业工程在各方面都有应用，说明工业工程的的普遍性！', '2016-10-17 11:14:17', '28', '申请未通过，该题已有同学入选！', '2016-10-18 15:37:04', '1', '2016-10-17 11:14:17', '2016-10-18 15:37:04');
INSERT INTO `apply` VALUES ('55', '2', '72', '168', '欧阳老师好，目前我在广州丽高塑料制品有限公司实习，该公司在大力推进精益生产，目的在于减少浪费，降低成本，迈向精益，实现智造。所以觉得自己适合老师给出的论文课题研究，希望老师给予我与老师共同学习的机会', '2016-10-17 11:18:17', '28', '申请未通过，该题已有同学入选！', '2016-10-18 15:41:49', '1', '2016-10-17 11:18:17', '2016-10-18 15:41:49');
INSERT INTO `apply` VALUES ('56', '1', '8', '74', '对调研类的研究有较大的兴趣，大三寒假曾参加过由华南理工大学出版社举办的“基于大数据时代背景下的广东省古村落文化大数据采集项目”作为团队负责人负责肇庆市封开县汶塘村，德庆县金林村、罗洪村，怀集县何屋村以及四会市铁坑村等五个村落的网络数据与实地数据采集、整理、以及报告撰写工作；大三暑假曾参加过由中山大学国家治理研究院社会科学调查中心举办的“2016中国劳动力动态调查”的项目，负责肇庆市封开县的实地项目调查、报告撰写工作。在项目开展前有相关培训以及项目进行过程中有自己的调查经验，因此在调研以及统计分析数据方面有一定基础。', '2016-10-17 11:21:05', '4', '已入选题目[冷链运输载具中温湿度场及CO2浓度场的测度与仿真]，该申请无效', '2016-10-18 15:19:23', '1', '2016-10-17 11:21:05', '2016-10-18 15:19:23');
INSERT INTO `apply` VALUES ('58', '2', '72', '165', '于广州心怡科技物流有限公司实习，了解公司运营及相关数据，想通过对其进行精益生产研究，降低成本，提高生产效率，创造更多价值。', '2016-10-17 11:25:53', '28', '申请未通过，该题已有同学入选！', '2016-10-18 15:41:49', '1', '2016-10-17 11:25:53', '2016-10-18 15:41:49');
INSERT INTO `apply` VALUES ('59', '2', '77', '168', '老师好，我在广州丽高实习，可以接触到很多的流水线生产线，目前公司在大力推行时效提升活动，必然会涉及到线平衡研究，公司在致力于消除浪费，迈向精益，实现制造，所以也希望可以以老师的课题作为自己的毕业论文选题。谢谢。', '2016-10-17 11:26:45', '28', '同意', '2016-10-18 15:40:17', '1', '2016-10-17 11:26:45', '2016-10-18 15:40:17');
INSERT INTO `apply` VALUES ('60', '2', '327', '161', '智能快递柜是在这两年在我们的生活中普遍应用的，我对于它的出现十分感兴趣，智能柜在地址的选取策略方面，一定存在着许多可以分析的数据，如果让我研究这个题目，我将会去实地记录广州市不同地区，包括小区，学校，企业等多种场所里快递柜的布置情况，结合对群众的调查，搜集数据结合各种参考资料来完成论文的撰写', '2016-10-17 11:27:20', '19', '申请未通过，该题已有同学入选！', '2016-10-18 07:26:39', '1', '2016-10-17 11:27:20', '2016-10-18 07:26:39');
INSERT INTO `apply` VALUES ('64', '1', '10', '74', '本课题主要考察学生们的动手能力，以及在实验现场的发散思维、数据统计与分析的能力。我对调研类的研究项目有较大的兴趣，大三寒假曾参加过由华南理工大学出版社举办的“基于大数据时代背景下的广东省古村落文化大数据采集项目”作为团队负责人负责肇庆市封开县汶塘村，德庆县金林村、罗洪村，怀集县何屋村以及四会市铁坑村等五个村落的实地数据采集；大三暑假曾参加过由中山大学国家治理研究院社会科学调查中心举办的“2016中国劳动力动态调查”的项目，负责肇庆市封开县的实地项目调查。在项目开展前有相关培训以及项目进行过程中有自己的调查经验，因此在实地调研以及统计分析数据方面有一定基础。这个课题属于实地调查类的课题，因此看到这个课题的第一时间，有比较大的研究兴趣。', '2016-10-17 11:33:54', '4', '已入选题目[经济新常态背景下企业创新型人才需求分析——以志高空调集团为例]，该申请无效', '2016-10-18 15:19:23', '1', '2016-10-17 11:33:54', '2016-10-18 15:19:23');
INSERT INTO `apply` VALUES ('66', '2', '325', '192', '目前我在德邦物流公司实习，公司的快递部门在前年刚刚启动，在去年已达到四通一达的发展水平，但是在发展的过程中也有许多问题。希望可以借此机会，实地调研民营快递企业在发展中遇到的问题，并且通过结合所学的物流知识，找到企业解决问题的方法，例如，如何在保证运物完好的同时保证时效，或者在零担快递运输时的利润最大化等问题都可研究。在选题的过程中本人经过慎重考虑，写论文的过程中会严格遵守老师以及学院的要求，坚决反对论文抄袭，恳请老师可以选择我的申请。', '2016-10-17 11:38:26', '19', '申请未通过，该题已有同学入选！', '2016-10-18 17:02:02', '1', '2016-10-17 11:38:26', '2016-10-18 17:02:02');
INSERT INTO `apply` VALUES ('67', '2', '188', '192', '由于本人在物流公司华南总部实习，经过了解到，公司的一线营业点在全国范围内有五千余个，公司的快递也在去年实现了与四通一达相同的规模，在公司内可以通过系统查询到全国范围内营业点分布情况以及每季度营收情况，通过所学的运筹学与设施规划等知识，可以分析出营业点布局的优缺点并且在一定程度下优化，以实现利润最大化。在选题的过程中本人经过慎重考虑，写论文的过程中会严格遵守老师以及学院的要求，坚决反对论文抄袭，恳请老师可以选择我的申请。', '2016-10-17 11:57:30', '19', '申请未通过，该题已有同学入选！', '2016-10-18 23:09:09', '1', '2016-10-17 11:57:30', '2016-10-18 23:09:09');
INSERT INTO `apply` VALUES ('68', '2', '21', '149', '可选定一个作业空间进行分析，本人对该题目十分感兴趣。', '2016-10-17 12:01:35', '26', '同意', '2016-10-17 16:17:47', '1', '2016-10-17 12:01:35', '2016-10-17 16:17:47');
INSERT INTO `apply` VALUES ('70', '1', '362', '92', '个人对网站设计有一定的实习经验', '2016-10-17 12:08:02', '27', '系统显示你选了2个题目，这一个题目相对来说好完成一点，选这个给你。', '2016-10-18 11:09:38', '1', '2016-10-17 12:08:02', '2016-10-18 11:09:38');
INSERT INTO `apply` VALUES ('71', '2', '22', '164', '本人想从已建好并且已有学生入住的宿舍来分析 总结出不符合人因工程的设计类别以及改进方法', '2016-10-17 12:13:00', '26', '已入选题目[基于视觉的木材工件缺陷检测技术研究]，该申请无效', '2016-10-17 16:55:18', '1', '2016-10-17 12:13:00', '2016-10-17 16:55:18');
INSERT INTO `apply` VALUES ('72', '1', '363', '92', '个人对网站设计有一定的实习经验', '2016-10-17 12:14:23', '27', '已入选题目[毕业班级网站设计与实现]，该申请无效', '2016-10-18 11:09:38', '1', '2016-10-17 12:14:23', '2016-10-18 11:09:38');
INSERT INTO `apply` VALUES ('73', '2', '94', '164', '本人将通过matlab形态学检测方法来完成该毕业设计，用边缘拟合将机器视觉中的工件与标准件比较从而得出是否有缺陷', '2016-10-17 12:21:04', '12', '可以', '2016-10-17 16:55:18', '1', '2016-10-17 12:21:04', '2016-10-17 16:55:18');
INSERT INTO `apply` VALUES ('74', '2', '89', '164', '本人将通过matlab算法对机器视觉中的皇帝柑的坏点进行识别从而检测出外观或形状方面不合格的皇帝柑', '2016-10-17 12:23:27', '12', '申请未通过，该题已有同学入选！', '2016-10-18 11:09:50', '1', '2016-10-17 12:23:27', '2016-10-18 11:09:50');
INSERT INTO `apply` VALUES ('75', '2', '24', '164', '本人将通过人因工程的方法以及视角去寻找并且分析工作强度较大、重复性较高的工作，并且通过工作流程设计寻找预防方法', '2016-10-17 12:25:40', '26', '已入选题目[基于视觉的木材工件缺陷检测技术研究]，该申请无效', '2016-10-17 16:55:18', '1', '2016-10-17 12:25:40', '2016-10-17 16:55:18');
INSERT INTO `apply` VALUES ('76', '2', '331', '192', '由于本人在物流公司总部实习，工作中可以接触到北京，上海，广佛三大总部的指标数据，在公司内可以通过系统查询到全国范围内营业点分布情况以及每季度营收情况，希望老师可以指导我通过网络大数据分析，可以将其同行的数据与之分析，对目前物流行业的状况进行一个全面的剖析。在选题的过程中本人经过慎重考虑，写论文的过程中会严格遵守老师以及学院的要求，坚决反对论文抄袭，恳请老师可以选择我的申请。', '2016-10-17 12:32:53', '13', '已入选题目[广东省生鲜农产品流通模式研究]，该申请无效', '2016-10-17 20:37:39', '1', '2016-10-17 12:32:53', '2016-10-17 20:37:39');
INSERT INTO `apply` VALUES ('77', '2', '21', '165', '于广州心怡科技物流公司实习，想通过对公司生产作业空间的人因分析来改善作业环境，从而达到提高生产效率，降低成本的目的', '2016-10-17 12:35:30', '26', '已入选题目[基于SLP方法的某公司布置优化]，该申请无效', '2016-10-18 15:23:54', '1', '2016-10-17 12:35:30', '2016-10-18 15:23:54');
INSERT INTO `apply` VALUES ('78', '2', '212', '192', '目前本人在一家国内较为大的物流企业总部实习，希望可以结合工作中的内容，将物流相关知识与校内优势产品结合，并且收集国内各大第三方物流平台的供应商信息，以分析平台的供应模式为基础，找到国内农产品网上供应的弊端，解决此问题并且建立一个更加完善的农产品供应模式。在选题的过程中本人经过慎重考虑，写论文的过程中会严格遵守老师以及学院的要求，坚决反对论文抄袭，恳请老师可以选择我的申请。', '2016-10-17 12:41:29', '14', '申请未通过，该题已有同学入选！', '2016-10-17 21:04:21', '1', '2016-10-17 12:41:29', '2016-10-17 21:04:21');
INSERT INTO `apply` VALUES ('79', '2', '21', '197', '与专业比较相关，可以充分运用到自己的专业知识，同时实践性比较强，可以运用到未来的工作中。', '2016-10-17 12:44:26', '26', '申请未通过，该题已有同学入选！', '2016-10-17 16:17:47', '1', '2016-10-17 12:44:26', '2016-10-17 16:17:47');
INSERT INTO `apply` VALUES ('80', '2', '23', '197', '与专业比较相关，可以充分运用到自己的专业知识，同时实践性比较强，可以运用到未来的工作中。', '2016-10-17 12:45:18', '26', '同意', '2016-10-17 15:54:38', '1', '2016-10-17 12:45:18', '2016-10-17 15:54:38');
INSERT INTO `apply` VALUES ('81', '2', '77', '197', '与专业比较相关，可以充分运用到自己的专业知识，同时实践性比较强，可以运用到未来的工作中。', '2016-10-17 12:45:36', '28', '申请未通过，该题已有同学入选！', '2016-10-18 15:40:17', '1', '2016-10-17 12:45:36', '2016-10-18 15:40:17');
INSERT INTO `apply` VALUES ('82', '1', '358', '92', '曾经了解过关于图书馆管理信息系统的设计', '2016-10-17 12:46:31', '26', '已入选题目[毕业班级网站设计与实现]，该申请无效', '2016-10-18 11:09:38', '1', '2016-10-17 12:46:31', '2016-10-18 11:09:38');
INSERT INTO `apply` VALUES ('83', '2', '90', '197', '与专业比较相关，可以充分运用到自己的专业知识，同时实践性比较强，可以运用到未来的工作中。', '2016-10-17 12:48:18', '28', '申请未通过，该题已有同学入选！', '2016-10-18 15:35:52', '1', '2016-10-17 12:48:18', '2016-10-18 15:35:52');
INSERT INTO `apply` VALUES ('84', '1', '296', '92', '对数据挖掘有了解', '2016-10-17 12:49:10', '14', '已入选题目[毕业班级网站设计与实现]，该申请无效', '2016-10-18 11:09:38', '1', '2016-10-17 12:49:10', '2016-10-18 11:09:38');
INSERT INTO `apply` VALUES ('87', '2', '218', '192', '目前冷链物流仍然是国内物流运输行业的一个瓶颈，如何在长途的运输中保证生鲜农副产品的保鲜度，是此课题的研究的一个关键问题，在珠三角地区的种植业，除了自给自销外，有的运往北方地区，大多是运往港澳地区这些种植业发展成本较高的地区，在这种情况下，产品的保鲜值显得尤为重要，并且通过本课题的研究，可以调研广东省内农产品的物流模式，为日后打造一个完善的物流平台作数据基础。在选题的过程中本人经过慎重考虑，写论文的过程中会严格遵守老师以及学院的要求，坚决反对论文抄袭，恳请老师可以选择我的申请。', '2016-10-17 12:52:00', '14', '同意选题，请把你的班级姓名学号QQ号以及题目发到我手机上。', '2016-10-17 20:37:39', '1', '2016-10-17 12:52:00', '2016-10-17 20:37:39');
INSERT INTO `apply` VALUES ('90', '2', '22', '193', '曾经上过曹咏老师的课后感觉人因工程这门课能让我提高对工业工程的理解,对我以后从事工业工程这一行有帮助.曹咏老师的课上能学到很多知识.而老师的论文题目我感觉也很对口.所以经过考虑后,我希望能在曹用老师的指导完成毕业论文,希望老师能给我机会,谢谢.', '2016-10-17 12:54:07', '26', '已入选题目[生产企业工人肌肉骨骼失调分析及预防]，该申请无效', '2016-10-17 16:00:40', '1', '2016-10-17 12:54:07', '2016-10-17 16:00:40');
INSERT INTO `apply` VALUES ('91', '2', '72', '197', '与专业比较相关，可以充分运用到自己的专业知识，同时实践性比较强，可以运用到未来的工作中。', '2016-10-17 12:54:20', '28', '申请未通过，该题已有同学入选！', '2016-10-18 15:41:49', '1', '2016-10-17 12:54:20', '2016-10-18 15:41:49');
INSERT INTO `apply` VALUES ('92', '2', '24', '193', '个人对人因工程有兴趣意向,曾经上过曹咏老师的课后感觉人因工程这门课能让我提高对工业工程的理解,对我以后从事工业工程这一行有帮助.曹咏老师的课上能学到很多知识.而老师的论文题目我感觉也很对口.所以经过考虑后,我希望能在曹用老师的指导完成毕业论文,希望老师能给我机会,谢谢.', '2016-10-17 12:55:28', '26', '同意', '2016-10-17 16:00:40', '1', '2016-10-17 12:55:28', '2016-10-17 16:00:40');
INSERT INTO `apply` VALUES ('93', '2', '331', '193', '大数据这门课题现在比较热门,虽然我对大数据这方面的深入并不是很充足,但个人对数据这一块也比较感兴趣,如果以后有机会也希望能从事这一行,所以毕业论文能看到大数据方面的论文题目有些庆幸.希望老师能够指导我,帮助我.谢谢', '2016-10-17 12:56:19', '13', '已入选题目[生产企业工人肌肉骨骼失调分析及预防]，该申请无效', '2016-10-17 16:00:40', '1', '2016-10-17 12:56:19', '2016-10-17 16:00:40');
INSERT INTO `apply` VALUES ('94', '2', '330', '193', '大数据这门课题现在比较热门,虽然我对大数据这方面的深入并不是很充足,但个人对数据这一块也比较感兴趣,如果以后有机会也希望能从事这一行,所以毕业论文能看到大数据方面的论文题目有些庆幸.希望老师能够指导我,帮助我.谢谢', '2016-10-17 12:56:38', '13', '申请未通过，该题已有同学入选！', '2016-10-19 13:47:39', '1', '2016-10-17 12:56:38', '2016-10-19 13:47:39');
INSERT INTO `apply` VALUES ('95', '1', '334', '60', '符合自己的就业方向，希望借此机会对当前信息化时代下的新型人力资源管理模式方法多一些了解', '2016-10-17 12:56:40', '11', '已入选题目[互联网思维下品牌营销运用研究——以某某企业为例]，该申请无效', '2016-10-17 19:42:24', '1', '2016-10-17 12:56:40', '2016-10-17 19:42:24');
INSERT INTO `apply` VALUES ('96', '2', '77', '159', '生产线的平衡是企业高效生产运作的一个重要支持，我想通过采集有效的数据，运用所学的方法与先进的研究方法来对生产线平衡的深入研究分析，来加强对生产制造的认识，并深入思考生产线的可优化点，结合具体的生产线与具体有效的数据，对具体的生产线进行优化设计。', '2016-10-17 12:57:42', '28', '已入选题目[我国民营快递公司发展过程中的问题及对策研究]，该申请无效', '2016-10-18 17:02:02', '1', '2016-10-17 12:57:42', '2016-10-18 17:02:02');
INSERT INTO `apply` VALUES ('99', '2', '94', '193', '曾经上过熊俊涛老师的课后感觉老师的学术知识渊博,也在课上深刻理解到matlab这项技术能在许多领域中运用,个人也对matlab有兴趣.老师的论文题目也比较喜欢.所以,经过考虑,我希望能在熊俊涛老师的指导下完成毕业论文,希望能给我机会.谢谢', '2016-10-17 12:59:27', '12', '申请未通过，该题已有同学入选！', '2016-10-17 16:55:18', '1', '2016-10-17 12:59:27', '2016-10-17 16:55:18');
INSERT INTO `apply` VALUES ('100', '2', '89', '193', '曾经上过熊俊涛老师的课后感觉老师的学术知识渊博,也在课上深刻理解到matlab这项技术能在许多领域中运用,个人也对matlab有兴趣.老师的论文题目也比较喜欢.所以,经过考虑,我希望能在熊俊涛老师的指导下完成毕业论文,希望能给我机会.谢谢', '2016-10-17 12:59:45', '12', '申请未通过，该题已有同学入选！', '2016-10-18 11:09:50', '1', '2016-10-17 12:59:45', '2016-10-18 11:09:50');
INSERT INTO `apply` VALUES ('101', '2', '91', '193', '曾经上过熊俊涛老师的课后感觉老师的学术知识渊博,也在课上深刻理解到matlab这项技术能在许多领域中运用,个人也对matlab有兴趣.老师的论文题目也比较喜欢.所以,经过考虑,我希望能在熊俊涛老师的指导下完成毕业论文,希望能给我机会.谢谢', '2016-10-17 12:59:52', '12', '申请未通过，该题已有同学入选！', '2016-10-17 16:54:33', '1', '2016-10-17 12:59:52', '2016-10-17 16:54:33');
INSERT INTO `apply` VALUES ('102', '1', '147', '60', '本人就业目标为人力资源方面的相关工作，希望借此机会对于能够了解当前经济形势下企业的人才需求指标，作为自己的一个发展方向，也是自己对于人力资源分析的一次尝试，我会努力做好', '2016-10-17 13:06:47', '15', '申请未通过，该题已有同学入选！', '2016-10-17 23:55:03', '1', '2016-10-17 13:06:47', '2016-10-17 23:55:03');
INSERT INTO `apply` VALUES ('103', '2', '212', '159', '高效的物流环节是加速市场发展的重要支持力量，特别是在农产品供应环节中，优秀的物流供应模式是绝对的支持力量。我想选这个课题，通过收集相应的数据，学习相应的知识，来深入研究第三方物流在农产品市场这一块的供应模式，这能够为我以后进军农产品市场乃至其他市场提供很不错的支撑作用。', '2016-10-17 13:08:35', '14', '已入选题目[我国民营快递公司发展过程中的问题及对策研究]，该申请无效', '2016-10-18 17:02:02', '1', '2016-10-17 13:08:35', '2016-10-18 17:02:02');
INSERT INTO `apply` VALUES ('105', '1', '214', '60', '在风云莫测的股市中，繁多而杂乱无章的数据数据在经过数据挖掘技术的处理后究竟能否转换为我们所需的信息，本人对于这个问题深感好奇，希望可以借此机会多做了解', '2016-10-17 13:24:30', '14', '申请未通过，该题已有同学入选！', '2016-10-17 21:01:32', '1', '2016-10-17 13:24:30', '2016-10-17 21:01:32');
INSERT INTO `apply` VALUES ('107', '1', '335', '60', '希望可以借此机会深刻理解并将学习如何将互联网思维的核心思想运用于企业营销中', '2016-10-17 13:30:15', '11', '同意。', '2016-10-17 19:42:24', '1', '2016-10-17 13:30:15', '2016-10-17 19:42:24');
INSERT INTO `apply` VALUES ('108', '2', '216', '172', '现于一家物流供应链企业实习，所以希望通过这次论文，对绿色物流体系相关的内容有一个具体的理解和掌握。', '2016-10-17 15:00:50', '14', '同意选题，请把你的班级姓名学号QQ号以及题目发到我手机上。', '2016-10-17 20:37:56', '1', '2016-10-17 15:00:50', '2016-10-17 20:37:56');
INSERT INTO `apply` VALUES ('109', '1', '334', '105', '与实习公司，就业规划相关', '2016-10-17 16:00:24', '11', '同意。', '2016-10-17 19:35:39', '1', '2016-10-17 16:00:24', '2016-10-17 19:35:39');
INSERT INTO `apply` VALUES ('110', '2', '92', '172', '人因工程现在在社会上应用较广泛，我想通过这次论文了解现在城市中极具代表性的图书馆中人因的元素', '2016-10-17 16:01:01', '28', '申请未通过，该题已有同学入选！', '2016-10-18 15:17:39', '1', '2016-10-17 16:01:01', '2016-10-18 15:17:39');
INSERT INTO `apply` VALUES ('111', '2', '325', '172', '因本人现就于一家物流供应链企业中实习，所以希望通过这次论文对当今的快递企业所遇到的一些问题进行深入的发现和研究，对今后的工作有所助力', '2016-10-17 16:12:29', '19', '申请未通过，该题已有同学入选！', '2016-10-18 17:02:02', '1', '2016-10-17 16:12:29', '2016-10-18 17:02:02');
INSERT INTO `apply` VALUES ('112', '2', '51', '190', '导师您好，我是工业工程2班的一名学生，对老师的论文方向非常感兴趣，本人目前在一家互联网+农业公司当一名产品经理，我非常推崇UCD——“以用户为中心”的设计，本人对UCD具有一定的了解，对人机交互也有一定的涉猎，人因工程理论知识掌握牢固，希望能够跟随老师完成毕业论文，谢谢！', '2016-10-17 16:12:46', '15', '已经通过。每周五晚上7：00例会，保证时间参加。有事情需要提前跟导师说明。', '2016-10-17 16:36:19', '1', '2016-10-17 16:12:46', '2016-10-17 16:36:19');
INSERT INTO `apply` VALUES ('113', '2', '25', '161', '我会全力完成毕业论文的题目，谢谢老师的关心！', '2016-10-17 16:22:01', '26', '同意', '2016-10-17 16:25:57', '1', '2016-10-17 16:22:01', '2016-10-17 16:25:57');
INSERT INTO `apply` VALUES ('114', '2', '21', '172', '希望对所在实习企业的作业空间进行一些改善工作，希望能通过这次论文体现出来。', '2016-10-17 16:27:33', '26', '已入选题目[绿色物流系统体系评价方法研究]，该申请无效', '2016-10-17 20:37:56', '1', '2016-10-17 16:27:33', '2016-10-17 20:37:56');
INSERT INTO `apply` VALUES ('115', '2', '87', '186', '我以后打算从事工业工程，并且对于应用类的论文比较感兴趣，特别对于工业工程在生活中的应用，我认为工业工程的思维在生活中是很有帮助的。所以我选择工业工程在车站上的应用这个论文题目，希望能的到导师的认可。谢谢。', '2016-10-17 16:52:45', '28', '同意', '2016-10-18 15:37:04', '1', '2016-10-17 16:52:45', '2016-10-18 15:37:04');
INSERT INTO `apply` VALUES ('116', '2', '72', '186', '我对于精益生产方面的学习很感兴趣，特别在看了《金矿》等一系列的书籍后，我对精益生产在工厂方面的贡献感到十分佩服。我愿意参与该论文的研究，对精益生产方面进行更深入的学习，。', '2016-10-17 16:59:13', '28', '申请未通过，该题已有同学入选！', '2016-10-18 15:41:49', '1', '2016-10-17 16:59:13', '2016-10-18 15:41:49');
INSERT INTO `apply` VALUES ('117', '2', '92', '174', '之前学的课程当中，人因工程是非常有趣的一门课。确实，人类的生活中接触的很多东西，通常只是考虑到最基本的作用性，往往会忽略很多人性化的细节设计。比如，饭堂的椅子之间的间距是否太窄，吃饭的时候不太方便？课室的投影屏幕是否太偏于一侧，导致另一侧的同学不容易观看屏幕？这些都是很有趣的话题。因为人类现在所处的环境非常复杂，就我们所经常使用的产品都成千上万、数不胜数。这些产品如何设计，才能从生理、心理、安全、精神等多个层次符合人类的要求，或者如何协调产品之间的关系，才能促使它们达到最大的使用效益。图书馆是学校一个非常重要的地方，是很多同学每天都需要在这里学习的地方。但是，我们图书馆的人因工程设计仍然差强人意。比如华农的图书馆，在复习高峰期的位置总是不能满足学生的需求，我们能否利用人因工程的思想对空间进行最大的优化？还有图书馆的占座问题屡屡遭受同学们的投诉，我们是否能有其他的书桌设计方案防止学生占座，比如结合互联网思想座位资源进行分配。人因工程应用在图书馆环境设计上还有很多，比如窗户是否太大，阳台是否太少，书架位置是否过高等等。我希望借写论文的机会，对这些问题提供一些解决的方案。希望欧阳庆老师能给我这个机会，去参与到这里论文题目的研究当中。', '2016-10-17 17:12:05', '28', '申请未通过，该题已有同学入选！', '2016-10-18 15:17:39', '1', '2016-10-17 17:12:05', '2016-10-18 15:17:39');
INSERT INTO `apply` VALUES ('119', '2', '92', '169', '希望对人因工程的应用得到一定程度的深入', '2016-10-17 17:23:06', '28', '申请未通过，该题已有同学入选！', '2016-10-18 15:17:39', '1', '2016-10-17 17:23:06', '2016-10-18 15:17:39');
INSERT INTO `apply` VALUES ('120', '2', '93', '167', '我现在在超市上班，这个比较熟悉', '2016-10-17 18:29:25', '28', '同意', '2016-10-18 15:17:07', '1', '2016-10-17 18:29:25', '2016-10-18 15:17:07');
INSERT INTO `apply` VALUES ('121', '2', '77', '185', '本人于2016年8月于广日电气设备有限公司实习，实习内容有关于线平衡，布置优化，人力分析这一块的，已经为毕业论文所需的一定数据留底了，希望得到老师相关的指导，如果可以希望老师联系我，或者通过申请，之后给一些资料给老师您做一些指导方向。罗浩，18819447273/697273。', '2016-10-17 18:32:52', '28', '申请未通过，该题已有同学入选！', '2016-10-18 15:40:17', '1', '2016-10-17 18:32:52', '2016-10-18 15:40:17');
INSERT INTO `apply` VALUES ('122', '2', '93', '168', '老师好，本人对人因工程学感兴趣，希望可以通过此次论文选题加深对人因工程的了解，熟悉人因工程在现实环境中的应用；', '2016-10-17 18:37:25', '28', '已入选题目[基于生产线平衡的某生产线的优化]，该申请无效', '2016-10-18 15:40:17', '1', '2016-10-17 18:37:25', '2016-10-18 15:40:17');
INSERT INTO `apply` VALUES ('123', '2', '80', '185', '本人于2016年八月在广州广日电气设备有限公司实习，ie工作。对设施布置优化，线平衡，人机分析这三块有数据支持，也有相关照片。希望获得老师的论题。罗浩，18819447273/697273', '2016-10-17 18:37:41', '28', '已入选题目[基于SLP方法的某公司某车间设施布局研究]，该申请无效', '2016-10-18 15:35:52', '1', '2016-10-17 18:37:41', '2016-10-18 15:35:52');
INSERT INTO `apply` VALUES ('124', '2', '72', '185', '本人于2016年八月在广州广日电气设备有限公司实习，ie工作。对设施布置优化，线平衡，人机分析这三块有数据支持，也有相关照片。希望获得老师的论题。罗浩，18819447273/697273', '2016-10-17 18:38:09', '28', '申请未通过，该题已有同学入选！', '2016-10-18 15:41:49', '1', '2016-10-17 18:38:09', '2016-10-18 15:41:49');
INSERT INTO `apply` VALUES ('125', '2', '92', '168', '老师好，本人对人因工程学感兴趣，希望可以通过此次论文选题加深对人因工程的了解，熟悉人因工程在现实环境中的应用；', '2016-10-17 18:38:46', '28', '已入选题目[基于生产线平衡的某生产线的优化]，该申请无效', '2016-10-18 15:40:17', '1', '2016-10-17 18:38:46', '2016-10-18 15:40:17');
INSERT INTO `apply` VALUES ('126', '2', '90', '185', '本人于2016年八月在广州广日电气设备有限公司实习，ie工作。对设施布置优化，线平衡，人机分析这三块有数据支持，也有相关照片。希望获得老师的论题。罗浩，18819447273/697273', '2016-10-17 18:38:46', '28', '同意', '2016-10-18 15:35:52', '1', '2016-10-17 18:38:46', '2016-10-18 15:35:52');
INSERT INTO `apply` VALUES ('127', '1', '340', '30', '本人现在共青团广东省委员会实习，正协助“智慧团建”——网上共青团的项目开展。对于机关单位利用社交网络工具开展政务、团务有一定的了解和兴趣。', '2016-10-17 18:49:03', '11', '同意。', '2016-10-17 19:40:44', '1', '2016-10-17 18:49:03', '2016-10-17 19:40:44');
INSERT INTO `apply` VALUES ('128', '2', '90', '184', '目前在一汽车配件制造企业中实习，实习为物流实习生，有部分工作接触到车间设施布局的分析。\r\n我认为我可以把实习内容很好地与论文相结合。', '2016-10-17 19:01:26', '28', '已入选题目[工业工程在某医院中的应用]，该申请无效', '2016-10-18 15:42:55', '1', '2016-10-17 19:01:26', '2016-10-18 15:42:55');
INSERT INTO `apply` VALUES ('130', '2', '89', '184', '在上学期学有Matlab，对于通过编程去进行水果识别比较感兴趣，希望可以通过在论文的过程中能够学到更多的知识。', '2016-10-17 19:26:40', '12', '已入选题目[工业工程在某医院中的应用]，该申请无效', '2016-10-18 15:42:55', '1', '2016-10-17 19:26:40', '2016-10-18 15:42:55');
INSERT INTO `apply` VALUES ('131', '2', '87', '170', '现阶段，我国大部分城市的火车站、汽车站、公交车站等都存在着布局不合理的症结，我认为运用工业工程的相关知识可以在一定程度上改善这种情况。', '2016-10-17 19:29:14', '28', '申请未通过，该题已有同学入选！', '2016-10-18 15:37:04', '1', '2016-10-17 19:29:14', '2016-10-18 15:37:04');
INSERT INTO `apply` VALUES ('132', '2', '72', '196', '对该领域有一定的实践经验', '2016-10-17 19:32:04', '28', '申请未通过，该题已有同学入选！', '2016-10-18 15:41:49', '1', '2016-10-17 19:32:04', '2016-10-18 15:41:49');
INSERT INTO `apply` VALUES ('133', '1', '295', '119', '数据挖掘是从大量的、不完全的、有噪声的、模糊的、随机的数据中提取隐含在其中的、人们事先不知道的、但又是潜在有用的信息和知识的过程。个人觉得这道题目是利用一些数据通过不同的模型或者模型的有无去对比分析，用各自的结果再去的出结论，这样会很有说服性。之前有上过商务智能，做过类似的实验，所以对从事数据挖掘这方面有较浓厚的兴趣。', '2016-10-17 19:32:25', '14', '同意选题，请把你的班级姓名学号QQ号以及题目发到我手机上', '2016-10-17 20:34:40', '1', '2016-10-17 19:32:25', '2016-10-17 20:34:40');
INSERT INTO `apply` VALUES ('134', '2', '80', '196', '对该领域有一定的实践经验', '2016-10-17 19:33:20', '28', '申请未通过，该题已有同学入选！', '2016-10-18 15:23:54', '1', '2016-10-17 19:33:20', '2016-10-18 15:23:54');
INSERT INTO `apply` VALUES ('135', '2', '77', '196', '对该领域有一定的实践经验', '2016-10-17 19:34:11', '28', '申请未通过，该题已有同学入选！', '2016-10-18 15:40:17', '1', '2016-10-17 19:34:11', '2016-10-18 15:40:17');
INSERT INTO `apply` VALUES ('136', '2', '92', '186', '图书馆人们学习奋斗的地方，因此环境需要舒适，符合人因才能够让人们更好的坚持下去，如果在图书馆感觉到不舒服则对学习的心情及动力造成影响。并且长期在图书馆学习，如果环境不符合人因会带来身体上的不适。因此我想运用自己已学知识，通过查询资料以及实地考察研究人因工程在图书馆的应用。', '2016-10-17 19:41:17', '28', '已入选题目[工业工程在某车站的应用]，该申请无效', '2016-10-18 15:37:04', '1', '2016-10-17 19:41:17', '2016-10-18 15:37:04');
INSERT INTO `apply` VALUES ('137', '2', '77', '184', '本人目前就职于一汽车配件制造企业，常与公司产线员工接触，每天都需要到产线上指导员工作业，因此与此论文主题比较相符，希望能够在写此论文的过程中除了增加自己的知识，还希望可以提高个人综合能力以及竞争能力，争取日后选择好的就业。', '2016-10-17 19:46:48', '28', '已入选题目[工业工程在某医院中的应用]，该申请无效', '2016-10-18 15:42:55', '1', '2016-10-17 19:46:48', '2016-10-18 15:42:55');
INSERT INTO `apply` VALUES ('139', '2', '72', '198', '在广州兴世机械制造有限公司担任2个月ie工程师实习，在高兴新拿到了ie工程师offer，准备在高新兴一直实习到毕业，有亲身经历。', '2016-10-17 19:48:37', '28', '同意', '2016-10-18 15:41:49', '1', '2016-10-17 19:48:37', '2016-10-18 15:41:49');
INSERT INTO `apply` VALUES ('140', '2', '77', '198', '有实习，工作经历', '2016-10-17 19:48:54', '28', '已入选题目[某有限公司精益生产研究]，该申请无效', '2016-10-18 15:41:49', '1', '2016-10-17 19:48:54', '2016-10-18 15:41:49');
INSERT INTO `apply` VALUES ('141', '2', '80', '198', '有实习工作经历。', '2016-10-17 19:49:10', '28', '已入选题目[某有限公司精益生产研究]，该申请无效', '2016-10-18 15:41:49', '1', '2016-10-17 19:49:10', '2016-10-18 15:41:49');
INSERT INTO `apply` VALUES ('142', '2', '77', '186', '生产线的平衡可以保证企业的稳定有序产出，为企业带来很好的效益。确保生产线的平衡关键在于减少生产过程中的波动，使生产线能按照计划有序生产。要确保生产线平衡，必须做到人在现场，通过记录数据进行计算，发现造成波动的问题来进行改善优化。我认为我能参与其中完成该论文。', '2016-10-17 19:50:02', '28', '申请未通过，该题已有同学入选！', '2016-10-18 15:40:17', '1', '2016-10-17 19:50:02', '2016-10-18 15:40:17');
INSERT INTO `apply` VALUES ('143', '2', '72', '170', '在我国，大多数生产企业都还停留在原始的野蛮生长、盲目生产的状态，没有重视精益生产，导致企业生产成本提高，陷入收益无法提升的瓶颈。精益生产旨在实现0浪费，精简一切不必要的人员、设备、流程等，从而节约生产运作成本，达到提高企业竞争优势的目的。', '2016-10-17 20:05:43', '28', '申请未通过，该题已有同学入选！', '2016-10-18 15:41:49', '1', '2016-10-17 20:05:43', '2016-10-18 15:41:49');
INSERT INTO `apply` VALUES ('144', '1', '296', '62', '我本身对于数据挖掘技术是比较感兴趣的，同时对于各种算法以及数据结构也比较感兴趣，上学期在商务智能课程上也有做过用爬虫爬数据，然后进行情感分析的实验。所以看到这个论文题目，是比较感兴趣，想去尝试做这方面的研究。', '2016-10-17 20:16:24', '14', '同意选题，请把你的班级姓名学号QQ号以及题目发到我手机上。如你发送相关信息，我认为你确定选题，其他同学将无法选择该题目', '2016-10-17 20:35:33', '1', '2016-10-17 20:16:24', '2016-10-17 20:35:33');
INSERT INTO `apply` VALUES ('146', '1', '214', '49', '13级信管1杨媚', '2016-10-17 20:55:47', '14', '同意，请把电话，qq，短号，班级，学号，姓名，所选题目发短信我', '2016-10-17 21:01:32', '1', '2016-10-17 20:55:47', '2016-10-17 21:01:32');
INSERT INTO `apply` VALUES ('147', '2', '83', '184', '居住位置附近有一家较为大型的医院，能够方便地进行数据调研。', '2016-10-17 21:30:12', '28', '同意', '2016-10-18 15:42:55', '1', '2016-10-17 21:30:12', '2016-10-18 15:42:55');
INSERT INTO `apply` VALUES ('150', '1', '185', '71', '我希望能申请这个论文题目，因为我对web比较了解，而且以后也希望能从事web开发的工作', '2016-10-17 21:45:18', '18', '同意选题。', '2016-10-18 14:55:08', '1', '2016-10-17 21:45:18', '2016-10-18 14:55:08');
INSERT INTO `apply` VALUES ('151', '2', '83', '145', '现在的医院效率都比较低，预约、交钱等经常需要挺长的时间，在医院各个就诊室、工作室也应该得到优化，人数比较多的应该偏向楼层低些，楼层高的应该偏向需要静养的人。', '2016-10-17 21:59:44', '28', '申请未通过，该题已有同学入选！', '2016-10-18 15:42:55', '1', '2016-10-17 21:59:44', '2016-10-18 15:42:55');
INSERT INTO `apply` VALUES ('153', '2', '327', '145', '工业工程包含设施选址规划这类研究，而且智能快递柜是一种快递发展新趋势，希望能有机会研究这块', '2016-10-17 22:05:58', '19', '感谢选题，请查阅相关资料，为论文做准备。', '2016-10-18 07:26:39', '1', '2016-10-17 22:05:58', '2016-10-18 07:26:39');
INSERT INTO `apply` VALUES ('154', '2', '2', '145', '挑战自己，突破自我，希望自己在IE行业有一个更清晰的了解', '2016-10-17 22:08:21', '4', '已入选题目[我国快递企业的智能快递柜选址策略研究]，该申请无效', '2016-10-18 07:26:39', '1', '2016-10-17 22:08:21', '2016-10-18 07:26:39');
INSERT INTO `apply` VALUES ('155', '2', '89', '136', '上过熊老师的课，虽然学得一般，但是对MATLAB有比较大的兴趣，也比较钦佩熊老师教学能力，对农业机器人比较有兴趣。', '2016-10-17 22:11:41', '12', '已入选题目[人因工程在某图书馆的应用]，该申请无效', '2016-10-18 15:17:39', '1', '2016-10-17 22:11:41', '2016-10-18 15:17:39');
INSERT INTO `apply` VALUES ('156', '2', '2', '136', '作为一名工业工程的毕业生，很想知道自己专业能力的实际需求，也做过调研类的工作，也很希望能够获得陈老师的指导，所以希望能够做此论文题目。', '2016-10-17 22:13:50', '4', '已入选题目[人因工程在某图书馆的应用]，该申请无效', '2016-10-18 15:17:39', '1', '2016-10-17 22:13:50', '2016-10-18 15:17:39');
INSERT INTO `apply` VALUES ('157', '2', '92', '136', '个人很喜欢人因工程这门课，也经常泡在图书馆，对图书馆比较熟悉，希望能够对学校的图书馆或者其他图书馆进行实地调研，对图书馆的问题，做出一些改善。', '2016-10-17 22:15:46', '28', '同意', '2016-10-18 15:17:39', '1', '2016-10-17 22:15:46', '2016-10-18 15:17:39');
INSERT INTO `apply` VALUES ('158', '2', '93', '136', '首先我对人因工程这门课很喜欢，其次，作为一名学生，在大学生涯也经常逛超市，就目前学校周边的超市而言存在不少的问题，希望能够对其进行调研，然后做出改善。', '2016-10-17 22:18:01', '28', '已入选题目[人因工程在某图书馆的应用]，该申请无效', '2016-10-18 15:17:39', '1', '2016-10-17 22:18:01', '2016-10-18 15:17:39');
INSERT INTO `apply` VALUES ('159', '2', '330', '136', '对大数据比较感兴趣，个人善于资料收集和调研，对大数据有一定的了解，在今年的校数学建模大赛中，拿到三等奖。并且目前自身在一家互联网公司从事运营实习，比较需要用到数据分析，希望自己能够在毕业论文完成的过程中获得提高，希望自己能够在大数据', '2016-10-17 22:21:07', '13', '申请未通过，该题已有同学入选！', '2016-10-19 13:47:39', '1', '2016-10-17 22:21:07', '2016-10-19 13:47:39');
INSERT INTO `apply` VALUES ('163', '2', '89', '169', '自从学习了MATLAB图像处理后，我发现自己对MATLAB软件的图像处理有着浓厚的兴趣，加上上课时学习到的知识还比较扎实，希望能够通过本次毕业设计加强我对MATLAB在图像处理部分的能力，同时能够圆满的完成大学生涯的最后一个任务。谢谢老师！', '2016-10-17 23:19:34', '12', '可以', '2016-10-18 11:09:50', '1', '2016-10-17 23:19:34', '2016-10-18 11:09:50');
INSERT INTO `apply` VALUES ('164', '2', '80', '165', '于广州心怡科技物流有限公司实习，通过用slp方法优化公司布置优化', '2016-10-18 00:30:36', '28', '同意', '2016-10-18 15:23:54', '1', '2016-10-18 00:30:36', '2016-10-18 15:23:54');
INSERT INTO `apply` VALUES ('165', '2', '325', '159', '电子商务的快速发展带动了快递行业的飞速进步，但我国民营快递公司在这个瞬息万变的时代中面临着不少难题。我想深入研究我国民营快递公司发展过程中出现的问题，并针对这些问题，运用所学的知识，收集相应的数据，来做一些对策研究。相信这次研究将让我更深入地了解我国的快递行业，我也希望我的研究能够对快递行业的发展起到一定的作用。', '2016-10-18 16:52:30', '19', '这个题目比较容易上手，但是做好不容易，需要大量资料，加油', '2016-10-18 17:02:02', '1', '2016-10-18 16:52:30', '2016-10-18 17:02:02');
INSERT INTO `apply` VALUES ('166', '2', '140', '182', '当下制造业企业的竞争主要是产品和价格的竞争，所以提高企业生产效率显得尤为重要，尤为需要创新性人才，工业工程专业的学生就是为了给企业提高生产效率而培养的，我对这个论文题目很感兴趣，希望利用所学专业知识分析经济新常态背景下企业创新性人才需要', '2016-10-18 18:59:26', '15', '已入选题目[基于网络流模型的快递公司运输网络优化研究]，该申请无效', '2016-10-18 23:09:09', '1', '2016-10-18 18:59:26', '2016-10-18 23:09:09');
INSERT INTO `apply` VALUES ('167', '2', '217', '182', '我个人对物联网比较感兴趣，希望通过论文的撰写，逐渐学习物联网技术，并深入了解物联网在供应链和农业信息化中的应用', '2016-10-18 19:03:30', '14', '申请未通过，该题已有同学入选！', '2016-10-18 23:11:56', '1', '2016-10-18 19:03:31', '2016-10-18 23:11:56');
INSERT INTO `apply` VALUES ('168', '2', '188', '182', '本人对物流与供应链比较感兴趣，企业追求高效和低成本，物流在其中扮演着很重要的角色，我想通过撰写论文，研究和设计某个企业在某个地区的最佳物流路线', '2016-10-18 19:06:27', '19', '这个题目理论性和实践性都很强，有点难度，加油。', '2016-10-18 23:09:09', '1', '2016-10-18 19:06:27', '2016-10-18 23:09:09');
INSERT INTO `apply` VALUES ('169', '2', '331', '182', '本人对这个论文题目比较感兴趣，想通过论文的撰写和研究，采用数据分析和物流供应链等知识，为某个地区选择一个物流配送中心和物流供应商，实现物流的高效率', '2016-10-18 19:14:16', '13', '已入选题目[基于网络流模型的快递公司运输网络优化研究]，该申请无效', '2016-10-18 23:09:09', '1', '2016-10-18 19:14:16', '2016-10-18 23:09:09');
INSERT INTO `apply` VALUES ('170', '2', '217', '183', '研究互联网技术在农业生产设备上的应用、物联网技术在农业生产上的应用以及所带来的成效。', '2016-10-18 19:48:02', '14', '同意选题，请把你的班级，姓名，学号，电话，短号，qq和论文题目发送到我手机上，谢谢', '2016-10-18 23:11:56', '1', '2016-10-18 19:48:02', '2016-10-18 23:11:56');
INSERT INTO `apply` VALUES ('173', '2', '188', '173', '虽然目前实习工作不是物流类，但也对此方向有兴趣。\r\n另外对运筹学课程的知识掌握也比较好', '2016-10-18 21:07:22', '19', '已入选题目[支持内网连接的VPN穿透技术研究]，该申请无效', '2016-10-19 21:09:52', '1', '2016-10-18 21:07:22', '2016-10-19 21:09:52');
INSERT INTO `apply` VALUES ('175', '2', '331', '173', '虽然现在实习不是在物流公司，但对物流方向有兴趣\r\n另外也想了解大数据方面的知识', '2016-10-18 21:17:47', '13', '已入选题目[支持内网连接的VPN穿透技术研究]，该申请无效', '2016-10-19 21:09:52', '1', '2016-10-18 21:17:47', '2016-10-19 21:09:52');
INSERT INTO `apply` VALUES ('177', '1', '344', '59', '能够了解大数据在电子政务方面的应用，希望能够选到这个课题', '2016-10-18 21:25:09', '11', null, null, '1', '2016-10-18 21:25:09', '2016-10-18 21:25:09');
INSERT INTO `apply` VALUES ('180', '3', '398', '602', '学习方向为前端\r\n有编写页面的经验', '2016-10-18 23:59:19', '236', null, null, '1', '2016-10-18 23:59:19', '2016-10-18 23:59:19');
INSERT INTO `apply` VALUES ('182', '3', '313', '444', '个人对前端与后台有一定的学习基础，为了为未来的工作打下基础，希望能够通过这次毕业论文设计，对自己的前后端技术有一个深层次的历练，同时相信在未来的时间里自己能够完成这样一个网上商城的设计，希望能够得到老师的青睐，获得讲师的指导', '2016-10-19 00:03:48', '271', '已入选题目[在线投票选举系统的设计与实现]，该申请无效', '2016-10-19 14:02:41', '1', '2016-10-19 00:03:48', '2016-10-19 14:02:41');
INSERT INTO `apply` VALUES ('183', '3', '448', '394', '', '2016-10-19 00:04:48', '264', null, null, '1', '2016-10-19 00:04:48', '2016-10-19 00:04:48');
INSERT INTO `apply` VALUES ('185', '3', '787', '630', '我本人就是学习unity3d的,现在也是实习公司使用unity引擎制作手游，对unity有一定的理解，自己也制作过很多unity开源项目以及个人项目,希望能跟着老师去完成这个设计。我自己本身也已经制作了一个unity的demo，我的想法是制作一个飞机大战，有多人模式和单机模式，支持实时对战，网络同步还有单机模式下的AI是这个游戏的核心问题。', '2016-10-19 00:08:45', '230', '申请未通过，该题已有同学入选！', '2016-10-19 10:38:18', '1', '2016-10-19 00:08:45', '2016-10-19 10:38:18');
INSERT INTO `apply` VALUES ('186', '3', '627', '402', '有兴趣探讨该题目，同时也想挑战自我', '2016-10-19 00:09:49', '218', 'ok', '2016-10-19 10:26:53', '1', '2016-10-19 00:09:49', '2016-10-19 10:26:53');
INSERT INTO `apply` VALUES ('189', '3', '314', '357', '已学ssh，目前在金蝶软件做实习，有相关经验', '2016-10-19 00:16:31', '271', '请把简历发到我的电子邮箱， zhangcai0818@163.com', '2016-10-19 13:47:33', '1', '2016-10-19 00:16:31', '2016-10-19 13:47:33');
INSERT INTO `apply` VALUES ('191', '3', '237', '630', '我学习过基于规则的专家系统，A*算法，使用过给AI编写行为树的一个守卫游戏，我的研究方向是unity3d以及人工智能，我的想法是制作一个竞技游戏，游戏里面的AI能过模仿玩家的行为模式，让玩家以为自己是与玩家进行游戏。', '2016-10-19 00:21:05', '234', '申请未通过，该题已有同学入选！', '2016-10-19 15:20:17', '1', '2016-10-19 00:21:05', '2016-10-19 15:20:17');
INSERT INTO `apply` VALUES ('192', '3', '353', '638', '想要应用web知识开发一个网站，基于node，vue.js做一个单页面网站', '2016-10-19 00:23:17', '203', '已指定了哦。', '2016-10-19 20:37:42', '1', '2016-10-19 00:23:17', '2016-10-19 20:37:42');
INSERT INTO `apply` VALUES ('193', '3', '598', '630', '我是研究unity3d以及人工智能方向的，对于游戏的想法，想使用unity3d开发一款三消类游戏，类似糖果传奇的。', '2016-10-19 00:30:04', '228', '申请未通过，该题已有同学入选！', '2016-10-19 12:32:15', '1', '2016-10-19 00:30:04', '2016-10-19 12:32:15');
INSERT INTO `apply` VALUES ('199', '3', '789', '500', '正在学习前端开发，也打算以后从事这个行业，另外个人也很喜欢听音乐，在平时听的时候就对比如虾米、网易云这类在线听音乐网站产生了很深的兴趣。去年开始也在尝试着自己做一个这样的网站，如果能把它的完成作为大学期间的一个阶段性的成果，个人来说觉得是一件很有意义的事情。', '2016-10-19 01:18:07', '230', '好的', '2016-10-19 07:28:42', '1', '2016-10-19 01:18:07', '2016-10-19 07:28:42');
INSERT INTO `apply` VALUES ('200', '3', '400', '645', '我想这个系统可以作为文学创作爱学者的创作和分享的平台，该平台的模块可以分为最新、文学类、抒情类、小说、历史、爱情等，这些模块展示相关分类的作品以及其信息；已注册的用户会有“我的”模块，在这模块会有“历史作品记录”、“我要分享”、“我的编辑”功能；“历史作品记录”模块可以浏览以往分享的作品，或者修改作品，或者下架作品；“我要分享”模块可以上传新的作品或文章；“我的编辑”模块可以编辑之前未完成的作品。整个系统的功能模块划分大致如此。', '2016-10-19 01:18:57', '236', '已入选题目[小型购物APP设计与实现]，该申请无效', '2016-10-19 09:32:18', '1', '2016-10-19 01:18:57', '2016-10-19 09:32:18');
INSERT INTO `apply` VALUES ('201', '3', '310', '464', '由于我是学习web方向的，所以想找一些关于web方向的一下毕业设计，而且以前找过兼职，觉得那些兼职网太乱了，不够纯净，所以希望自己能学习的做一个兼职网站，做一个纯净的兼职网。而且感觉做这个网站，可以学习到很多的知识。', '2016-10-19 01:54:13', '271', '申请未通过，该题已有同学入选！', '2016-10-19 13:03:16', '1', '2016-10-19 01:54:13', '2016-10-19 13:03:16');
INSERT INTO `apply` VALUES ('209', '3', '411', '614', '学生宿舍管理系统是一个不错的项目，在实际生活中有着很大的用处。通过学生宿舍管理系统，可以完成对学生宿舍管理的信息化，这样便于宿管人员查看、登记相关信息。本人学习的方向也是Java EE，对Java web开发有着深厚的兴趣，自己从事的工作也是这个方向。自己之前完成了几个项目的开发。本人觉得自己很好地完成这个系统的开发。', '2016-10-19 08:09:44', '240', '基于该同学对毕业设计任务的理解和意向,同意该同学选题', '2016-10-19 08:46:37', '1', '2016-10-19 08:09:44', '2016-10-19 08:46:37');
INSERT INTO `apply` VALUES ('210', '3', '514', '510', '首先这个论题很感兴趣，下面是对这一题目的想法：\r\n1.需求分析：对系统的需求描述，数据流及数据字典描述，实体关系模型等；\r\n2.体系结构设计：系统的体系结构设计，各模块内部设计，接口设计，界面设计等；\r\n3.系统实现：各模块的具体代码实现，数据库的实现；\r\n4.系统测试。', '2016-10-19 08:12:11', '265', null, null, '1', '2016-10-19 08:12:11', '2016-10-19 08:12:11');
INSERT INTO `apply` VALUES ('211', '3', '313', '400', '学生我对网站建设很感兴趣，而且在这方面也是有一点经验，所以，希望加入张猜老师的这个选题，谢谢。', '2016-10-19 08:12:38', '271', '申请未通过，该题已有同学入选！', '2016-10-19 13:55:18', '1', '2016-10-19 08:12:38', '2016-10-19 13:55:18');
INSERT INTO `apply` VALUES ('212', '3', '413', '616', '华农淘类似于一个购物网站，用户在移动端购买商品，也可以发布商品，而管理员在web端管理网站的信息，如用户的权限，商品的信息，删除不合法的数据等。用户充当卖家和买家的角色，不过可能需要权限才能升级为卖家，且买卖行为发生在移动端。买家可以浏览商品，购买商品，添加购物车，提交订单，评论商品，卖家则可以修改商品的信息，添加商品，删除商品。\r\n我是学java开发的，由于对前端和移动端接触的少，希望能借此机会研究前端和移动端方面的开发。', '2016-10-19 08:13:42', '240', '基于与该同学对毕业设计任务的理解, 同意该同学选题', '2016-10-19 09:35:14', '1', '2016-10-19 08:13:42', '2016-10-19 09:35:14');
INSERT INTO `apply` VALUES ('214', '3', '311', '664', '有过类似的设计经验，当时数据库的设计比较稚嫩，这次希望能够再进一步。', '2016-10-19 08:16:04', '271', '申请未通过，该题已有同学入选！', '2016-10-19 12:59:32', '1', '2016-10-19 08:16:04', '2016-10-19 12:59:32');
INSERT INTO `apply` VALUES ('215', '3', '553', '665', '一个好的电子投票系统虽然在日常生活中不是经常使用，但在特定的需要进行投票的环境下，投票系统的错误设计往往对投票结果造成很大影响，在今年的《中国新歌声》总决赛最后一轮的PK下，该投票系统竟出现了81位评委投出了92票的尴尬情况，最终投票结果引起了较大争议。所以希望能够设计出一个更加安全、实用、无bug的电子投票系统。', '2016-10-19 08:18:29', '266', '可以', '2016-10-19 09:49:41', '1', '2016-10-19 08:18:29', '2016-10-19 09:49:41');
INSERT INTO `apply` VALUES ('217', '3', '400', '602', '学习方向为前端开发\r\n有编写页面的经验', '2016-10-19 08:21:39', '236', null, null, '1', '2016-10-19 08:21:39', '2016-10-19 08:21:39');
INSERT INTO `apply` VALUES ('218', '3', '399', '602', '学习方向为前端开发\r\n有编写页面的经验', '2016-10-19 08:22:05', '236', null, null, '1', '2016-10-19 08:22:05', '2016-10-19 08:22:05');
INSERT INTO `apply` VALUES ('220', '3', '589', '434', '主要用到JAVAEE方面的知识，可以分为用户前台界面，即用户借阅书籍，以及后台管理员界面，管理员对于图书的增删查改以及其他信息。主要难点在于数据库的设计，数据库查询语句的编写，查询图书信息的分页处理(带条件分页或者无条件分页)，图书的图片上传，框架的配置文件的配置书写，以及大批量数据的查询优化。', '2016-10-19 08:24:18', '279', '收到，近期会组织大家见面讨论', '2016-10-19 13:58:25', '1', '2016-10-19 08:24:18', '2016-10-19 13:58:25');
INSERT INTO `apply` VALUES ('222', '3', '556', '664', '我认为管理系统，需要有一个高效的数据库系统，而本人对数据库设计比较有心得，实习培训的时候也是负责需求分析，数据库设计的项目；其次，一个好的系统也需要一个好的UI，而本人对前端的设计也比较有兴趣，希望在这次的设计把一些以前的想法付诸于实现，并得到一定的提高。谢谢！', '2016-10-19 08:24:58', '266', '可以', '2016-10-19 09:50:03', '1', '2016-10-19 08:24:58', '2016-10-19 09:50:03');
INSERT INTO `apply` VALUES ('224', '3', '578', '580', '对预警感兴趣，也想接触大数据这一方向。为预警而生！', '2016-10-19 08:26:17', '233', 'OK！', '2016-10-19 11:29:13', '1', '2016-10-19 08:26:17', '2016-10-19 11:29:13');
INSERT INTO `apply` VALUES ('225', '3', '450', '501', '老师，我想跟您做这个项目。', '2016-10-19 08:26:46', '275', '申请未通过，该题已有同学入选！', '2016-10-19 09:49:33', '1', '2016-10-19 08:26:46', '2016-10-19 09:49:33');
INSERT INTO `apply` VALUES ('227', '3', '697', '350', '学习过一些bi。', '2016-10-19 08:28:38', '261', null, null, '1', '2016-10-19 08:28:38', '2016-10-19 08:28:38');
INSERT INTO `apply` VALUES ('228', '3', '478', '613', '本人从事前端领域开发，有html5的开发经验，很希望能在老师的带领下完成这个有趣炫酷的 html5 游戏', '2016-10-19 08:29:00', '231', '申请未通过，该题已有同学入选！', '2016-10-19 12:22:59', '1', '2016-10-19 08:29:00', '2016-10-19 15:53:29');
INSERT INTO `apply` VALUES ('229', '3', '416', '501', '老师，我想跟您做这个项目。', '2016-10-19 08:29:20', '240', '同意该同学选题', '2016-10-19 08:47:13', '1', '2016-10-19 08:29:20', '2016-10-19 08:47:13');
INSERT INTO `apply` VALUES ('230', '3', '470', '501', '老师，我想跟您做这个项目。', '2016-10-19 08:32:30', '202', '申请未通过，该题已有同学入选！', '2016-10-19 13:53:35', '1', '2016-10-19 08:32:30', '2016-10-19 13:53:35');
INSERT INTO `apply` VALUES ('231', '3', '550', '311', '对无线网络安全有浓厚兴趣，暑假尝试过相关主题实践。本人学习态度认真，学习成绩优秀，有能力胜任该题目。', '2016-10-19 08:32:50', '266', '可以', '2016-10-19 09:48:53', '1', '2016-10-19 08:32:50', '2016-10-19 09:48:53');
INSERT INTO `apply` VALUES ('232', '3', '411', '602', '学习方向为前端开发\r\n有编写html，css和js的经验', '2016-10-19 08:33:58', '240', '申请未通过，该题已有同学入选！', '2016-10-19 08:46:37', '1', '2016-10-19 08:33:58', '2016-10-19 08:46:37');
INSERT INTO `apply` VALUES ('233', '3', '311', '501', '老师，我想跟您做这个项目。', '2016-10-19 08:34:18', '271', '申请未通过，该题已有同学入选！', '2016-10-19 12:59:32', '1', '2016-10-19 08:34:18', '2016-10-19 12:59:32');
INSERT INTO `apply` VALUES ('234', '3', '313', '664', '网上商城我认为需要一个引导性强的UI，和一个高效的后台数据库管理系统，而本人希望能在前端设计这一方面得到提高，数据库设计则是我比较擅长的方面，同时也希望在这次设计中得到进一步的提升，谢谢。', '2016-10-19 08:36:34', '271', '申请未通过，该题已有同学入选！', '2016-10-19 13:55:18', '1', '2016-10-19 08:36:34', '2016-10-19 13:55:18');
INSERT INTO `apply` VALUES ('235', '3', '413', '501', '老师，我想跟您做这个项目。', '2016-10-19 08:37:09', '240', '申请未通过，该题已有同学入选！', '2016-10-19 09:35:14', '1', '2016-10-19 08:37:09', '2016-10-19 09:35:14');
INSERT INTO `apply` VALUES ('238', '3', '725', '665', '随着互联网的发展，参与到互联网的开发和实践中去将会变得越来越简单，人们可以通过网络来获取大量的学习资源，数据库的知识的运用也越来越重要，为此如能设计一个在线的建议的SQL语言学习测试系统，将会为许多的数据库初学者带来极大方便，同时开发者在开发该系统的过程中也能够加深对SQL语言理解，在日后的工作中能够提升数据库的使用技能。', '2016-10-19 08:38:20', '270', '申请未通过，该题已有同学入选！', '2016-10-19 13:16:28', '1', '2016-10-19 08:38:20', '2016-10-19 13:16:28');
INSERT INTO `apply` VALUES ('239', '3', '779', '591', '微信公账号贴近生活，但之前没有做过跟公账号相关的，想挑战一下自己。', '2016-10-19 08:38:59', '275', '同意', '2016-10-19 09:49:25', '1', '2016-10-19 08:38:59', '2016-10-19 09:49:25');
INSERT INTO `apply` VALUES ('240', '3', '586', '434', '在线购物系统，分为前台和后台，在前台主要用于用来用户根据自己的需求查询相应的商品，同时可以在上面下单，后台用于对于商品的增删查改，用户订单的处理，同时提供一些统计界面供管理员对于数据的统计。主要难点在于数据库设计(符合三大范式)，数据库查询语句优化，文件上传，分页处理，支付链接，界面的书写，框架配置文件书写，大批量数据增删查改的性能处理，多用户访问时的并发处理。', '2016-10-19 08:40:00', '279', '已入选题目[基于WEB的图书馆借阅系统的设计与实现]，该申请无效', '2016-10-19 13:58:25', '1', '2016-10-19 08:40:00', '2016-10-19 13:58:25');
INSERT INTO `apply` VALUES ('244', '3', '792', '591', '图书馆荐书系统有助于图书馆了解哪些书籍是学生人群中所喜爱的，并及时满足学生的对知识的追求，很有意义。', '2016-10-19 08:48:38', '270', '申请未通过，该题已有同学入选！', '2016-10-19 11:33:58', '1', '2016-10-19 08:48:38', '2016-10-19 11:33:58');
INSERT INTO `apply` VALUES ('248', '3', '748', '665', '在现今的互联网环境下，能够利用大数据技术对网站平台里的用户行为进行分析，能够了解到用户的喜好和习惯等，对于设计出符合大众用户的应用平台有较大参考意义。', '2016-10-19 08:55:08', '211', '申请未通过，该题已有同学入选！', '2016-10-19 16:22:04', '1', '2016-10-19 08:55:08', '2016-10-19 16:22:04');
INSERT INTO `apply` VALUES ('249', '3', '608', '648', '想要在SQL注入上面有更多了解。', '2016-10-19 08:55:31', '218', 'ok', '2016-10-19 11:06:25', '1', '2016-10-19 08:55:31', '2016-10-19 11:06:25');
INSERT INTO `apply` VALUES ('250', '3', '483', '372', '对此题目兴趣浓厚，也有一定的基础知识，能坚持不懈直到完成。', '2016-10-19 09:00:35', '231', '已入选题目[基于Android与WIFI的图像获取APP]，该申请无效', '2016-10-19 16:34:54', '1', '2016-10-19 09:00:35', '2016-10-19 16:34:54');
INSERT INTO `apply` VALUES ('252', '3', '586', '418', '曾经开发过类似的购物系统，希望能通过毕业设计再次开发一个更完善更好的购物系统', '2016-10-19 09:08:02', '279', '申请未通过，该题已有同学入选！', '2016-10-19 11:32:01', '1', '2016-10-19 09:08:02', '2016-10-19 11:32:01');
INSERT INTO `apply` VALUES ('253', '3', '592', '404', '想学习一些关于模式识别的知识，现在这方面是刚把深度学习的方法应用于人面识别，研究的空间很大，也很有挑战性。', '2016-10-19 09:09:09', '279', '收到，近期会组织大家见面讨论。', '2016-10-19 11:24:13', '1', '2016-10-19 09:09:09', '2016-10-19 11:24:13');
INSERT INTO `apply` VALUES ('255', '3', '420', '418', '对游戏开发感兴趣，开发过坦克大战游戏，希望能通过毕业设计做出一个让自己更满意的游戏，对拼图游戏的实现也很感兴趣，希望能得到此题目\r\n对于题目实现我希望用java来编写', '2016-10-19 09:10:37', '229', '已入选题目[JAVA 五子棋游戏的设计与实现]，该申请无效', '2016-10-19 10:02:46', '1', '2016-10-19 09:10:37', '2016-10-19 10:02:46');
INSERT INTO `apply` VALUES ('256', '3', '627', '650', '之前在网络工程综合实习的时候简单地接触过ospf这个路由协议，再次看到就有一种想深入理解的冲动。其实网络真的很有趣啊。', '2016-10-19 09:12:42', '218', '已入选题目[基于ＳＤＮ架构的高性能网络拥塞避免策略]，该申请无效', '2016-10-19 11:23:42', '1', '2016-10-19 09:12:42', '2016-10-19 11:23:42');
INSERT INTO `apply` VALUES ('257', '3', '240', '486', '我的专业方向是Web前端开发，也懂得一些后台开发的知识，希望能选到一个有思路做出来的网站论文题目。这个题目符合我的需求，希望老师同意。', '2016-10-19 09:13:46', '234', '申请未通过，该题已有同学入选！', '2016-10-19 14:31:44', '1', '2016-10-19 09:13:46', '2016-10-19 14:31:44');
INSERT INTO `apply` VALUES ('258', '3', '353', '486', '我的专业方向是Web前端开发，也懂得一些后台开发的知识，希望能选到一个有思路做出来的网站论文题目。这个题目符合我的需求，希望老师同意。', '2016-10-19 09:14:18', '203', '已入选题目[社交网站的设计与实现]，该申请无效', '2016-10-19 09:43:59', '1', '2016-10-19 09:14:18', '2016-10-19 09:43:59');
INSERT INTO `apply` VALUES ('259', '3', '791', '486', '我的专业方向是Web前端开发，也懂得一些后台开发的知识，希望能选到一个有思路做出来的网站论文题目。这个题目符合我的需求，希望老师同意。', '2016-10-19 09:14:45', '230', '好的', '2016-10-19 09:43:59', '1', '2016-10-19 09:14:45', '2016-10-19 09:43:59');
INSERT INTO `apply` VALUES ('260', '3', '599', '418', '对儿童教育以及游戏开发感兴趣，曾开发过坦克大战游戏，希望得到此题目可以思考一下对儿童的教育方法，并且开发出既能锻炼儿童思维又不乏味的益智游戏\r\n对于题目的实现我希望用java来编写', '2016-10-19 09:15:00', '228', '申请未通过，该题已有同学入选！', '2016-10-19 12:28:51', '1', '2016-10-19 09:15:00', '2016-10-19 12:28:51');
INSERT INTO `apply` VALUES ('261', '3', '788', '630', '使用unity引擎设计手机游戏。', '2016-10-19 09:15:15', '230', '好的', '2016-10-19 10:01:24', '1', '2016-10-19 09:15:15', '2016-10-19 10:01:24');
INSERT INTO `apply` VALUES ('262', '3', '311', '617', '张老师，你好。我是学习javaWeb的，这个毕业设计课题非常适合我。能够增加我的编程经验，以便日后找到更好的工作。', '2016-10-19 09:18:03', '271', '申请未通过，该题已有同学入选！', '2016-10-19 12:59:32', '1', '2016-10-19 09:18:03', '2016-10-19 12:59:32');
INSERT INTO `apply` VALUES ('264', '3', '787', '633', '老师您好，本人专业方向就是unity3D引擎的手游开发，也很喜欢从事这项工作，平时也开发一些小游戏，希望可以拿到这个论文题目，完成自己的梦想。', '2016-10-19 09:19:42', '230', '已入选题目[儿童益智游戏设计与实现]，该申请无效', '2016-10-19 12:28:51', '1', '2016-10-19 09:19:42', '2016-10-19 12:28:51');
INSERT INTO `apply` VALUES ('265', '3', '523', '418', '曾经开发过游戏项目，希望毕业设计也能开发游戏，对游戏开发也很感兴趣，特别是游戏算法的实现，希望能得到此题目', '2016-10-19 09:23:00', '254', '同意', '2016-10-19 10:02:46', '1', '2016-10-19 09:23:00', '2016-10-19 10:02:46');
INSERT INTO `apply` VALUES ('270', '3', '312', '318', '具有一定的Android开发经验。个人财务管理系统主要是财务管理，包括收入，支出，投资的记录及对应记录的统计。', '2016-10-19 09:31:19', '271', '同意', '2016-10-19 13:10:00', '1', '2016-10-19 09:31:19', '2016-10-19 13:10:00');
INSERT INTO `apply` VALUES ('271', '3', '554', '431', '个人对农村电商方面比较感兴趣，想深入了解学习', '2016-10-19 09:31:21', '266', '申请未通过，该题已有同学入选！', '2016-10-19 21:26:15', '1', '2016-10-19 09:31:21', '2016-10-19 21:26:15');
INSERT INTO `apply` VALUES ('277', '3', '450', '624', '本人想从事java开发', '2016-10-19 09:38:52', '275', '同意', '2016-10-19 09:49:33', '1', '2016-10-19 09:38:52', '2016-10-19 09:49:33');
INSERT INTO `apply` VALUES ('278', '3', '786', '435', '自己玩过相当程度的RPG游戏，对剧情的设计有足够信心。虽然对Cocos2d-x的理解为空白，但是有绝对充足的热情来完成课题，能够自觉地推进课题的进度，尽最大努力完成任务。希望老师能够给予指导。', '2016-10-19 09:39:15', '230', '好的', '2016-10-19 10:00:54', '1', '2016-10-19 09:39:15', '2016-10-19 10:00:54');
INSERT INTO `apply` VALUES ('284', '3', '479', '385', '对android开发感兴趣。关于老师列出的功能：\r\n记录待办事项，查询待办日程；\r\n提供闹铃提醒；\r\n标记已办日程，删除已办日程；\r\n所有待办事项日视图、周视图、月视图；（以日历形式显示各种视图）\r\n还可以尝试添加桌面小工具以及消息提醒等功能使应用的提醒功能更加完美', '2016-10-19 09:48:29', '231', '同意', '2016-10-19 12:20:40', '1', '2016-10-19 09:48:29', '2016-10-19 12:20:40');
INSERT INTO `apply` VALUES ('285', '3', '310', '422', '对web项目有兴趣，能使用一些框架。疑问：前端的页面怎么办，我只会用表而已，页面很难做到美观啊？', '2016-10-19 09:48:44', '271', '已入选题目[基于WEB的设备管理系统的设计与实现]，该申请无效', '2016-10-19 14:07:38', '1', '2016-10-19 09:48:44', '2016-10-19 14:07:38');
INSERT INTO `apply` VALUES ('286', '3', '313', '587', '目前方向为电商\r\n感觉题目做深了还是有很多需要考虑的东西', '2016-10-19 09:51:02', '271', '申请未通过，该题已有同学入选！', '2016-10-19 13:55:18', '1', '2016-10-19 09:51:02', '2016-10-19 13:55:18');
INSERT INTO `apply` VALUES ('288', '3', '531', '355', '感觉比较有兴趣 所以想选', '2016-10-19 09:52:28', '254', '同意', '2016-10-19 10:02:32', '1', '2016-10-19 09:52:28', '2016-10-19 10:02:32');
INSERT INTO `apply` VALUES ('290', '3', '313', '299', '老师，本人对网上商城的设计特别特别感兴趣，想做一个类似淘宝类的商城，所以想申请一下这个题目。', '2016-10-19 09:53:07', '271', '申请未通过，该题已有同学入选！', '2016-10-19 13:55:18', '1', '2016-10-19 09:53:07', '2016-10-19 13:55:18');
INSERT INTO `apply` VALUES ('291', '3', '271', '315', '在记账系统上实现账户添加，收入记录，消费记录，转账以及对每个月的消费预算等功能。', '2016-10-19 09:53:15', '237', '已入选题目[高校院系校友录ＡPP开发]，该申请无效', '2016-10-19 13:52:37', '1', '2016-10-19 09:53:15', '2016-10-19 13:52:37');
INSERT INTO `apply` VALUES ('292', '3', '627', '355', '感觉比较有兴趣 所以想申请下', '2016-10-19 09:54:03', '218', '申请未通过，该题已有同学入选！', '2016-10-19 10:26:53', '1', '2016-10-19 09:54:03', '2016-10-19 10:26:53');
INSERT INTO `apply` VALUES ('293', '3', '524', '422', '对web的开发感兴趣，决定走这个方向。会使用框架技术。\r\n懂得jsp，struts等技术。', '2016-10-19 09:54:26', '215', '已入选题目[基于WEB的设备管理系统的设计与实现]，该申请无效', '2016-10-19 14:07:38', '1', '2016-10-19 09:54:26', '2016-10-19 14:07:38');
INSERT INTO `apply` VALUES ('294', '3', '457', '283', '学习过大数据相关知识，希望在实际应用中尝试', '2016-10-19 09:55:29', '220', 'OK', '2016-10-19 13:06:32', '1', '2016-10-19 09:55:29', '2016-10-19 13:06:32');
INSERT INTO `apply` VALUES ('295', '3', '725', '486', '我的专业方向是Web前端开发，也懂得一些后台开发的知识，希望能选到一个有思路做出来的网站论文题目。这个题目符合我的需求，希望老师同意。', '2016-10-19 09:56:53', '270', '申请未通过，该题已有同学入选！', '2016-10-19 13:16:28', '1', '2016-10-19 09:56:53', '2016-10-19 13:16:28');
INSERT INTO `apply` VALUES ('296', '3', '589', '422', '对web项目感兴趣，对数据库的分析设计略有了解。会一些框架技术。前端的页面由自己设计很丑怎么办。', '2016-10-19 09:57:22', '279', '已入选题目[基于WEB的设备管理系统的设计与实现]，该申请无效', '2016-10-19 14:07:38', '1', '2016-10-19 09:57:22', '2016-10-19 14:07:38');
INSERT INTO `apply` VALUES ('297', '3', '313', '298', '在实习期间做过电商后台管理系统自己网站后台系统，对于流程设计比较熟悉，也比较适合我', '2016-10-19 09:57:53', '271', '申请未通过，该题已有同学入选！', '2016-10-19 13:55:18', '1', '2016-10-19 09:57:53', '2016-10-19 13:55:18');
INSERT INTO `apply` VALUES ('299', '3', '311', '486', '我的专业方向是Web前端开发，也懂得一些后台开发的知识，希望能选到一个有思路做出来的网站论文题目。这个题目符合我的需求，希望老师同意。', '2016-10-19 09:58:28', '271', '申请未通过，该题已有同学入选！', '2016-10-19 12:59:32', '1', '2016-10-19 09:58:28', '2016-10-19 12:59:32');
INSERT INTO `apply` VALUES ('300', '3', '522', '617', '马老师，你好。我是学习javaWeb的，这个毕业设计课题非常适合我。能够增加我的编程经验，以便日后找到更好的工作。', '2016-10-19 09:59:35', '254', '同意', '2016-10-19 10:02:08', '1', '2016-10-19 09:59:35', '2016-10-19 10:02:08');
INSERT INTO `apply` VALUES ('301', '3', '314', '422', '对web项目感兴趣，有框架基础，懂得jsp等技术，我觉得自己应该可以完成这个项目，不过前端的设计是个问题。', '2016-10-19 09:59:38', '271', '已入选题目[基于WEB的设备管理系统的设计与实现]，该申请无效', '2016-10-19 14:07:38', '1', '2016-10-19 09:59:38', '2016-10-19 14:07:38');
INSERT INTO `apply` VALUES ('303', '3', '313', '354', '之前做过类似的项目，想进一步学习和实践。', '2016-10-19 10:00:18', '271', '申请未通过，该题已有同学入选！', '2016-10-19 13:55:18', '1', '2016-10-19 10:00:18', '2016-10-19 13:55:18');
INSERT INTO `apply` VALUES ('304', '3', '495', '617', '涂老师，你好。我是学习javaWeb的，这个毕业设计课题非常适合我。能够增加我的编程经验，以便日后找到更好的工作。', '2016-10-19 10:00:37', '238', '申请未通过，该题已有同学入选！', '2016-10-19 10:22:40', '1', '2016-10-19 10:00:37', '2016-10-19 10:22:40');
INSERT INTO `apply` VALUES ('305', '3', '400', '284', '喜欢前端 想基于前端开发一个应用 而且本人希望在前端继续发展 所以希望能申请到该项目的主权', '2016-10-19 10:01:46', '236', null, null, '1', '2016-10-19 10:01:46', '2016-10-19 10:01:46');
INSERT INTO `apply` VALUES ('306', '3', '466', '422', '对web项目感兴趣，有框架基础，会jsp等技术，我觉得自己可以完成这个项目，对前端的页面不自信，可能会做得很丑', '2016-10-19 10:01:57', '202', '同意', '2016-10-19 14:07:38', '1', '2016-10-19 10:01:57', '2016-10-19 14:07:38');
INSERT INTO `apply` VALUES ('309', '3', '774', '625', '感兴趣', '2016-10-19 10:02:26', '275', '同意', '2016-10-19 14:29:25', '1', '2016-10-19 10:02:26', '2016-10-19 14:29:25');
INSERT INTO `apply` VALUES ('310', '2', '145', '170', '我在大二和大三期间分别选修了通信计算机网络和企业组网技术，对于计算机组网方面有一定的基础知识，愿意去挑战这个题目。', '2016-10-19 10:02:41', '15', '申请未通过，该题已有同学入选！', '2016-10-19 21:09:52', '1', '2016-10-19 10:02:41', '2016-10-19 21:09:52');
INSERT INTO `apply` VALUES ('312', '3', '495', '424', '主要分两个部分\r\n1.酒店方面，有以下功能\r\n①登陆注册\r\n②填写或修改主要信息\r\n③查看用户的订房信息并处理\r\n...\r\n2.用户方面，有以下功能\r\n①登陆注册\r\n②查看附近酒店信息\r\n③提交订房信息\r\n...\r\n剩下的等开始做再详细补充', '2016-10-19 10:04:02', '238', '同意', '2016-10-19 10:22:40', '1', '2016-10-19 10:04:02', '2016-10-19 10:22:40');
INSERT INTO `apply` VALUES ('314', '3', '271', '585', '学习过Android', '2016-10-19 10:05:02', '237', '已入选题目[校园二手物品交易平台的设计与开发]，该申请无效', '2016-10-19 11:30:39', '1', '2016-10-19 10:05:02', '2016-10-19 11:30:39');
INSERT INTO `apply` VALUES ('316', '3', '518', '397', '药品销售系统需要设计一个数据库，用来存放药品的余量。同时需要在前台有设计可以让客户进行预约、管理员进行审核后购买，同时要有药品记录员进行药品登记。前台页面的每个事物完成后都会对数据库进行更行。主要功能罗列如下：药品登记、药品预约、药品登记、药品审核、药品统计、管理员登记、管理管理审核等功能。', '2016-10-19 10:06:11', '254', '同意', '2016-10-19 10:09:17', '1', '2016-10-19 10:06:11', '2016-10-19 10:09:17');
INSERT INTO `apply` VALUES ('317', '3', '783', '593', '感兴趣', '2016-10-19 10:06:26', '275', '同意', '2016-10-19 14:28:04', '1', '2016-10-19 10:06:26', '2016-10-19 14:28:04');
INSERT INTO `apply` VALUES ('318', '3', '267', '299', '老师，我是学习Java web开发的，所以对这个系统很感兴趣。', '2016-10-19 10:06:39', '237', '申请未通过，该题已有同学入选！', '2016-10-19 12:31:09', '1', '2016-10-19 10:06:39', '2016-10-19 12:31:09');
INSERT INTO `apply` VALUES ('320', '3', '529', '427', '我之前玩过一段时间的拼图游戏，对于这个很有兴趣', '2016-10-19 10:07:46', '215', '同意', '2016-10-19 10:42:54', '1', '2016-10-19 10:07:46', '2016-10-19 10:42:54');
INSERT INTO `apply` VALUES ('321', '3', '797', '632', '有多个Android应用开发的经验，可以独立完成。', '2016-10-19 10:07:59', '265', 'ok', '2016-10-19 14:40:06', '1', '2016-10-19 10:07:59', '2016-10-19 14:40:06');
INSERT INTO `apply` VALUES ('323', '3', '310', '424', '题目写得太详细了，在功能方面也暂时想不到有什么补充的，因为我主学java，所以应该用ssh框架完成，之前也有过类似项目的经验', '2016-10-19 10:08:54', '271', '申请未通过，该题已有同学入选！', '2016-10-19 13:03:16', '1', '2016-10-19 10:08:54', '2016-10-19 13:03:16');
INSERT INTO `apply` VALUES ('324', '3', '267', '307', '锻炼自己开发软件系统的能力', '2016-10-19 10:09:03', '237', '申请未通过，该题已有同学入选！', '2016-10-19 12:31:09', '1', '2016-10-19 10:09:03', '2016-10-19 12:31:09');
INSERT INTO `apply` VALUES ('325', '3', '543', '644', '感兴趣', '2016-10-19 10:09:41', '230', '好的', '2016-10-19 10:55:48', '1', '2016-10-19 10:09:41', '2016-10-19 10:55:48');
INSERT INTO `apply` VALUES ('328', '3', '787', '424', '因为我是桌游社的，也是炉石传说玩家，炉石传说使用u3d做的，所以我也想把某一种桌游做成一个游戏', '2016-10-19 10:12:02', '230', '申请未通过，该题已有同学入选！', '2016-10-19 10:38:18', '1', '2016-10-19 10:12:02', '2016-10-19 10:38:18');
INSERT INTO `apply` VALUES ('330', '3', '792', '583', '做一个基于web的图书馆荐书系统的设计与开发，使用ssm框架实现', '2016-10-19 10:12:48', '270', '申请未通过，该题已有同学入选！', '2016-10-19 11:33:58', '1', '2016-10-19 10:12:48', '2016-10-19 11:33:58');
INSERT INTO `apply` VALUES ('331', '3', '534', '299', '老师，本人有学习JAVA WEB开发的相关知识，对这个题目很感兴趣，关于这个题目想用Java开发，还望老师同意。', '2016-10-19 10:13:27', '215', '同意。\r\n加我的QQ', '2016-10-19 10:48:53', '1', '2016-10-19 10:13:27', '2016-10-19 10:48:53');
INSERT INTO `apply` VALUES ('332', '3', '742', '576', '解题思路：1、用户登录与注册模块：分为管理员和用户，注册然后登录系统，然后进入系统页面。2、用户可以编辑并发布房屋信息，包括房屋简介，价格，并且系统允许上传图片和文本信息编辑。3、用户可以通过房屋类型，价格，或者其他信息进行搜索，同时应该支持模糊搜索，交易中的房屋应当将数据库对应的房屋状态置为交易中状态，并在主页面中显示其对应状态。4、交易系统为线下交易，完成之后应当当状态置为已完成状态，并在数据库中置为已出租状态，首页不显示，当房屋到期或者交易终止，用户可以将房屋再次出现在系统中进行交易。5、熟悉java EE。', '2016-10-19 10:13:48', '211', null, null, '1', '2016-10-19 10:13:48', '2017-07-31 22:42:33');
INSERT INTO `apply` VALUES ('334', '3', '271', '592', '感兴趣', '2016-10-19 10:14:12', '237', '已入选题目[基于Android平台的个人绩效APP应用设计]，该申请无效', '2016-10-19 13:17:16', '1', '2016-10-19 10:14:12', '2016-10-19 13:17:16');
INSERT INTO `apply` VALUES ('335', '3', '398', '284', '喜欢前端 希望能利用HTML5和CSS3开发一个应用平台', '2016-10-19 10:14:56', '236', null, null, '1', '2016-10-19 10:14:56', '2016-10-19 10:14:56');
INSERT INTO `apply` VALUES ('337', '3', '826', '583', '基于web技术实现酒店在线点菜系统的设计与开发，该项目可以用ssm框架实现，角色分为管理员和顾客，要实现权限的管理等等', '2016-10-19 10:15:09', '270', '同意申请', '2016-10-19 11:26:43', '1', '2016-10-19 10:15:09', '2016-10-19 11:26:43');
INSERT INTO `apply` VALUES ('339', '3', '744', '304', '老师，我对您的这个题目挺感兴趣的，由于本人打算往前端的方向发展，您的这个题目也正好与前端相关，而且刚刚打电话联系您时也了解了一点题目的相关要求，但是由于不清楚要选‘通用WEB调查表的自动生成’这个题目好，还是选‘通用个人网站生成系统’好，所以也想要申请这个题目', '2016-10-19 10:15:28', '211', null, null, '1', '2016-10-19 10:15:28', '2016-10-19 10:15:28');
INSERT INTO `apply` VALUES ('341', '3', '698', '592', '感兴趣', '2016-10-19 10:15:53', '207', '同意', '2016-10-19 13:17:16', '1', '2016-10-19 10:15:53', '2016-10-19 13:17:16');
INSERT INTO `apply` VALUES ('342', '3', '599', '633', '老师您好，我的专业方向是安卓手机游戏开发，平时也开发一些小游戏，个人是非常喜欢这个论文题目，也非常想做这个题目，希望老师成全，谢谢。', '2016-10-19 10:16:21', '228', '好的', '2016-10-19 12:28:51', '1', '2016-10-19 10:16:21', '2016-10-19 12:28:51');
INSERT INTO `apply` VALUES ('343', '3', '40', '567', '想了解搜索引擎的实现原理，自己本身在实习期间也接触过lucene', '2016-10-19 10:17:01', '278', 'Approve', '2016-10-19 11:08:11', '1', '2016-10-19 10:17:01', '2016-10-19 11:08:11');
INSERT INTO `apply` VALUES ('344', '3', '614', '307', '增强自己对网络安全的了解', '2016-10-19 10:17:18', '218', 'ok', '2016-10-19 10:30:03', '1', '2016-10-19 10:17:18', '2016-10-19 10:30:03');
INSERT INTO `apply` VALUES ('345', '3', '559', '431', '个人对农村、电商方面比较感兴趣，希望进一步了解学习', '2016-10-19 10:17:29', '255', '已入选题目[农技通应用APP设计]，该申请无效', '2016-10-19 13:16:56', '1', '2016-10-19 10:17:29', '2016-10-19 13:16:56');
INSERT INTO `apply` VALUES ('346', '3', '272', '642', '老师你好，我是2013级网络工程2班的郑钦洪，从大一下学期开始学iOS 开发方向并且在校内做项目到现在有4、5个独立开发的应用。自己熟悉APP的开发流程，并且对题目很感兴趣，希望能成功选题', '2016-10-19 10:17:36', '237', 'ok', '2016-10-19 12:33:24', '1', '2016-10-19 10:17:36', '2016-10-19 12:33:24');
INSERT INTO `apply` VALUES ('347', '3', '312', '592', '感兴趣', '2016-10-19 10:17:50', '271', '已入选题目[基于Android平台的个人绩效APP应用设计]，该申请无效', '2016-10-19 13:17:16', '1', '2016-10-19 10:17:50', '2016-10-19 13:17:16');
INSERT INTO `apply` VALUES ('348', '3', '272', '592', '感兴趣', '2016-10-19 10:18:46', '237', '已入选题目[基于Android平台的个人绩效APP应用设计]，该申请无效', '2016-10-19 13:17:16', '1', '2016-10-19 10:18:46', '2016-10-19 13:17:16');
INSERT INTO `apply` VALUES ('352', '3', '291', '668', '本人从事Android开发，设想毕设可以开发雷电飞机游戏，游戏背景图可以使用Matrix类进行操作，由下至上进行平移，制造飞机向上飞行的视觉感，飞机，炮弹模型使用PS软件自己制作或者提取现有素材，爆炸动画可以使用Frame动画制作，深入制作还可以考虑使用网络框架来实现联网功能。', '2016-10-19 10:20:52', '237', '好的，已分配题目给你', '2016-10-19 10:51:39', '1', '2016-10-19 10:20:52', '2016-10-19 10:51:39');
INSERT INTO `apply` VALUES ('353', '3', '750', '298', '我的就业方向是前端开发，在实习期间 做过2个后台管理系统，对流程比较熟悉，该题目比较适合我。这个题目应该改就是有后台管理系统，也就是网站作者登陆，录入网站内容，也可以进行删除修改操作，可以看到留言   在前台需要一个模板来渲染网站的内容，还可以提供留言的功能', '2016-10-19 10:20:53', '211', '已入选题目[企业员工考勤管理系统]，该申请无效', '2016-10-19 11:09:08', '1', '2016-10-19 10:20:53', '2016-10-19 11:14:40');
INSERT INTO `apply` VALUES ('354', '3', '311', '577', '因为自己比较喜欢看书，所以想着可以选择做这样一个图书管理系统，而且对oracle数据库与java较熟悉', '2016-10-19 10:21:06', '271', '申请未通过，该题已有同学入选！', '2016-10-19 12:59:32', '1', '2016-10-19 10:21:06', '2016-10-19 12:59:32');
INSERT INTO `apply` VALUES ('356', '3', '43', '592', '感兴趣', '2016-10-19 10:22:57', '252', '已入选题目[基于Android平台的个人绩效APP应用设计]，该申请无效', '2016-10-19 13:17:16', '1', '2016-10-19 10:22:57', '2016-10-19 13:17:16');
INSERT INTO `apply` VALUES ('360', '3', '313', '284', '感兴趣', '2016-10-19 10:24:48', '271', '申请未通过，该题已有同学入选！', '2016-10-19 13:55:18', '1', '2016-10-19 10:24:48', '2016-10-19 13:55:18');
INSERT INTO `apply` VALUES ('361', '3', '237', '569', '对游戏的热爱及想研究AI的热情。', '2016-10-19 10:24:53', '234', '申请未通过，该题已有同学入选！', '2016-10-19 15:20:17', '1', '2016-10-19 10:24:53', '2016-10-19 15:20:17');
INSERT INTO `apply` VALUES ('362', '3', '535', '306', '我对这个很感兴趣，希望能进一步增强自己的web开发能力', '2016-10-19 10:24:55', '215', '同意', '2016-10-19 10:43:09', '1', '2016-10-19 10:24:55', '2016-10-19 10:43:09');
INSERT INTO `apply` VALUES ('364', '3', '309', '284', '感兴趣', '2016-10-19 10:25:15', '271', null, null, '1', '2016-10-19 10:25:15', '2016-10-19 10:25:15');
INSERT INTO `apply` VALUES ('365', '3', '271', '282', '暑假实习时做过类似的课题', '2016-10-19 10:26:00', '237', null, null, '1', '2016-10-19 10:26:00', '2016-10-19 10:26:00');
INSERT INTO `apply` VALUES ('366', '3', '399', '495', '自己学习的方向正好是html5和css3等前端技能。很希望能继续通过毕业设计进行深造。恳请老师做我毕业论文的导师。', '2016-10-19 10:26:01', '236', '已入选题目[基于HTML5技术的网页游戏框架的实现]，该申请无效', '2016-10-19 12:25:55', '1', '2016-10-19 10:26:01', '2016-10-19 12:25:55');
INSERT INTO `apply` VALUES ('367', '3', '787', '647', '13网络工程3 201330350305 郭嘉豪', '2016-10-19 10:26:07', '230', '好的n', '2016-10-19 10:38:18', '1', '2016-10-19 10:26:07', '2016-10-19 10:38:18');
INSERT INTO `apply` VALUES ('370', '3', '398', '495', '自己学习的方向正好是html5和css3等前端技能。之前在学院的工作室也参与了一些手机端商城系统的开发 ，很希望能继续通过毕业设计进行深造。恳请老师做我毕业论文的导师。', '2016-10-19 10:27:20', '236', '已入选题目[基于HTML5技术的网页游戏框架的实现]，该申请无效', '2016-10-19 12:25:55', '1', '2016-10-19 10:27:20', '2016-10-19 12:25:55');
INSERT INTO `apply` VALUES ('372', '3', '697', '584', '喜欢学习大数据，了解数据仓库', '2016-10-19 10:28:08', '261', '已入选题目[仓库管理系统的设计与实现]，该申请无效', '2016-10-19 11:59:27', '1', '2016-10-19 10:28:08', '2016-10-19 11:59:27');
INSERT INTO `apply` VALUES ('373', '3', '756', '431', '本人对农业方面比较感兴趣，学过安卓开发', '2016-10-19 10:28:34', '207', '同意', '2016-10-19 13:16:56', '1', '2016-10-19 10:28:34', '2016-10-19 13:16:56');
INSERT INTO `apply` VALUES ('374', '3', '485', '495', '自己从业的方向正好是html5和css3等前端技能。加上之前在学院的工作室参与了一些基于html5项目的开发，很希望能继续通过毕业设计进行深造。恳请老师做我毕业论文的导师。', '2016-10-19 10:29:30', '231', '同意', '2016-10-19 12:25:55', '1', '2016-10-19 10:29:30', '2016-10-19 12:25:55');
INSERT INTO `apply` VALUES ('375', '3', '524', '586', '1、用户登录：有2种角色，普通用户和管理员，不用用户角色登录有不同的页面，不同的权限。\r\n2、调查问卷的填写：用户必须登录后才能填写调查问卷，并且调查问卷与用户应该有一个状态，当用户填写完成，该状态置为已填写。\r\n3、问卷管理：问卷应当是以表单方式提交，在页面上可以有创建单选题、多选题等方便调查问卷设计的按钮，然后用js实现点击添加这些表单\r\n\r\n项内容，还有可以用ueditor富文本编辑器实现自定义文本。\r\n4、问卷处理：可以用quartz组件实现在调查问卷结束的时候自动将调查问卷提交，然后用fusioncharts组件对提交的表单数据进行统计并做成\r\n\r\n表格。', '2016-10-19 10:29:38', '215', '同意', '2016-10-19 10:45:00', '1', '2016-10-19 10:29:38', '2016-10-19 10:45:00');
INSERT INTO `apply` VALUES ('376', '3', '46', '307', '自己对推荐系统比较感兴趣，希望可以进一步地了解', '2016-10-19 10:30:37', '278', '申请未通过，该题已有同学入选！', '2016-10-19 12:43:36', '1', '2016-10-19 10:30:37', '2016-10-19 12:43:36');
INSERT INTO `apply` VALUES ('377', '3', '530', '428', '对这种管理系统比较有兴趣，其中比较喜欢服装类的销售系统。', '2016-10-19 10:30:47', '215', '同意', '2016-10-19 10:42:34', '1', '2016-10-19 10:30:47', '2016-10-19 10:42:34');
INSERT INTO `apply` VALUES ('380', '3', '589', '299', '老师，我对这个项目很感兴趣，想用Java去实现。', '2016-10-19 10:32:08', '279', '申请未通过，该题已有同学入选！\r\n可以选择《论文投稿系统》', '2016-10-19 14:00:45', '1', '2016-10-19 10:32:08', '2016-10-19 14:00:45');
INSERT INTO `apply` VALUES ('381', '3', '367', '571', '对深度学习有较大兴趣', '2016-10-19 10:32:49', '241', '已入选题目[定时提醒桌面小工具的设计与开发]，该申请无效\r\n你已经选了其他题目了？？', '2016-10-19 14:16:08', '1', '2016-10-19 10:32:49', '2016-10-19 14:16:08');
INSERT INTO `apply` VALUES ('383', '3', '629', '631', '对网络路由相关技术比较感兴趣，想深入研究', '2016-10-19 10:34:13', '218', '已入选题目[基于SNMP的服务器监控系统]，该申请无效', '2016-10-19 20:16:40', '1', '2016-10-19 10:34:13', '2016-10-19 20:16:40');
INSERT INTO `apply` VALUES ('384', '3', '271', '490', '本人对android应用开发有较浓厚兴趣，希望能开发一个可以应用到实际而且比较实用的android应用。而且我发现自己平时并没有太关注自己的收入与支出，如果能实现一个记账的管理系统，相信对自己管理财务会有较大的帮助。而且还能够分享给别人一起使用。', '2016-10-19 10:34:25', '237', null, null, '1', '2016-10-19 10:34:25', '2016-10-19 10:34:25');
INSERT INTO `apply` VALUES ('385', '3', '742', '299', '老师，本人对这个项目很感兴趣，后台想用Java去实现。', '2016-10-19 10:35:57', '211', '已入选题目[医院病房管理系统的设计与实现]，该申请无效', '2016-10-19 10:48:53', '1', '2016-10-19 10:35:57', '2016-10-19 10:48:53');
INSERT INTO `apply` VALUES ('386', '3', '608', '410', '本人对Web安全很感兴趣，希望能够深入研究学习，同时自己也打算从事web相关的工作，希望老师能够指导我的学习研究。', '2016-10-19 10:36:32', '218', '已入选题目[无线校园网络的ARP 欺骗防范]，该申请无效', '2016-10-19 11:07:29', '1', '2016-10-19 10:36:32', '2016-10-19 11:07:29');
INSERT INTO `apply` VALUES ('387', '3', '769', '584', '对大数据感兴趣，了解数据仓库。', '2016-10-19 10:36:46', '261', '已入选题目[仓库管理系统的设计与实现]，该申请无效', '2016-10-19 11:59:27', '1', '2016-10-19 10:36:46', '2016-10-19 11:59:27');
INSERT INTO `apply` VALUES ('388', '3', '478', '451', '尊敬的老师：\r\n    您好！我是计算机科学与技术6班的学生，我叫赖远新。我在大三下学期开始学习了HTML5的一些基础知识，对于用HTML5来开发一个跑酷游戏感到很感兴趣。初步想法是可以用HTML5 Canvas 来开发动画效果，使用HTML5 Audio 来实现控制声音。希望可以得到老师的指导，申请这个选题为自己的毕业设计。', '2016-10-19 10:36:49', '231', '同意', '2016-10-19 12:22:59', '1', '2016-10-19 10:36:49', '2016-10-19 12:22:59');
INSERT INTO `apply` VALUES ('389', '3', '310', '473', '具备做基于web的项目的经验；并且对于此项目还有一些个人想法，希望与老师交流；', '2016-10-19 10:37:15', '271', '申请未通过，该题已有同学入选！', '2016-10-19 13:03:16', '1', '2016-10-19 10:37:15', '2016-10-19 13:03:16');
INSERT INTO `apply` VALUES ('390', '3', '521', '396', '对这个题目比较感兴趣，而且也锻炼自己java web的编程能力。', '2016-10-19 10:38:31', '254', '同意', '2016-10-19 10:42:55', '1', '2016-10-19 10:38:31', '2016-10-19 10:42:55');
INSERT INTO `apply` VALUES ('391', '3', '311', '583', '基于web的图书管理系统的实现，可以使用ssm框架进行设计，具有良好的界面，主要实现对管理员和读者的增删查改功能，并且对管理员与读者进行权限的管理', '2016-10-19 10:39:06', '271', '申请未通过，该题已有同学入选！', '2016-10-19 12:59:32', '1', '2016-10-19 10:39:06', '2016-10-19 12:59:32');
INSERT INTO `apply` VALUES ('393', '3', '525', '398', '对该题目较为感兴趣', '2016-10-19 10:39:41', '254', '同意', '2016-10-19 10:42:42', '1', '2016-10-19 10:39:41', '2016-10-19 10:42:42');
INSERT INTO `apply` VALUES ('394', '3', '404', '569', '研究游戏底层渲染技术，使用opengl或其它图形库实现一个自己的简单游戏引擎。', '2016-10-19 10:39:58', '229', '申请未通过，该题已有同学入选！', '2016-10-19 14:07:45', '1', '2016-10-19 10:39:58', '2016-10-19 14:07:45');
INSERT INTO `apply` VALUES ('396', '3', '53', '612', '熟悉java开发，有web开发经历，有开源项目学习经历，大致了解过抓取网页信息的原理，希望能够通过真正的去实现爬虫软件', '2016-10-19 10:40:30', '278', 'Approve', '2016-10-19 11:07:27', '1', '2016-10-19 10:40:30', '2016-10-19 11:07:27');
INSERT INTO `apply` VALUES ('401', '3', '792', '577', '因为 我比较喜欢看书，所以该题目对来我来说实用性很大', '2016-10-19 10:42:40', '270', '申请未通过，该题已有同学入选！', '2016-10-19 11:33:58', '1', '2016-10-19 10:42:40', '2016-10-19 11:33:58');
INSERT INTO `apply` VALUES ('402', '3', '629', '626', '本人想从事网络相关的工作，对OSI7层比较熟悉，希望老师给我一个机会', '2016-10-19 10:42:43', '218', '申请未通过，该题已有同学入选！', '2016-10-19 12:24:53', '1', '2016-10-19 10:42:43', '2016-10-19 12:24:53');
INSERT INTO `apply` VALUES ('403', '3', '792', '572', '页面显示投票最高的若干图书，想体验一下这种做排行榜的感觉。\r\n目前的职业方向是Java Web，能根据三层架构开发模式，使用Java的SSH框架搭建一个基本的CRUD项目。', '2016-10-19 10:42:47', '270', '同意申请', '2016-10-19 11:33:58', '1', '2016-10-19 10:42:47', '2016-10-19 11:33:58');
INSERT INTO `apply` VALUES ('405', '3', '313', '451', '尊敬的老师：\r\n    您好！我是计算机科学与技术6班的学生，我叫赖远新。我在大三期间的数据库课程设计做的就是一个网络商城的题目。当时是三人一个小组共同完成的，现在想尝试自己一个人来完成。希望可以得到老师的指导，申请这个选题为自己的毕业设计。', '2016-10-19 10:44:40', '271', '申请未通过，该题已有同学入选！', '2016-10-19 13:55:18', '1', '2016-10-19 10:44:40', '2016-10-19 13:55:18');
INSERT INTO `apply` VALUES ('406', '3', '309', '493', '1、本人从事过数据管理类实习，对这方面比较有兴趣\r\n2、本人对管理系统的开发比较感兴趣', '2016-10-19 10:44:56', '271', null, null, '1', '2016-10-19 10:44:56', '2016-10-19 10:44:56');
INSERT INTO `apply` VALUES ('408', '3', '267', '480', '学过本题目应用到的技术', '2016-10-19 10:45:08', '237', 'ok', '2016-10-19 12:31:09', '1', '2016-10-19 10:45:08', '2016-10-19 12:31:09');
INSERT INTO `apply` VALUES ('409', '3', '544', '464', '很多人都喜欢使用微信，微信成了生活的不可缺少的一部分。所以有必要的去了解微信的开发', '2016-10-19 10:46:01', '230', '好的', '2016-10-19 10:56:35', '1', '2016-10-19 10:46:01', '2016-10-19 10:56:35');
INSERT INTO `apply` VALUES ('412', '3', '311', '585', 'Java语言开发', '2016-10-19 10:48:05', '271', '申请未通过，该题已有同学入选！', '2016-10-19 12:59:32', '1', '2016-10-19 10:48:05', '2016-10-19 12:59:32');
INSERT INTO `apply` VALUES ('413', '3', '290', '419', '想学习U3D做一款跑酷或者塔防游戏', '2016-10-19 10:49:02', '237', null, null, '1', '2016-10-19 10:49:02', '2016-10-19 10:49:02');
INSERT INTO `apply` VALUES ('417', '3', '494', '481', '本人对于医疗健康比较感兴趣。\r\n\r\n有过B/S结构的网站开发经验\r\n\r\n在数据库课程设计中曾承担过ER图和关系模式图的设计。', '2016-10-19 10:50:26', '238', '同意', '2016-10-19 11:07:39', '1', '2016-10-19 10:50:26', '2016-10-19 11:07:40');
INSERT INTO `apply` VALUES ('418', '3', '235', '467', '我乐观外向，兴趣广泛，思维发散，考虑问题的角度异于常人，对题目中的“计算思维能力的培养”感兴趣。但我编程能力有限，学习过算法设计与分析，自学与动手能力良好。觉得自己能很好地完成这篇论文。', '2016-10-19 10:50:37', '234', '申请未通过，该题已有同学入选！', '2016-10-19 14:35:49', '1', '2016-10-19 10:50:37', '2016-10-19 14:35:49');
INSERT INTO `apply` VALUES ('419', '3', '470', '588', '实习的时候接触过拍卖系统相关功能的开发，对该功能的需求有一定的了解。在我看来拍卖系统的设计和实现涉及拍卖时竞拍的规则设计，以及瞬时高并发量请求的处理（抢拍情景），故对网站性能有一定的要求。技术方面，我学习过web开发，包括前端开发（html5, js/jq, css,bootstrap等）+后台开发（javaweb），对并发量处理有兴趣，了解过数据库操作相关的锁，乐观/悲观锁等，以及并发处理的线程池相关技术。希望能通过毕业设计得到一些相关的实践经验和成果。', '2016-10-19 10:51:03', '202', '同意', '2016-10-19 13:53:35', '1', '2016-10-19 10:51:03', '2016-10-19 13:53:35');
INSERT INTO `apply` VALUES ('421', '3', '598', '569', '对游戏的热爱。想利用cocos2d-x开发一款手机游戏。', '2016-10-19 10:51:25', '228', '好的', '2016-10-19 12:32:15', '1', '2016-10-19 10:51:25', '2016-10-19 12:32:15');
INSERT INTO `apply` VALUES ('422', '3', '532', '577', '相对于我来说，该系统的实用性比较大.对oracle与java较熟悉，也熟悉cognos等报表生成工具', '2016-10-19 10:52:25', '215', '申请未通过，该题已有同学入选！', '2016-10-19 11:59:27', '1', '2016-10-19 10:52:25', '2016-10-19 11:59:27');
INSERT INTO `apply` VALUES ('424', '3', '586', '482', '本人在之前的实习中做过类似的购物网站的设计，有设计经验', '2016-10-19 10:54:02', '279', '收到，近期会组织大家见面', '2016-10-19 11:32:01', '1', '2016-10-19 10:54:02', '2016-10-19 11:32:01');
INSERT INTO `apply` VALUES ('426', '3', '237', '467', '具有良好的C、JAVA语言基础，学习过人工智能，从小对游戏感兴趣。很乐意参加这次论文设计，将人工智能的技术运用到游戏中，增加游戏的可玩性。', '2016-10-19 10:54:56', '234', '申请未通过，该题已有同学入选！', '2016-10-19 15:20:17', '1', '2016-10-19 10:54:56', '2016-10-19 15:20:17');
INSERT INTO `apply` VALUES ('429', '3', '796', '298', '我的就业方向是前端开发，在实习期间 做过2个商城后台管理系统，对流程比较熟悉，该题目比较适合我', '2016-10-19 10:55:28', '270', '申请未通过，该题已有同学入选！', '2016-10-19 11:30:39', '1', '2016-10-19 10:55:28', '2016-10-19 11:30:39');
INSERT INTO `apply` VALUES ('430', '3', '790', '634', '对这个项目感兴趣，最近在学android开发', '2016-10-19 10:56:14', '265', '申请未通过，该题已有同学入选！', '2016-10-19 14:41:28', '1', '2016-10-19 10:56:14', '2016-10-19 14:41:28');
INSERT INTO `apply` VALUES ('431', '3', '526', '373', '对这个题目十分感兴趣', '2016-10-19 10:57:48', '254', null, null, '1', '2016-10-19 10:57:48', '2016-10-19 10:57:48');
INSERT INTO `apply` VALUES ('435', '3', '579', '410', '对网络安全很感兴趣，希望老师能够指导我的研究学习', '2016-10-19 11:00:23', '218', 'ok', '2016-10-19 11:07:29', '1', '2016-10-19 11:00:23', '2016-10-19 11:07:29');
INSERT INTO `apply` VALUES ('436', '3', '821', '362', '对这个课题感兴趣', '2016-10-19 11:00:23', '277', '已入选题目[医院门诊查询系统]，该申请无效', '2016-10-19 11:25:08', '1', '2016-10-19 11:00:23', '2016-10-19 11:25:08');
INSERT INTO `apply` VALUES ('437', '3', '796', '444', '个人对前端与后台有一定的学习基础，为了为未来的工作打下基础，希望能够通过这次毕业论文设计，对自己的前后端技术有一个深层次的历练，同时相信在未来的时间里自己能够完成这样一个二手商品交易平台的设计，希望能够得到老师的青睐，获得讲师的指导', '2016-10-19 11:01:33', '270', '已入选题目[在线投票选举系统的设计与实现]，该申请无效', '2016-10-19 14:02:41', '1', '2016-10-19 11:01:33', '2016-10-19 14:02:41');
INSERT INTO `apply` VALUES ('438', '3', '545', '669', '老师，我想做。', '2016-10-19 11:02:20', '230', '请把你的联系电话填一下', '2016-10-19 11:29:17', '1', '2016-10-19 11:02:20', '2016-10-19 11:29:17');
INSERT INTO `apply` VALUES ('439', '3', '321', '467', '二维码已经深入我们生活，我平时也会接触到很多，想趁着这次论文的机会了解下二维码安全这一方面的信息', '2016-10-19 11:02:21', '246', '可以。', '2016-10-19 14:05:15', '1', '2016-10-19 11:02:21', '2016-10-19 14:05:15');
INSERT INTO `apply` VALUES ('440', '3', '583', '362', '对这个课题感兴趣，之前未做过', '2016-10-19 11:02:47', '279', '收到，近期会组织大家见面', '2016-10-19 11:25:08', '1', '2016-10-19 11:02:47', '2016-10-19 11:25:08');
INSERT INTO `apply` VALUES ('442', '3', '470', '480', '学过相关应用的知识', '2016-10-19 11:03:49', '202', '申请未通过，该题已有同学入选！', '2016-10-19 13:53:35', '1', '2016-10-19 11:03:49', '2016-10-19 13:53:35');
INSERT INTO `apply` VALUES ('444', '3', '313', '571', '基于Python实现', '2016-10-19 11:04:45', '271', '申请未通过，该题已有同学入选！', '2016-10-19 13:55:18', '1', '2016-10-19 11:04:45', '2016-10-19 13:55:18');
INSERT INTO `apply` VALUES ('445', '3', '310', '483', '这么一个兼职分享平台可以带来许多方便，让想兼职的人更容易找到兼职也方便雇主筛选兼职人员。也可以做成基于html5的移动APP。', '2016-10-19 11:04:48', '271', '已入选题目[找不同手机益智游戏开发]，该申请无效', '2016-10-19 15:38:08', '1', '2016-10-19 11:04:48', '2016-10-19 15:38:08');
INSERT INTO `apply` VALUES ('446', '3', '420', '571', '基于Python实现', '2016-10-19 11:05:01', '229', '已入选题目[定时提醒桌面小工具的设计与开发]，该申请无效', '2016-10-19 11:18:02', '1', '2016-10-19 11:05:01', '2016-10-19 11:18:02');
INSERT INTO `apply` VALUES ('448', '3', '797', '490', '王老师您好，我是软件工程1班的唐建明同学，本人对android开发比较感兴趣，希望能够通过android开发一款实际应用来提高自己的android开发能力和整体的软件开发素质。', '2016-10-19 11:06:53', '265', '申请未通过，该题已有同学入选！', '2016-10-19 14:40:06', '1', '2016-10-19 11:06:53', '2016-10-19 14:40:06');
INSERT INTO `apply` VALUES ('449', '3', '692', '443', '老师您好！首先我自己对社会服务管理的内容比较感兴趣，这也是我一下子就被您的这个题目吸引的原因；再者，能利用自己所学的知识做自己喜欢的又有意义的事情，这令人兴奋；最后，我很期待老师您能成为我的指导老师。', '2016-10-19 11:07:00', '207', '同意', '2016-10-19 13:17:38', '1', '2016-10-19 11:07:00', '2016-10-19 13:17:38');
INSERT INTO `apply` VALUES ('451', '3', '467', '444', '个人对前端与后台有一定的学习基础，为了为未来的工作打下基础，希望能够通过这次毕业论文设计，对自己的前后端技术有一个深层次的历练，同时相信在未来的时间里自己能够完成这样一个在线投票选举的设计，我同时也投了二手商城系统，希望两者之一能够得到老师的青睐，获得讲师的指导', '2016-10-19 11:08:13', '202', '同意', '2016-10-19 14:02:41', '1', '2016-10-19 11:08:13', '2016-10-19 14:02:41');
INSERT INTO `apply` VALUES ('452', '3', '240', '554', '软工程3班  严肇勇   已经与老师你联系过', '2016-10-19 11:08:21', '234', '先查找一些资料到时见面确定框架。', '2016-10-19 14:31:44', '1', '2016-10-19 11:08:21', '2016-10-19 14:31:44');
INSERT INTO `apply` VALUES ('453', '3', '824', '571', '基于 .net 实现', '2016-10-19 11:08:25', '270', '同意申请', '2016-10-19 11:18:02', '1', '2016-10-19 11:08:25', '2016-10-19 11:18:02');
INSERT INTO `apply` VALUES ('454', '3', '725', '658', '老师您好！我是13网络工程3班的学生麦紫茵。学生之前在老师的指导下，学习了数据库这一门课程。后来在综合性试验和课程设计的实践中也接触到了关于数据库的进一步知识。学生对网站的设计与开发比较有兴趣，希望通过设计能实现简单的测试网站。非常希望能够老师能指导我的毕业论文，谢谢！', '2016-10-19 11:09:06', '270', '同意申请', '2016-10-19 13:16:28', '1', '2016-10-19 11:09:06', '2016-10-19 13:16:28');
INSERT INTO `apply` VALUES ('457', '3', '586', '444', '个人对前端与后台有一定的学习基础，为了为未来的工作打下基础，希望能够通过这次毕业论文设计，对自己的前后端技术有一个深层次的历练，同时相信在未来的时间里自己能够完成这样一个在线购物系统的设计，希望能够得到老师的青睐，获得讲师的指导', '2016-10-19 11:10:33', '279', '已入选题目[在线投票选举系统的设计与实现]，该申请无效', '2016-10-19 14:02:41', '1', '2016-10-19 11:10:33', '2016-10-19 14:02:41');
INSERT INTO `apply` VALUES ('459', '3', '593', '290', '该项目与本人目前的学习方向（机器学习）相符合。', '2016-10-19 11:11:33', '279', '收到。近期会组织大家见面讨论', '2016-10-19 11:23:43', '1', '2016-10-19 11:11:33', '2016-10-19 11:23:43');
INSERT INTO `apply` VALUES ('461', '3', '270', '365', '本人对基于手机平台的个人事务管理有一定的兴趣，加上之前用过一段时间的个人事务管理系统（iso），因此觉得个人事务管理系统有一定的优化空间。', '2016-10-19 11:13:23', '237', '申请未通过，该题已有同学入选！', '2016-10-19 12:34:17', '1', '2016-10-19 11:13:23', '2016-10-19 12:34:17');
INSERT INTO `apply` VALUES ('462', '3', '580', '293', '对网络攻击防御感兴趣', '2016-10-19 11:13:26', '218', 'ok', '2016-10-19 11:25:25', '1', '2016-10-19 11:13:26', '2016-10-19 11:25:25');
INSERT INTO `apply` VALUES ('463', '3', '796', '585', 'CS模式开发，二手物品存放在数据库中，连接数据库，根据不同的搜索条件查看二手物品，提供学生登录功能，能够对登记二手物品信息，收藏二手信息，查看二手信息的信息', '2016-10-19 11:13:38', '270', '同意申请', '2016-10-19 11:30:39', '1', '2016-10-19 11:13:38', '2016-10-19 11:30:39');
INSERT INTO `apply` VALUES ('464', '3', '470', '444', '个人对前端与后台有一定的学习基础，为了为未来的工作打下基础，希望能够通过这次毕业论文设计，对自己的前后端技术有一个深层次的历练，同时相信在未来的时间里自己能够完成这样一个网上拍卖系统的设计，希望能够得到老师的青睐，获得讲师的指导', '2016-10-19 11:14:17', '202', '已入选题目[在线投票选举系统的设计与实现]，该申请无效', '2016-10-19 14:02:41', '1', '2016-10-19 11:14:17', '2016-10-19 14:02:41');
INSERT INTO `apply` VALUES ('466', '3', '631', '650', '老师我对网络方向有兴趣！', '2016-10-19 11:15:52', '218', 'ok', '2016-10-19 11:23:42', '1', '2016-10-19 11:15:52', '2016-10-19 11:23:42');
INSERT INTO `apply` VALUES ('467', '3', '585', '353', '对这个课题有兴趣', '2016-10-19 11:16:58', '279', '收到，近期会组织大家见面', '2016-10-19 11:24:54', '1', '2016-10-19 11:16:58', '2016-10-19 11:24:54');
INSERT INTO `apply` VALUES ('469', '3', '785', '577', '对数据库oracle，java等比较熟悉，而且该题目实用性很大', '2016-10-19 11:17:59', '230', '好的', '2016-10-19 11:23:11', '1', '2016-10-19 11:17:59', '2016-10-19 11:23:11');
INSERT INTO `apply` VALUES ('471', '3', '555', '313', '聊天工具是人们生活必不可少的工具，对其的改进和研究具有重要意义，我希望能通过设计一个聊天工具将自己的知识作一个汇总和综合的练习。', '2016-10-19 11:20:18', '266', '可以', '2016-10-19 12:05:56', '1', '2016-10-19 11:20:18', '2016-10-19 12:05:56');
INSERT INTO `apply` VALUES ('472', '3', '321', '650', '对网络信息安全这一方面有兴趣，所以想对二维码这种新型的信息承载方式深入了解。', '2016-10-19 11:21:43', '246', '申请未通过，该题已有同学入选！', '2016-10-19 14:05:15', '1', '2016-10-19 11:21:43', '2016-10-19 14:05:15');
INSERT INTO `apply` VALUES ('477', '3', '638', '643', '身为网络工程专业，首选必须是网络类论文来证明所学\r\nBGP作为网络边界协议，实现内外网络联通', '2016-10-19 11:26:33', '218', '申请未通过，该题已有同学入选！', '2016-10-19 12:31:06', '1', '2016-10-19 11:26:33', '2016-10-19 12:31:06');
INSERT INTO `apply` VALUES ('480', '3', '290', '575', '比较喜欢Android应用开发，大三的时候自学了一段时间Android游戏开发，实训的时候也选了Android应用开发', '2016-10-19 11:28:22', '237', '已入选题目[汽车停车位实时管理系统APP的设计与实现]，该申请无效', '2016-10-19 11:46:03', '1', '2016-10-19 11:28:22', '2016-10-19 11:46:03');
INSERT INTO `apply` VALUES ('482', '3', '479', '656', '老师，我想做日程管理的课题。', '2016-10-19 11:28:48', '231', '已入选题目[基于手机的小学生课程日历系统]，该申请无效', '2016-10-19 12:26:16', '1', '2016-10-19 11:28:48', '2016-10-19 12:26:16');
INSERT INTO `apply` VALUES ('484', '3', '527', '365', '本人深受英语单词记忆的痛苦，一直试图寻找更好的途径来记忆英语单词，结果仍是挑灯夜背，单词量似乎已达饱和状态。\r\n所以，看了老师您这个题目，非常感兴趣，希望老师能给学生我一个机会。', '2016-10-19 11:31:00', '215', '同意。加我的QQ', '2016-10-19 12:04:37', '1', '2016-10-19 11:31:00', '2016-10-19 12:04:37');
INSERT INTO `apply` VALUES ('485', '3', '314', '669', '老师，我对这个有些想法，我想做。', '2016-10-19 11:31:01', '271', '申请未通过，该题已有同学入选！', '2016-10-19 13:47:33', '1', '2016-10-19 11:31:01', '2016-10-19 13:47:33');
INSERT INTO `apply` VALUES ('487', '3', '312', '575', '比较喜欢Android应用开发，实训的时候也选了Android应用开发方向的', '2016-10-19 11:33:27', '271', '申请未通过，该题已有同学入选！', '2016-10-19 13:10:00', '1', '2016-10-19 11:33:27', '2016-10-19 13:10:00');
INSERT INTO `apply` VALUES ('488', '3', '321', '643', '对于信息安全很感兴趣 二维码安全有所了解', '2016-10-19 11:34:08', '246', '申请未通过，该题已有同学入选！', '2016-10-19 14:05:15', '1', '2016-10-19 11:34:08', '2016-10-19 14:05:15');
INSERT INTO `apply` VALUES ('489', '3', '272', '584', '有过一些Android开发经验', '2016-10-19 11:34:41', '237', '申请未通过，该题已有同学入选！', '2016-10-19 12:33:24', '1', '2016-10-19 11:34:41', '2016-10-19 12:33:24');
INSERT INTO `apply` VALUES ('496', '3', '514', '499', '基于java语言进行开发，以Eclipse作为开发工具开展设计，后台数据库使用MySQL数据库，系统采用B/S模式。结合目前小区业委会管理情况进行设计，优化业务管理、完善业务流程，提高管理效率。畅通小区信息流通渠道，实现信息化小区管理、智能化小区交流平台。', '2016-10-19 11:38:27', '265', '已入选题目[基于Android的家谱管理APP设计与实现]，该申请无效', '2016-10-19 14:51:34', '1', '2016-10-19 11:38:27', '2016-10-19 14:51:34');
INSERT INTO `apply` VALUES ('499', '3', '790', '605', '王老师，您好！我是13级网络工程1班的林文旭。对于“订票与选座APP设计与实现”这个论文题目，我挺有兴趣的。再加上我本人是往Android方向发展的，也准备从事Android手机应用开发的工作。所以希望老师您可以让我参与到这个论文题目中去。如果老师您需要找我面谈的话，可以通过手机或邮箱联系到我。我的手机：188-1412-7298。我的邮箱：i_am_fantasy@163.com', '2016-10-19 11:39:11', '265', 'ok', '2016-10-19 14:41:28', '1', '2016-10-19 11:39:11', '2016-10-19 14:41:28');
INSERT INTO `apply` VALUES ('500', '3', '399', '483', 'html5和CSS3是新的web标准，html5对跨平台有很好的支持。移动信息发布与分享系统可以支持多种类型的模板建立与使用，方便信息发布者的信息发布。', '2016-10-19 11:40:13', '236', '已入选题目[找不同手机益智游戏开发]，该申请无效', '2016-10-19 15:38:08', '1', '2016-10-19 11:40:13', '2016-10-19 15:38:08');
INSERT INTO `apply` VALUES ('501', '3', '541', '575', '比较喜欢Android应用开发，大三的时候自学了一段时间Android游戏开发，实训时也选了Android应用开发方向的', '2016-10-19 11:41:47', '230', '好的', '2016-10-19 11:46:03', '1', '2016-10-19 11:41:47', '2016-10-19 11:46:03');
INSERT INTO `apply` VALUES ('503', '3', '311', '573', '想深度学习一下这方面的技术，谢谢老师！', '2016-10-19 11:42:47', '271', '申请未通过，该题已有同学入选！', '2016-10-19 12:59:32', '1', '2016-10-19 11:42:47', '2016-10-19 12:59:32');
INSERT INTO `apply` VALUES ('505', '3', '499', '663', '老师您好，我对于这个课题很是感兴趣，希望能做您的指导学生。', '2016-10-19 11:43:31', '210', '可以', '2016-10-19 13:06:20', '1', '2016-10-19 11:43:31', '2016-10-19 13:06:20');
INSERT INTO `apply` VALUES ('506', '3', '532', '584', '了解数据仓库，曾经做过商家外卖数据仓库的设计，对cognos、etl等工具也比较了解', '2016-10-19 11:43:57', '215', '同意。\r\n加我的QQ：1304890935', '2016-10-19 12:01:30', '1', '2016-10-19 11:43:57', '2016-10-19 12:01:30');
INSERT INTO `apply` VALUES ('507', '3', '629', '643', 'BGP是网络边界协议，通过学习使内外网联通。\r\n但其又是脆弱的，因为单反程序员不安全编程都可能使攻击者有可乘之机。\r\n所以，希望能过通过选择该题，进一步加深自己对于BGP协议的理解，同时，是对自己研究渗透测试与安全防范的一次检验', '2016-10-19 11:44:13', '218', 'ok', '2016-10-19 12:24:53', '1', '2016-10-19 11:44:13', '2016-10-19 12:24:53');
INSERT INTO `apply` VALUES ('511', '3', '584', '483', '可以做成web应用，用html5实现可以做到对跨平台的支持。方便选课。', '2016-10-19 11:48:03', '279', '已入选题目[找不同手机益智游戏开发]，该申请无效', '2016-10-19 15:38:08', '1', '2016-10-19 11:48:03', '2016-10-19 15:38:08');
INSERT INTO `apply` VALUES ('512', '3', '313', '573', '想深度学习这方面技术，谢谢老师！', '2016-10-19 11:50:07', '271', '申请未通过，该题已有同学入选！', '2016-10-19 13:55:18', '1', '2016-10-19 11:50:07', '2016-10-19 13:55:18');
INSERT INTO `apply` VALUES ('513', '3', '829', '595', '之前有跟老师做过类似项目，因此对需求比较了解。而且本人对PHP+SQL开发有兴趣，也希望借着做毕业设计的机会逼自己学习并且应用于开发上。', '2016-10-19 11:50:42', '233', null, null, '1', '2016-10-19 11:50:42', '2016-10-19 11:50:42');
INSERT INTO `apply` VALUES ('515', '1', '358', '43', '曹老师您好，我是13信管1班的苏文琪。在大三期间做过商品的管理系统，对系统的设计和实现有一定了解。', '2016-10-19 11:51:26', '26', '已入选题目[物联网环境下的农产品流通质量安全风险评估与预警方法]，该申请无效', '2017-08-12 22:20:02', '1', '2016-10-19 11:51:26', '2017-08-12 22:20:02');
INSERT INTO `apply` VALUES ('517', '3', '515', '499', '梳理各家族成员间的关系，生成各成员独有的名片，实现对家族所有成员的信息收集及整理。利用树型数据结构对数据进行存储，用树型结构显示家谱图。', '2016-10-19 11:52:05', '265', 'ok', '2016-10-19 14:51:34', '1', '2016-10-19 11:52:05', '2016-10-19 14:51:34');
INSERT INTO `apply` VALUES ('518', '3', '482', '382', '打算从事android程序开发，并且对这个题目也比较感兴趣，用过微软的remote desktop，对这个题目也有大概的认识', '2016-10-19 11:52:06', '231', '申请未通过，该题已有同学入选！', '2016-10-19 17:25:33', '1', '2016-10-19 11:52:06', '2016-10-19 17:25:33');
INSERT INTO `apply` VALUES ('519', '3', '482', '383', '如果说实现思路的话\r\n1)在pc端制作一个软件，用于发送屏幕信息，接收android端的控制信息\r\n2)在android制作一个app，用于接收屏幕信息，并发送控制信息。', '2016-10-19 11:52:23', '231', '申请未通过，该题已有同学入选！', '2016-10-19 17:25:33', '1', '2016-10-19 11:52:23', '2016-10-19 17:25:33');
INSERT INTO `apply` VALUES ('522', '3', '764', '582', '学习过mvc开发', '2016-10-19 11:52:59', '230', '好的', '2016-10-19 12:25:34', '1', '2016-10-19 11:52:59', '2016-10-19 12:25:34');
INSERT INTO `apply` VALUES ('523', '3', '483', '383', '如果说实现思路的话\r\n1)在pc端制作一个软件，用于发送屏幕信息，接收android端的控制信息\r\n2)在android制作一个app，用于接收屏幕信息，并发送控制信息。', '2016-10-19 11:53:02', '231', '同意', '2016-10-19 12:25:26', '1', '2016-10-19 11:53:02', '2016-10-19 12:25:26');
INSERT INTO `apply` VALUES ('524', '3', '638', '615', '想学习基于SDN的运维、优化知识。', '2016-10-19 11:53:42', '218', 'ok', '2016-10-19 12:31:06', '1', '2016-10-19 11:53:42', '2016-10-19 12:31:06');
INSERT INTO `apply` VALUES ('525', '3', '519', '381', '。', '2016-10-19 11:54:25', '254', null, null, '1', '2016-10-19 11:54:25', '2016-10-19 11:54:25');
INSERT INTO `apply` VALUES ('529', '3', '355', '499', '实现账目分类管理，用户可制定每月存款计划，每月查看当月财务报表，让收支情况一目了然', '2016-10-19 11:56:19', '203', '申请未通过，该题已有同学入选！', '2016-10-19 20:44:01', '1', '2016-10-19 11:56:19', '2016-10-19 20:44:01');
INSERT INTO `apply` VALUES ('531', '3', '484', '382', '打算从事android程序开发。这个题目和Android手机对计算机的屏幕监控相似，所以也想要选择这个题目', '2016-10-19 11:57:07', '231', '同意', '2016-10-19 12:22:10', '1', '2016-10-19 11:57:07', '2016-10-19 12:22:10');
INSERT INTO `apply` VALUES ('532', '3', '790', '584', '有过Android开发经验，熟悉Oracle、MySQL', '2016-10-19 11:57:24', '265', '申请未通过，该题已有同学入选！', '2016-10-19 14:41:28', '1', '2016-10-19 11:57:24', '2016-10-19 14:41:28');
INSERT INTO `apply` VALUES ('533', '3', '404', '564', '今后想要从事游戏开放行业，这个论文题目感觉对今后有很大的帮助，希望能在老师的指导下完成。', '2016-10-19 11:57:43', '229', '申请未通过，该题已有同学入选！', '2016-10-19 14:07:45', '1', '2016-10-19 11:57:43', '2016-10-19 14:07:45');
INSERT INTO `apply` VALUES ('534', '3', '603', '656', '老师，我想做这个', '2016-10-19 11:58:40', '228', '好的', '2016-10-19 12:26:16', '1', '2016-10-19 11:58:40', '2016-10-19 12:26:16');
INSERT INTO `apply` VALUES ('537', '3', '479', '382', '打算从事android程序开发，这个题目有很多类似的应用可以提供参考，而我也想或许能做出更好用的日程管理应用', '2016-10-19 12:01:49', '231', '已入选题目[实现手机通过wifi控制计算机进行幻灯片演讲]，该申请无效', '2016-10-19 12:22:10', '1', '2016-10-19 12:01:49', '2016-10-19 12:22:10');
INSERT INTO `apply` VALUES ('543', '3', '314', '473', '熟悉web技术，对企业人力资源管理系统感兴趣', '2016-10-19 12:08:10', '271', '申请未通过，该题已有同学入选！', '2016-10-19 13:47:33', '1', '2016-10-19 12:08:10', '2016-10-19 13:47:33');
INSERT INTO `apply` VALUES ('544', '3', '797', '499', '基于JAVA语言开发，以eclipse为工具展开设计，使用MySQL数据库。结合目前小区业委会管理情况进行设计，优化小区管理业务，实现信息化小区管理', '2016-10-19 12:08:25', '265', '已入选题目[基于Android的家谱管理APP设计与实现]，该申请无效', '2016-10-19 14:51:34', '1', '2016-10-19 12:08:25', '2016-10-19 14:51:34');
INSERT INTO `apply` VALUES ('546', '3', '310', '587', '想尝试一下 感觉题目还是有很多东西做的~~~老师我们可以面谈呀', '2016-10-19 12:10:44', '271', '申请未通过，该题已有同学入选！', '2016-10-19 13:03:16', '1', '2016-10-19 12:10:44', '2016-10-19 13:03:16');
INSERT INTO `apply` VALUES ('549', '3', '638', '636', '对网络方面兴趣比较大。', '2016-10-19 12:11:38', '218', '申请未通过，该题已有同学入选！', '2016-10-19 12:31:06', '1', '2016-10-19 12:11:38', '2016-10-19 12:31:06');
INSERT INTO `apply` VALUES ('550', '2', '145', '173', '学过一些通讯技术，自己对技术类的研究也比较在行', '2016-10-19 12:12:09', '15', '这个需要开发软件实现功能点。', '2016-10-19 21:09:52', '1', '2016-10-19 12:12:09', '2016-10-19 21:09:52');
INSERT INTO `apply` VALUES ('551', '3', '394', '587', '想尝试一下 感觉题目还是有很多东西做的~~~老师我们可以面谈呀', '2016-10-19 12:12:11', '236', '已入选题目[基于LBS应用的逛街宝系统]，该申请无效', '2016-10-19 12:27:38', '1', '2016-10-19 12:12:11', '2016-10-19 12:27:38');
INSERT INTO `apply` VALUES ('553', '3', '516', '328', '利用Spark已有的算法对用户行为数据进行挖掘分析 为用户推荐类似商品或者是感兴趣商品', '2016-10-19 12:12:49', '220', '与老师联系一下', '2016-10-19 15:05:31', '1', '2016-10-19 12:12:49', '2016-10-19 15:05:31');
INSERT INTO `apply` VALUES ('555', '3', '725', '383', '实现原理\r\n1)在服务器端制作一个Web服务器\r\n2)制作一个网页，用于接收用户的sql语句，发送语句到服务器\r\n3)服务器解析并提交sql语句，根据所选数据库类型，提交到不同的数据库。\r\n4)根据返回的结果，回馈到网站。', '2016-10-19 12:14:17', '270', '申请未通过，该题已有同学入选！', '2016-10-19 13:16:28', '1', '2016-10-19 12:14:17', '2016-10-19 13:16:28');
INSERT INTO `apply` VALUES ('557', '3', '526', '587', '想尝试一下 感觉题目还是有很多东西做的  感觉压缩算法什么的以前也没太多了解过 可以挑战一下~~~老师我们可以面谈呀', '2016-10-19 12:14:35', '254', '已入选题目[基于LBS应用的逛街宝系统]，该申请无效', '2016-10-19 12:27:38', '1', '2016-10-19 12:14:35', '2016-10-19 12:27:38');
INSERT INTO `apply` VALUES ('558', '3', '483', '652', '有android和c#的开发经验，对该课题表示感兴趣，有使用过此类的远控软件。', '2016-10-19 12:15:20', '231', '已入选题目[Android平台下的美图系统]，该申请无效', '2016-10-19 12:29:45', '1', '2016-10-19 12:15:20', '2016-10-19 12:29:45');
INSERT INTO `apply` VALUES ('559', '3', '398', '573', '个人对于前端感兴趣，还有上学期的实习就是学这方面，希望通过这次毕业论文再次深造，谢谢！', '2016-10-19 12:16:30', '236', null, null, '1', '2016-10-19 12:16:30', '2016-10-19 12:16:30');
INSERT INTO `apply` VALUES ('561', '3', '605', '587', '想尝试一下 感觉题目还是有很多东西做的~~~老师我们可以面谈呀', '2016-10-19 12:17:49', '228', '好的', '2016-10-19 12:27:38', '1', '2016-10-19 12:17:49', '2016-10-19 12:27:38');
INSERT INTO `apply` VALUES ('562', '3', '292', '652', '选秀过图形学，对图形学还是挺感兴趣的。另外对android开发熟悉。', '2016-10-19 12:19:41', '237', 'ok', '2016-10-19 12:29:45', '1', '2016-10-19 12:19:41', '2016-10-19 12:29:45');
INSERT INTO `apply` VALUES ('564', '3', '517', '381', '听说一个论文题目只有一个人选择，所以我选一个备选的以防前面那个论题有人在我前面选了。第一志愿是jsp在线教学质量评价系统的设计与实现。谢谢！', '2016-10-19 12:21:48', '254', null, null, '1', '2016-10-19 12:21:48', '2016-10-19 12:21:48');
INSERT INTO `apply` VALUES ('569', '3', '309', '639', '张猜老师您好，我是13级网络工程2班的学生张权洋，我对于您发布的《	仓库管理系统》的题目很感兴趣，希望您能作为我的导师，指导我完成毕业设计和论文。我通过对大学课程的学习，也有一定的开发与设计能力。我觉得这个题目难度适中，又有挑战性。希望得到老师许可。', '2016-10-19 12:25:31', '271', '已入选题目[基于近邻用户的商品推荐系统实现]，该申请无效', '2016-10-19 12:43:36', '1', '2016-10-19 12:25:31', '2016-10-19 12:43:36');
INSERT INTO `apply` VALUES ('570', '3', '290', '345', '本人想学习Android游戏开发', '2016-10-19 12:26:02', '237', null, null, '1', '2016-10-19 12:26:02', '2016-10-19 12:26:02');
INSERT INTO `apply` VALUES ('571', '3', '542', '562', '感兴趣', '2016-10-19 12:26:27', '230', '好的', '2016-10-19 12:37:14', '1', '2016-10-19 12:26:27', '2016-10-19 12:37:14');
INSERT INTO `apply` VALUES ('574', '3', '313', '559', '本人有意向在网站建设的方向发展，并已经掌握网站开发的前端技术，所以希望能够通过这个设计来熟悉和锻炼自己对于web开发的各项技能，恳请通过申请！谢谢老师！', '2016-10-19 12:28:02', '271', '申请未通过，该题已有同学入选！', '2016-10-19 13:55:18', '1', '2016-10-19 12:28:02', '2016-10-19 13:55:18');
INSERT INTO `apply` VALUES ('576', '3', '482', '372', '对此题目兴趣浓厚，也有一定的基础知识，能坚持不懈直到完成', '2016-10-19 12:28:24', '231', '申请未通过，该题已有同学入选！', '2016-10-19 17:25:33', '1', '2016-10-19 12:28:24', '2016-10-19 17:25:33');
INSERT INTO `apply` VALUES ('578', '3', '404', '401', '希望能够通过本次毕业设计的学习能自己实现对大型3D游戏的渲染，使游戏变得更加的真实', '2016-10-19 12:29:27', '229', '有图形学的基础不？', '2016-10-19 14:07:45', '1', '2016-10-19 12:29:27', '2016-10-19 16:51:54');
INSERT INTO `apply` VALUES ('580', '3', '399', '559', '本人有意向在网站建设的方向发展，并已经掌握网站开发的前端技术，所以希望能够通过这个设计来熟悉和锻炼自己对于web开发的各项技能，恳请通过申请！谢谢老师！', '2016-10-19 12:29:48', '236', null, null, '1', '2016-10-19 12:29:48', '2016-10-19 12:29:48');
INSERT INTO `apply` VALUES ('581', '3', '481', '641', '郑婵老师你好，我是13级网络工程2班的学生郑鸿翊，我对于您发布的《Android手机的行迹记录及其地图显示》的题目很感兴趣，希望您能作为我的导师，指导我完成毕业设计和论文。\r\n我在大二就开始自学Android开发，现已有几个项目经验。我觉得这个题目难度适中，又有挑战性。希望得到老师许可。', '2016-10-19 12:29:58', '231', '已入选题目[Android平台下的个人事务管理系统]，该申请无效', '2016-10-19 12:34:17', '1', '2016-10-19 12:29:58', '2016-10-19 12:34:17');
INSERT INTO `apply` VALUES ('583', '3', '270', '641', '张春玲老师你好，我是13级网络工程2班的学生郑鸿翊，我对于您发布的《Android平台下的个人事务管理系统》的题目很感兴趣，希望您能作为我的导师，指导我完成毕业设计和论文。\r\n我在大二就开始自学Android开发，现已有几个项目经验。我觉得这个题目难度适中，又有挑战性。希望得到老师许可。', '2016-10-19 12:31:10', '237', 'ok', '2016-10-19 12:34:17', '1', '2016-10-19 12:31:10', '2016-10-19 12:34:17');
INSERT INTO `apply` VALUES ('584', '3', '603', '629', '该项目可以在实际生活中可以发挥很好的作用，方便提醒小学生对自己学习和生活的规划，同时也方便家长对小朋友生活的管理。', '2016-10-19 12:31:26', '228', null, null, '1', '2016-10-19 12:31:26', '2016-10-19 12:31:26');
INSERT INTO `apply` VALUES ('585', '3', '606', '473', '熟悉web开发，参与过党课培训', '2016-10-19 12:31:29', '228', '好的', '2016-10-19 12:52:12', '1', '2016-10-19 12:31:29', '2016-10-19 12:52:12');
INSERT INTO `apply` VALUES ('586', '3', '515', '641', '王春桃教授你好，我是13级网络工程2班的学生郑鸿翊，我对于您发布的《基于Android的家谱管理APP设计与实现》的题目很感兴趣，希望您能作为我的导师，指导我完成毕业设计和论文。\r\n我在大二就开始自学Android开发，现已有几个项目经验。我觉得这个题目难度适中，又有挑战性。希望得到老师许可。', '2016-10-19 12:31:50', '265', '申请未通过，该题已有同学入选！', '2016-10-19 14:51:34', '1', '2016-10-19 12:31:50', '2016-10-19 14:51:34');
INSERT INTO `apply` VALUES ('588', '3', '520', '487', '对Java开发感兴趣', '2016-10-19 12:33:07', '254', null, null, '1', '2016-10-19 12:33:07', '2016-10-19 12:33:07');
INSERT INTO `apply` VALUES ('589', '3', '46', '639', '老师，我最近在思考研究淘宝系统的千人千面个性化推荐功能，我觉得您的这个论题能比较好的解决我的算法逻辑上的问题，我也对这个问题有着浓厚的兴趣，希望能选得您的《基于近邻用户的商品推荐系统实现》这个论题，并有幸能得到您的指点，我肯定会勤勤恳恳地去完成好这个论题的。', '2016-10-19 12:33:29', '278', 'Approve', '2016-10-19 12:43:36', '1', '2016-10-19 12:33:29', '2016-10-19 12:43:36');
INSERT INTO `apply` VALUES ('590', '3', '515', '609', '对Android开发很感兴趣', '2016-10-19 12:34:10', '265', '申请未通过，该题已有同学入选！', '2016-10-19 14:51:34', '1', '2016-10-19 12:34:10', '2016-10-19 14:51:34');
INSERT INTO `apply` VALUES ('591', '3', '515', '560', '我的反向是android，此外个人对家谱有着浓厚的兴趣，而且现在的app中似乎并无同类产品，做别人没做的挺好。', '2016-10-19 12:34:15', '265', '申请未通过，该题已有同学入选！', '2016-10-19 14:51:34', '1', '2016-10-19 12:34:15', '2016-10-19 14:51:34');
INSERT INTO `apply` VALUES ('593', '3', '775', '641', '李双娟老师你好，我是13级网络工程2班的学生郑鸿翊，我对于您发布的《宠物健康管家APP设计与开发》的题目很感兴趣，希望您能作为我的导师，指导我完成毕业设计和论文。\r\n我在大二就开始自学Android开发，现已有几个项目经验。我觉得这个题目难度适中，又有挑战性。希望得到老师许可。', '2016-10-19 12:34:58', '864', null, null, '1', '2016-10-19 12:34:58', '2016-10-19 12:34:58');
INSERT INTO `apply` VALUES ('594', '3', '467', '559', '本人有意向在网站建设的方向发展，并已经掌握网站开发的前端技术，所以希望能够通过这个设计来熟悉和锻炼自己对于web开发的各项技能，恳请通过申请！谢谢老师！', '2016-10-19 12:35:27', '202', '申请未通过，该题已有同学入选！', '2016-10-19 14:02:41', '1', '2016-10-19 12:35:27', '2016-10-19 14:02:41');
INSERT INTO `apply` VALUES ('597', '3', '348', '631', '在实习期间进行了服务器相关的工作，想继续深入研究相关的技术，对snmp有一定的了解以及兴趣，希望能从中学到更多。', '2016-10-19 12:36:54', '203', '已经制定，请一定努力完成。', '2016-10-19 20:16:40', '1', '2016-10-19 12:36:54', '2016-10-19 20:16:40');
INSERT INTO `apply` VALUES ('599', '3', '473', '652', '这个对我应该具有一定的挑战性。。不过我试着申请看看。。', '2016-10-19 12:38:03', '202', null, null, '1', '2016-10-19 12:38:03', '2016-10-19 12:38:03');
INSERT INTO `apply` VALUES ('600', '3', '383', '560', '我的自行车刚买不到一个月就被偷了，也许车位管理能改善偷盗现象。', '2016-10-19 12:38:12', '212', '已入选题目[基于Android校园饭堂菜品网上选择与下单系统]，该申请无效', '2016-10-19 12:56:24', '1', '2016-10-19 12:38:12', '2016-10-19 12:56:24');
INSERT INTO `apply` VALUES ('602', '3', '49', '473', '科研项目管理系统挺有意思的，想尝试一下，也做过web类型的项目', '2016-10-19 12:40:28', '252', '已入选题目[党校培训考试管理系统]，该申请无效', '2016-10-19 12:52:12', '1', '2016-10-19 12:40:28', '2016-10-19 12:52:12');
INSERT INTO `apply` VALUES ('604', '3', '376', '652', '对图形学和机器学习有一点的认识', '2016-10-19 12:41:22', '212', '申请未通过，该题已有同学入选！', '2016-10-19 12:57:34', '1', '2016-10-19 12:41:22', '2016-10-19 12:57:34');
INSERT INTO `apply` VALUES ('605', '3', '240', '559', '本人有意向在网站建设的方向发展，并已经掌握网站开发的前端技术，所以希望能够通过这个设计来熟悉和锻炼自己对于web开发的各项技能，恳请通过申请！谢谢老师！', '2016-10-19 12:41:28', '234', '申请未通过，该题已有同学入选！', '2016-10-19 14:31:44', '1', '2016-10-19 12:41:28', '2016-10-19 14:31:44');
INSERT INTO `apply` VALUES ('607', '3', '309', '651', '因为以前在作业过程中，在这方面接触的比较多，刚好自己也是比较喜欢这方面的工作，所以希望老师给个机会啦~', '2016-10-19 12:42:07', '271', null, null, '1', '2016-10-19 12:42:07', '2016-10-19 12:42:41');
INSERT INTO `apply` VALUES ('608', '3', '548', '652', '对区块链这个新鲜事物感兴趣，不过具体了解较少。', '2016-10-19 12:43:17', '266', '申请未通过，该题已有同学入选！', '2016-10-19 16:34:34', '1', '2016-10-19 12:43:17', '2016-10-19 16:34:34');
INSERT INTO `apply` VALUES ('609', '3', '514', '640', '本身家住小区，能够深切感受到一个好的小区业委会管理系统是多么的美好。大二的Java语言课程后定下了Java开发的职业方向，熟悉Java语言开发，曽在课程设计中完成过课堂点名系统开发，对于系统的实现有一定基础。\r\n    曽修读过王老师您的《计算机组成原理》课程，课上老师风趣的教学与严谨的态度给我留下了深刻印象。希望老师能给我一个机会。', '2016-10-19 12:43:17', '265', null, null, '1', '2016-10-19 12:43:17', '2016-10-19 12:57:45');
INSERT INTO `apply` VALUES ('610', '3', '348', '636', '老师选我选我！！！', '2016-10-19 12:43:23', '203', '申请未通过，该题已有同学入选！', '2016-10-19 20:16:40', '1', '2016-10-19 12:43:23', '2016-10-19 20:16:40');
INSERT INTO `apply` VALUES ('611', '3', '310', '330', '比较感兴趣。', '2016-10-19 12:43:54', '271', '申请未通过，该题已有同学入选！', '2016-10-19 13:03:16', '1', '2016-10-19 12:43:54', '2016-10-19 13:03:16');
INSERT INTO `apply` VALUES ('612', '3', '385', '560', '如果做的成功，使用量肯定过万，饭堂高峰期的拥挤现象也会转好，作为留给学弟学妹的礼物也不错。', '2016-10-19 12:44:11', '212', '可以！', '2016-10-19 12:56:24', '1', '2016-10-19 12:44:11', '2016-10-19 12:56:24');
INSERT INTO `apply` VALUES ('613', '3', '794', '549', '对算法分析与设计有一定的掌握和兴趣，希望能深入学习。', '2016-10-19 12:44:56', '265', '已入选题目[计算思维教学案例库设计与实现]，该申请无效', '2016-10-19 14:35:49', '1', '2016-10-19 12:44:56', '2016-10-19 14:35:49');
INSERT INTO `apply` VALUES ('614', '3', '348', '601', '本人13级网络工程1班学生李福然，对运维和监控方面感兴趣', '2016-10-19 12:45:54', '203', '申请未通过，该题已有同学入选！', '2016-10-19 20:16:40', '1', '2016-10-19 12:45:54', '2016-10-19 20:16:40');
INSERT INTO `apply` VALUES ('616', '3', '758', '629', '该系统在实际生活中有较大的用处，方便教师管理学生作业与成绩，同时也方便学生完成老师布置的作业，节省纸张等等。', '2016-10-19 12:47:33', '211', '申请未通过，该题已有同学入选！', '2016-10-19 16:21:08', '1', '2016-10-19 12:47:33', '2016-10-19 16:21:08');
INSERT INTO `apply` VALUES ('619', '3', '384', '560', '用了几年二手书，唯一的感慨就是“好难找！”。教材的内容一两年之内不会有太多变化，旧书完全可以给需要的人使用，有些人把书扔了或是卖废品都实在可惜。当然，如果有这么一个平台，多数人都会做正确的选择。', '2016-10-19 12:51:11', '212', '申请未通过，该题已有同学入选！', '2016-10-19 12:56:41', '1', '2016-10-19 12:51:11', '2016-10-19 12:56:41');
INSERT INTO `apply` VALUES ('621', '3', '426', '564', '今后想要从事游戏行业，希望能通过毕业选题，学习到关于图像学的研究。', '2016-10-19 12:52:05', '229', '已入选题目[物体运动轨迹分析研究]，该申请无效', '2016-10-19 13:19:05', '1', '2016-10-19 12:52:05', '2016-10-19 13:19:05');
INSERT INTO `apply` VALUES ('622', '3', '384', '637', '对于android的开发很感兴趣,也有一定的android开发基础。', '2016-10-19 12:53:00', '212', '试一下', '2016-10-19 12:56:41', '1', '2016-10-19 12:53:00', '2016-10-19 12:56:41');
INSERT INTO `apply` VALUES ('623', '3', '470', '555', '之前的课程设计也做过购物网站，这个网上拍卖系统也是类似的，所以想选这个题目。', '2016-10-19 12:53:21', '202', '已入选题目[图书馆无人值班自动管理系统]，该申请无效', '2016-10-19 16:16:26', '1', '2016-10-19 12:53:21', '2016-10-19 16:16:26');
INSERT INTO `apply` VALUES ('624', '3', '514', '629', '该项目在实际应用能发挥较大用处，方便小区管理人员管理。', '2016-10-19 12:54:10', '265', null, null, '1', '2016-10-19 12:54:10', '2016-10-19 12:54:10');
INSERT INTO `apply` VALUES ('625', '3', '513', '635', '1、农业是国之根本\r\n2、互联网+助力农业的发展', '2016-10-19 12:54:27', '255', '你已经入选该题了，请保持手机畅通，这几天会联系你集中开会，讨论毕业设计适宜。', '2016-10-19 14:29:57', '1', '2016-10-19 12:54:27', '2016-10-19 14:29:57');
INSERT INTO `apply` VALUES ('626', '3', '311', '346', '对图书管理系统的设计与实现十分感兴趣。', '2016-10-19 12:54:37', '271', '同意', '2016-10-19 12:59:32', '1', '2016-10-19 12:54:37', '2016-10-19 12:59:32');
INSERT INTO `apply` VALUES ('629', '3', '313', '356', '对网上商城的设计与实现十分感兴趣', '2016-10-19 12:55:59', '271', '同意', '2016-10-19 13:55:18', '1', '2016-10-19 12:55:59', '2016-10-19 13:55:18');
INSERT INTO `apply` VALUES ('630', '3', '235', '549', '对算法分析与设计有一定的掌握和兴趣，希望能深入学习。', '2016-10-19 12:56:24', '234', '对计算思维有了解吗？', '2016-10-19 14:35:49', '1', '2016-10-19 12:56:24', '2016-10-19 14:35:49');
INSERT INTO `apply` VALUES ('631', '3', '562', '658', '老师您好！我是13网络工程3班的学生麦紫茵，学号201330350317。学生之前在专业选修中有学习到物联网的一些基础知识，期中有学习到Zigbee和wifi的一些比较，希望能研究这个课题，谢谢老师！', '2016-10-19 12:57:29', '255', '已入选题目[SQL语言在线测试网站的设计与开发]，该申请无效', '2016-10-19 13:16:28', '1', '2016-10-19 12:57:29', '2016-10-19 13:16:28');
INSERT INTO `apply` VALUES ('632', '3', '514', '570', '1.我是java web方向的，题目符合我的方向\r\n2.题目内容比较丰富，涉及消息发布、人员管理、公共事务管理、财务管理等功能  3.因为是管理系统，所以我会选择easyui+spring+springMVC+hibernate来实现', '2016-10-19 12:59:44', '265', '已入选题目[基于语义网的电子购物网站的设计与实现]，该申请无效', '2016-10-19 16:16:46', '1', '2016-10-19 12:59:44', '2016-10-19 16:16:46');
INSERT INTO `apply` VALUES ('633', '3', '310', '358', '对基于web的兼职分享平台十分感兴趣。', '2016-10-19 12:59:52', '271', '同意', '2016-10-19 13:03:16', '1', '2016-10-19 12:59:52', '2016-10-19 13:03:16');
INSERT INTO `apply` VALUES ('638', '3', '49', '330', '对这个项目感兴趣。', '2016-10-19 13:01:33', '252', null, null, '1', '2016-10-19 13:01:33', '2016-10-19 13:01:33');
INSERT INTO `apply` VALUES ('643', '3', '394', '604', '老师您好，我之前有过一定的开发经验，对java web这一块也很感兴趣，看到老师的题目我很想挑战一下，希望老师批准我申请该题目。', '2016-10-19 13:07:36', '236', null, null, '1', '2016-10-19 13:07:36', '2016-10-19 13:07:36');
INSERT INTO `apply` VALUES ('645', '3', '626', '626', '你好，老师，我是来自13网络工程2班的学生李洛良，在毕业选题系统上我选了基于RTP协议的无线视频传输研究，希望老师可以给我一个机会，让我多学习，顺利完成毕业设计！', '2016-10-19 13:07:44', '255', '你已经入选了该题目，请先学习RTP协议相关知识，过几天我们会集中开会正式启动毕业设计。', '2016-10-19 14:27:45', '1', '2016-10-19 13:07:44', '2016-10-19 14:27:45');
INSERT INTO `apply` VALUES ('648', '3', '348', '626', '你好，老师，我是来自13网络工程2班的学生李洛良，在毕业选题系统上我选了基于SNMP的服务器监控系统，希望老师可以给我一个机会，让我多学习，顺利完成毕业设计！', '2016-10-19 13:09:11', '203', '申请未通过，该题已有同学入选！', '2016-10-19 20:16:40', '1', '2016-10-19 13:09:11', '2016-10-19 20:16:40');
INSERT INTO `apply` VALUES ('653', '3', '43', '634', '老师您好，我对您的这个论文题目很感兴趣。', '2016-10-19 13:12:34', '252', '已入选题目[照片相似性度量方法研究]，该申请无效', '2016-10-19 13:19:37', '1', '2016-10-19 13:12:34', '2016-10-19 13:19:37');
INSERT INTO `apply` VALUES ('656', '3', '797', '609', '有一定的Android开发经验，想从事Android开发', '2016-10-19 13:13:59', '265', '申请未通过，该题已有同学入选！', '2016-10-19 14:40:06', '1', '2016-10-19 13:13:59', '2016-10-19 14:40:06');
INSERT INTO `apply` VALUES ('659', '3', '313', '330', '对这个项目感兴趣', '2016-10-19 13:14:58', '271', '申请未通过，该题已有同学入选！', '2016-10-19 13:55:18', '1', '2016-10-19 13:14:58', '2016-10-19 13:55:18');
INSERT INTO `apply` VALUES ('663', '3', '230', '564', '想要学习物理系统相关。', '2016-10-19 13:16:57', '249', '已入选题目[物体运动轨迹分析研究]，该申请无效', '2016-10-19 13:19:05', '1', '2016-10-19 13:16:57', '2016-10-19 13:19:05');
INSERT INTO `apply` VALUES ('665', '3', '227', '634', '老师你好，我对你的这个论文题目很感兴趣。', '2016-10-19 13:17:29', '249', 'Good.', '2016-10-19 13:19:37', '1', '2016-10-19 13:17:29', '2016-10-19 13:19:37');
INSERT INTO `apply` VALUES ('666', '3', '231', '564', '想要学习物理系统相关。', '2016-10-19 13:17:57', '249', 'Welcome.', '2016-10-19 13:19:05', '1', '2016-10-19 13:17:57', '2016-10-19 13:19:05');
INSERT INTO `apply` VALUES ('667', '3', '315', '315', '校友录app对于学校信息化建设必然能对内促进学生的凝聚力，对外提高学校的声誉，其主要功能可分为系统管理，校友论坛，在线聊天，资源共享等', '2016-10-19 13:18:04', '271', '同意', '2016-10-19 13:52:37', '1', '2016-10-19 13:18:04', '2016-10-19 13:52:37');
INSERT INTO `apply` VALUES ('668', '3', '507', '332', '想更好地学习mapreduce', '2016-10-19 13:18:26', '210', '可以', '2016-10-19 14:39:36', '1', '2016-10-19 13:18:26', '2016-10-19 14:39:36');
INSERT INTO `apply` VALUES ('669', '3', '232', '564', '想要学习交互式运动物体', '2016-10-19 13:19:16', '249', null, null, '1', '2016-10-19 13:19:16', '2016-10-19 13:19:16');
INSERT INTO `apply` VALUES ('670', '3', '321', '649', '二维码包含信息量大，使用方便，应用前景十分广泛，但其也有一些安全问题，解决这些问题意义大。参与二维码安全技术探讨和实践调查，能提高我的水平和认识', '2016-10-19 13:19:42', '246', '已入选题目[试卷自动生成系统]，该申请无效', '2016-10-19 17:13:27', '1', '2016-10-19 13:19:42', '2016-10-19 17:13:27');
INSERT INTO `apply` VALUES ('671', '3', '314', '335', '本人有意愿向web方向发展，目前也在学习html5、css等技术。选择这个题目作为毕业设计，主要是我认为自己可以从中有所收获，对自己今后的发展也有一定帮助。', '2016-10-19 13:19:46', '271', '申请未通过，该题已有同学入选！', '2016-10-19 13:47:33', '1', '2016-10-19 13:19:46', '2016-10-19 13:47:33');
INSERT INTO `apply` VALUES ('672', '3', '589', '357', '我的学习方向是java WEB方向，在大三下学期自学WEB知识以及SSH框架的使用，目前在金蝶软件广州分公司进行实习，我觉得这份题目很适合我，我也一定能做好，希望老师给这个机会给我。', '2016-10-19 13:20:02', '279', '申请未通过，该题已有同学入选！', '2016-10-19 13:58:25', '1', '2016-10-19 13:20:02', '2016-10-19 13:58:25');
INSERT INTO `apply` VALUES ('674', '3', '565', '361', '老师，我对这个题目很感兴趣，也相信自己应该有能力去完成这个题目，希望老师能给我个机会。', '2016-10-19 13:21:40', '247', '你是第一个选这个题目的学生，希望你能认真对待整个毕业设计的过程！', '2016-10-19 15:27:21', '1', '2016-10-19 13:21:40', '2016-10-19 15:27:21');
INSERT INTO `apply` VALUES ('676', '3', '472', '609', '对于Android开发很感兴趣', '2016-10-19 13:22:00', '202', '同意', '2016-10-19 13:50:44', '1', '2016-10-19 13:22:00', '2016-10-19 13:50:44');
INSERT INTO `apply` VALUES ('678', '3', '526', '651', '对这方面挺感兴趣的，希望老师给个机会啊', '2016-10-19 13:23:33', '254', null, null, '1', '2016-10-19 13:23:33', '2016-10-19 13:23:33');
INSERT INTO `apply` VALUES ('680', '3', '240', '658', '老师您好！我是13网络工程3班的学生麦紫茵，学号201330350317。想选择您的校友管理网站的设计与实现作为毕业论文的题目，谢谢老师！', '2016-10-19 13:24:37', '234', '申请未通过，该题已有同学入选！', '2016-10-19 14:31:44', '1', '2016-10-19 13:24:37', '2016-10-19 14:31:44');
INSERT INTO `apply` VALUES ('683', '3', '516', '320', '我现在向Java web方向发展，目前也做过一两个web项目，选择这个课题，有助于我以后的学习和发展。', '2016-10-19 13:26:23', '220', '申请未通过，该题已有同学入选！', '2016-10-19 15:05:31', '1', '2016-10-19 13:26:23', '2016-10-19 15:05:31');
INSERT INTO `apply` VALUES ('685', '3', '314', '320', '我现在向Java web方向发展，目前也做过一两个web项目，选择这个课题，有助于我以后的学习和发展。', '2016-10-19 13:30:36', '271', '申请未通过，该题已有同学入选！', '2016-10-19 13:47:33', '1', '2016-10-19 13:30:36', '2016-10-19 13:47:33');
INSERT INTO `apply` VALUES ('687', '3', '793', '570', '1.对微信公众号开发比较感兴趣 2.觉得涉及到的内容很有实际价值，因为现在基于微信的开发很多，这些功能都很常见', '2016-10-19 13:32:30', '265', '已入选题目[基于语义网的电子购物网站的设计与实现]，该申请无效', '2016-10-19 16:16:46', '1', '2016-10-19 13:32:30', '2016-10-19 16:16:46');
INSERT INTO `apply` VALUES ('689', '3', '758', '651', '对这方面比较好兴趣，请老师给个机会啊。', '2016-10-19 13:33:34', '211', '申请未通过，该题已有同学入选！', '2016-10-19 16:21:08', '1', '2016-10-19 13:33:34', '2016-10-19 16:21:08');
INSERT INTO `apply` VALUES ('690', '3', '319', '597', '对Python很感兴趣，希望通过这个毕业设计深入学习一下', '2016-10-19 13:34:21', '246', '可以。', '2016-10-19 14:05:32', '1', '2016-10-19 13:34:21', '2016-10-19 14:05:32');
INSERT INTO `apply` VALUES ('692', '3', '396', '667', '首先本人热衷java编程与应用开发，并且向java开发方向发展。其次，每一年都有大量的企业校园招聘或社招，企业新员工都需要进行人才培训和考核，还有一些专门的人才培养机构，所以还是具有很大的市场空间。这对企业方还是培养方都能带来比较大的利益。最后，对于本次课题，主要包括人才培养的模块化设计，以及考核系统的前端和数据库设计。', '2016-10-19 13:36:37', '236', null, null, '1', '2016-10-19 13:36:37', '2016-10-19 13:36:37');
INSERT INTO `apply` VALUES ('693', '3', '314', '595', '个人发展方向为web前端，有信心能做好这个系统。望老师审核通过', '2016-10-19 13:37:53', '271', '申请未通过，该题已有同学入选！', '2016-10-19 13:47:33', '1', '2016-10-19 13:37:53', '2016-10-19 13:47:33');
INSERT INTO `apply` VALUES ('694', '3', '502', '495', '我自己学习和研究的方向刚好跟微信开发相关的web前端方向，之前也在学院工作室参与了一些项目的开发，很希望能够在毕业设计上进一步应用和研究。恳请老师您做我毕业设计的导师，', '2016-10-19 13:39:19', '210', '申请未通过，该题已有同学入选！', '2016-10-19 15:00:27', '1', '2016-10-19 13:39:19', '2016-10-19 15:00:27');
INSERT INTO `apply` VALUES ('695', '3', '355', '316', '基于安卓开发一个个人记账管理软件，记录每天各方面收支情况，可统计和查看', '2016-10-19 13:45:09', '203', '申请未通过，该题已有同学入选！', '2016-10-19 20:44:01', '1', '2016-10-19 13:45:09', '2016-10-19 20:44:01');
INSERT INTO `apply` VALUES ('697', '3', '269', '324', '对于来电管理，客户可以直接在系统上选择附加的司机进行代驾预约，或者司机在系统上接收预约订单，拨打客户的电话。对于订单管理，有代驾类型，例如：酒后代驾、商务代驾、长途代驾、包车代驾等等，费用根据代驾的时长和路程计算得出。对于客户管理，客户需要登记个人信息，手机验证等等。对于信誉管理，在订单完成后，司机与客户双方可以互相评价。希望老师给个机会！谢谢老师', '2016-10-19 13:45:54', '237', 'ok', '2016-10-19 16:17:10', '1', '2016-10-19 13:45:54', '2016-10-19 16:17:10');
INSERT INTO `apply` VALUES ('699', '3', '519', '455', '老师，您好。我对Java充满热爱，了解JavaWeb，也曾经做过关于JavaWeb的开发。我有信心做好。', '2016-10-19 13:50:33', '254', '已入选题目[基于微信的校友管理系统设计与实现]，该申请无效', '2016-10-19 15:00:27', '1', '2016-10-19 13:50:33', '2016-10-19 15:00:27');
INSERT INTO `apply` VALUES ('700', '3', '482', '657', '老师，我曾上过你的算法课，觉得受益匪浅。现我在CVTE公司做无线传屏项目，与本论文题目有类似之处，相信自己有信心能做好这个毕业设计，希望得到老师的指导！', '2016-10-19 13:55:01', '231', '你如果要做类似的，可以自主命题，但你得选我的“自主命题”的题目，我指定你了后再商议具体的题目，也可以用你公司的项目题来做。', '2016-10-19 17:36:37', '1', '2016-10-19 13:55:01', '2016-10-19 17:36:37');
INSERT INTO `apply` VALUES ('704', '3', '730', '337', '有hadoop基础以及linux基础，对这个有兴趣', '2016-10-19 13:56:18', '242', 'OK', '2016-10-19 14:10:17', '1', '2016-10-19 13:56:18', '2016-10-19 14:10:17');
INSERT INTO `apply` VALUES ('705', '3', '768', '598', '本人做过网站开发，对前端那块知识掌握比较多，目前在一家公司里也是做微信相关的开发，希望能申请到这个题目。', '2016-10-19 13:57:05', '207', '同意', '2016-10-19 14:24:30', '1', '2016-10-19 13:57:05', '2016-10-19 14:24:30');
INSERT INTO `apply` VALUES ('710', '3', '482', '342', '对手机可以用网络控制计算机操作之类的感兴趣。同时该题目有很强的操作性，开发的应用有实用性和便利性。', '2016-10-19 14:03:28', '231', '同意', '2016-10-19 17:25:33', '1', '2016-10-19 14:03:28', '2016-10-19 17:25:33');
INSERT INTO `apply` VALUES ('711', '3', '549', '661', '有意愿对该课题进行钻研', '2016-10-19 14:03:51', '266', '可以。', '2016-10-19 16:25:36', '1', '2016-10-19 14:03:51', '2016-10-19 16:25:36');
INSERT INTO `apply` VALUES ('713', '3', '390', '343', '老师您好，我是13计机3邓水凤，想选这个题，不知道可行不？', '2016-10-19 14:03:57', '236', null, null, '1', '2016-10-19 14:03:57', '2016-10-19 14:03:57');
INSERT INTO `apply` VALUES ('714', '3', '748', '309', '互联网的巨大增长，导致大多数企业拥有自己的网站，所以占用更多的访问竞争加剧和好奇心，知道它是如何影响消费者的是，让我选一个主题', '2016-10-19 14:06:46', '211', '对不起啊，已经有学生申请到了。', '2016-10-19 16:22:04', '1', '2016-10-19 14:06:46', '2016-10-19 16:22:04');
INSERT INTO `apply` VALUES ('715', '3', '748', '579', '我觉得我对这个题目十分感兴趣，我很想深入了解关于营销的知识，觉得这个题目跟自己很合适，然后我一个舍友也选了您的题目。', '2016-10-19 14:08:02', '211', '申请未通过，该题已有同学入选！', '2016-10-19 16:22:04', '1', '2016-10-19 14:08:02', '2016-10-19 16:22:04');
INSERT INTO `apply` VALUES ('716', '3', '565', '455', '老师，您好。我热爱Java，对Java技术有比较好的了解。', '2016-10-19 14:08:05', '247', '申请未通过，该题已有同学入选！', '2016-10-19 15:27:21', '1', '2016-10-19 14:08:05', '2016-10-19 15:27:21');
INSERT INTO `apply` VALUES ('717', '3', '49', '322', '熟悉JavaWeb开发和Mysql数据库', '2016-10-19 14:10:01', '252', null, null, '1', '2016-10-19 14:10:01', '2016-10-19 14:10:01');
INSERT INTO `apply` VALUES ('718', '3', '476', '406', '老师，抱歉，我忘了一申请了另一个题目了，不过我刚刚删除申请了，现在可以入选你出的题目了吗？', '2016-10-19 14:12:21', '231', '同意你的自主命题，但现在无法指定你啊。', '2016-10-19 17:24:16', '1', '2016-10-19 14:12:21', '2016-10-19 17:24:16');
INSERT INTO `apply` VALUES ('719', '3', '380', '466', '13级的本科生即将拍毕业照了，想通过这个分享系统，增添一些拍照乐趣。', '2016-10-19 14:12:35', '212', '试一下。不错', '2016-10-19 14:45:38', '1', '2016-10-19 14:12:35', '2016-10-19 14:45:38');
INSERT INTO `apply` VALUES ('721', '3', '269', '555', '代驾是目前很有实际意义的，所以想选这个题目', '2016-10-19 14:17:16', '237', '申请未通过，该题已有同学入选！', '2016-10-19 16:17:10', '1', '2016-10-19 14:17:16', '2016-10-19 16:17:10');
INSERT INTO `apply` VALUES ('722', '3', '519', '322', '熟悉JavaWeb开发。曾担任信息委员，对教学质量评价的需求有一定的了解。', '2016-10-19 14:17:57', '254', null, null, '1', '2016-10-19 14:17:57', '2016-10-19 14:17:57');
INSERT INTO `apply` VALUES ('723', '3', '602', '659', '在综合测评的过程中，很重要的一个环节就是提交加分材料以及对材料进行审核。综合测评系统可以针对综合测评的每个阶段，设置一套流程，实现材料的电子化提交，可以省去每年提交大量的材料。 本人在校成绩良好，曾学过jsp，html，servlet，ssh框架等javaweb开发的技能，相信我有能力能完成这个题目。', '2016-10-19 14:18:16', '228', '好的', '2016-10-19 14:24:32', '1', '2016-10-19 14:18:16', '2016-10-19 14:24:32');
INSERT INTO `apply` VALUES ('724', '3', '827', '454', 'Java熟悉度良好，并希望毕业后向此方向发展。', '2016-10-19 14:18:31', '223', '已入选题目[基于用户的电影推荐系统设计与实现]，该申请无效', '2016-10-19 21:46:13', '1', '2016-10-19 14:18:31', '2016-10-19 21:46:13');
INSERT INTO `apply` VALUES ('725', '3', '519', '330', '对这个项目感兴趣，想尝试一下', '2016-10-19 14:18:32', '254', null, null, '1', '2016-10-19 14:18:32', '2016-10-19 14:18:32');
INSERT INTO `apply` VALUES ('728', '3', '520', '423', '需求分析：1、管理员部分：登录，开关机房，管理所有电脑上机情况，浏览正在上机的用户...   \r\n2、用户部分：注册登录，上机下机，查看上机时长和收费情况...\r\n更多功能等做的时候再详细拓展', '2016-10-19 14:22:43', '254', '已入选题目[论文投稿系统的设计与实现]，该申请无效', '2016-10-19 15:36:51', '1', '2016-10-19 14:22:43', '2016-10-19 15:36:51');
INSERT INTO `apply` VALUES ('729', '3', '508', '454', 'Java熟练度良好，并希望毕业后Java后台方向发展，谢谢。', '2016-10-19 14:23:30', '210', '可以', '2016-10-19 14:38:47', '1', '2016-10-19 14:23:30', '2016-10-19 14:38:47');
INSERT INTO `apply` VALUES ('730', '3', '514', '651', '比较倾向于这个方面的工作，请老师给个机会', '2016-10-19 14:24:34', '265', null, null, '1', '2016-10-19 14:24:34', '2016-10-19 14:24:34');
INSERT INTO `apply` VALUES ('731', '3', '354', '561', '个人比较想走web开发方向，希望能得邢老师的指导，更进一步学习到这一方面的东西。', '2016-10-19 14:24:40', '203', '申请未通过，该题已有同学入选！', '2016-10-19 20:36:44', '1', '2016-10-19 14:24:40', '2016-10-19 20:36:44');
INSERT INTO `apply` VALUES ('733', '3', '50', '596', '开发语言用C#,数据库用MySql。希望得到您的指导', '2016-10-19 14:28:14', '252', '已确认', '2016-10-19 16:41:06', '1', '2016-10-19 14:28:14', '2016-10-19 16:41:06');
INSERT INTO `apply` VALUES ('736', '3', '636', '455', '老师，您好。我对JavaWeb有了解，有做过JavaWeb。', '2016-10-19 14:32:24', '253', '申请未通过，该题已有同学入选！', '2016-10-19 20:11:09', '1', '2016-10-19 14:32:24', '2016-10-19 20:11:09');
INSERT INTO `apply` VALUES ('737', '3', '377', '806', '毕业设计', '2016-10-19 14:32:33', '212', '好的', '2016-10-19 14:46:08', '1', '2016-10-19 14:32:33', '2016-10-19 14:46:08');
INSERT INTO `apply` VALUES ('738', '3', '377', '814', '毕业设计', '2016-10-19 14:33:32', '212', '已入选题目[智慧教室1]，该申请无效', '2016-10-19 15:11:06', '1', '2016-10-19 14:33:32', '2016-10-19 15:11:06');
INSERT INTO `apply` VALUES ('739', '3', '697', '670', '因为我现在在公司做的是有关于大数据分析那方面的，用的是spark，所以会有经验，我觉得这个题目最后可以分析出如学生按每天时间的上网行为，按学生群体分析等，最后分析出的结果系统直接可以用图表等形式呈现给我们。', '2016-10-19 14:35:47', '261', '已入选题目[车位共享系统的设计与实现]，该申请无效', '2016-10-19 16:26:26', '1', '2016-10-19 14:35:47', '2016-10-19 16:26:26');
INSERT INTO `apply` VALUES ('742', '3', '235', '574', '喜欢做算法与设计的研究，一直在学习算法', '2016-10-19 14:37:01', '234', '已入选题目[照片对称区域的匹配算法]，该申请无效', '2016-10-19 16:42:16', '1', '2016-10-19 14:37:01', '2016-10-19 16:42:16');
INSERT INTO `apply` VALUES ('743', '3', '388', '670', '因为我本人现在在公司实习，工作是有关于大数据方面，也是用到spark，然后是用spark进行对通信指标的分析，挖掘等，可以将本论文与实际结合起来。', '2016-10-19 14:38:45', '236', '已入选题目[车位共享系统的设计与实现]，该申请无效', '2016-10-19 16:26:26', '1', '2016-10-19 14:38:45', '2016-10-19 16:26:26');
INSERT INTO `apply` VALUES ('744', '3', '389', '670', '因为我本人现在在公司实习，工作是有关于大数据方面，也是用到spark，然后是用spark进行对通信指标的分析，挖掘等，可以将本论文与实际结合起来。', '2016-10-19 14:39:01', '236', '已入选题目[车位共享系统的设计与实现]，该申请无效', '2016-10-19 16:26:26', '1', '2016-10-19 14:39:01', '2016-10-19 16:26:26');
INSERT INTO `apply` VALUES ('745', '3', '794', '574', '喜欢算法与设计并一直在学习该门课程', '2016-10-19 14:39:09', '265', '已入选题目[照片对称区域的匹配算法]，该申请无效', '2016-10-19 16:42:16', '1', '2016-10-19 14:39:09', '2016-10-19 16:42:16');
INSERT INTO `apply` VALUES ('746', '3', '290', '561', '个人对Android下游戏开发较为感兴趣，希望能得张老师的指导，更进一步学习到这一方面的东西。', '2016-10-19 14:39:40', '237', '已入选题目[校园易物app开发]，该申请无效', '2016-10-19 15:35:47', '1', '2016-10-19 14:39:40', '2016-10-19 15:35:47');
INSERT INTO `apply` VALUES ('747', '3', '50', '330', '对该课题感兴趣。', '2016-10-19 14:43:00', '252', '申请未通过，该题已有同学入选！', '2016-10-19 16:41:06', '1', '2016-10-19 14:43:00', '2016-10-19 16:41:06');
INSERT INTO `apply` VALUES ('748', '3', '354', '603', '前端是我的发展方向，但是我并没有多少前端的经验，都是在自学，然后做百度前端技术网站给出的题目，希望这个项目，能给我一些实战经验，希望通过', '2016-10-19 14:44:20', '203', '申请未通过，该题已有同学入选！', '2016-10-19 20:36:44', '1', '2016-10-19 14:44:20', '2016-10-19 20:36:44');
INSERT INTO `apply` VALUES ('750', '3', '226', '574', '喜欢算法与设计并一直在学习研究', '2016-10-19 14:47:06', '249', 'Welcome.', '2016-10-19 16:42:16', '1', '2016-10-19 14:47:06', '2016-10-19 16:42:16');
INSERT INTO `apply` VALUES ('751', '3', '375', '814', 'biye', '2016-10-19 14:47:14', '212', '好的', '2016-10-19 15:11:06', '1', '2016-10-19 14:47:14', '2016-10-19 15:11:06');
INSERT INTO `apply` VALUES ('753', '3', '49', '320', '我现在向Java web方向发展，目前也做过一两个web项目，选择这个课题，有助于我以后的学习和发展。', '2016-10-19 14:47:29', '252', null, null, '1', '2016-10-19 14:47:29', '2016-10-19 14:47:29');
INSERT INTO `apply` VALUES ('754', '3', '49', '335', '通过科研项目管理系统能够记录和管理科研项目的进程等信息，在使用系统之初需对系统进行登录，以便确保系统的安全。采用B/S结构可以将该系统划分为三个层次：用户界面层，功能逻辑层，数据访问层。', '2016-10-19 14:47:32', '252', null, null, '1', '2016-10-19 14:47:32', '2016-10-19 14:47:32');
INSERT INTO `apply` VALUES ('755', '3', '526', '291', '因为喜欢研究一些算法，之前就对文件、图片这些的压缩解压缩算法比较感兴趣，就业方向选的也是Java，觉得自己有信心而且有热情可以完成这个题，所以希望能做这个题目。', '2016-10-19 14:47:57', '254', '已入选题目[基于WEB的小型教学辅助系统的研究与开发]，该申请无效', '2016-10-19 20:36:44', '1', '2016-10-19 14:47:57', '2016-10-19 20:36:44');
INSERT INTO `apply` VALUES ('756', '3', '354', '291', '对Web开发比较感兴趣，现在在做的实习也有Web前端的，跟我的就业方向有关，所以想做这种类型的设计！希望能做这个题。', '2016-10-19 14:49:39', '203', 'OK！', '2016-10-19 20:36:44', '1', '2016-10-19 14:49:39', '2016-10-19 20:36:44');
INSERT INTO `apply` VALUES ('762', '3', '502', '455', '老师，您好。本人热爱Java，毕业之后也会往Java方向发展。', '2016-10-19 14:54:25', '210', '可以', '2016-10-19 15:00:27', '1', '2016-10-19 14:54:25', '2016-10-19 15:00:27');
INSERT INTO `apply` VALUES ('764', '3', '516', '561', '个人对spark较为感兴趣，希望能得刘老师的指导，更进一步学习到这一方面的东西。', '2016-10-19 14:56:55', '220', '已入选题目[校园易物app开发]，该申请无效', '2016-10-19 15:35:47', '1', '2016-10-19 14:56:55', '2016-10-19 15:35:47');
INSERT INTO `apply` VALUES ('765', '3', '697', '548', '本人对大数据感兴趣', '2016-10-19 14:57:16', '261', '已入选题目[基于AI的游戏软件研究与实现]，该申请无效', '2016-10-19 15:20:17', '1', '2016-10-19 14:57:16', '2016-10-19 15:20:17');
INSERT INTO `apply` VALUES ('768', '3', '237', '548', '本人对人工智能感兴趣，具备C和Java基础，喜欢编程', '2016-10-19 15:00:16', '234', '要先准备相关材料。', '2016-10-19 15:20:17', '1', '2016-10-19 15:00:16', '2016-10-19 15:20:17');
INSERT INTO `apply` VALUES ('769', '3', '610', '489', '个人对分布式相关知识十分感兴趣，特别是分布式服务器架构的分析设计以及实现，自己目前有在学习微服务架构，分布式缓存，以及分布式数据库相关知识，希望可以通过这次题目的研究加强自己在这方面的能力', '2016-10-19 15:01:09', '261', null, null, '1', '2016-10-19 15:01:09', '2016-10-19 15:01:09');
INSERT INTO `apply` VALUES ('770', '3', '348', '654', '你好，老师，我是来自13网络工程3班林卓帆，在毕业选题系统上我选了基于SNMP的服务器监控系统，希望老师可以给我一个机会，让我多学习，顺利完成毕业设计！', '2016-10-19 15:02:13', '203', '申请未通过，该题已有同学入选！', '2016-10-19 20:16:40', '1', '2016-10-19 15:02:13', '2016-10-19 20:16:40');
INSERT INTO `apply` VALUES ('771', '3', '827', '557', '上网查了下茶叶溯源，通过一串编码能清晰了解商品从产地到客户手里中的流程。\r\n感觉跟快递一样，每一个经手人员和经过地方有一行数据，每接触一个打上这样数据。', '2016-10-19 15:03:25', '223', '已入选题目[学生在线考试系统的设计与实现]，该申请无效', '2016-10-19 21:46:09', '1', '2016-10-19 15:03:25', '2016-10-19 21:46:09');
INSERT INTO `apply` VALUES ('772', '3', '745', '363', '以.Net framework框架为主要基础，实现基于C#程序设计语言的GUI编辑部信息管理系统。后台数据采用Sql Server进行有效存储。', '2016-10-19 15:06:10', '211', '如果没有清考科目，并且能独立完成的话，发学号，姓名，手机短号或者长号，常用邮箱到我的邮箱啊。', '2016-10-19 16:26:17', '1', '2016-10-19 15:06:10', '2016-10-19 16:26:17');
INSERT INTO `apply` VALUES ('774', '3', '506', '654', '老师，您好。我是2013级网络工程3班的林卓帆同学。我想选您的课题——BCH算法研究与仿真。\r\n我对这个课题比较感兴趣，希望您能给我一会机会，让我顺利完成毕业论文。谢谢！', '2016-10-19 15:11:20', '255', '确定将该题给你作为毕业设计题目，请先学习BCH算法，过几天将集中开会讨论毕业设计事宜，请保持手机畅通。', '2016-10-19 15:19:37', '1', '2016-10-19 15:11:20', '2016-10-19 15:19:37');
INSERT INTO `apply` VALUES ('778', '3', '588', '423', '对web方向比较感兴趣', '2016-10-19 15:17:15', '279', '收到，近期会组织大家见面讨论', '2016-10-19 15:36:51', '1', '2016-10-19 15:17:15', '2016-10-19 15:36:51');
INSERT INTO `apply` VALUES ('780', '3', '401', '608', '', '2016-10-19 15:21:05', '236', '已入选题目[校园小黄车的智能平台研究]，该申请无效', '2016-10-19 16:12:07', '1', '2016-10-19 15:21:05', '2016-10-19 16:12:07');
INSERT INTO `apply` VALUES ('782', '3', '381', '608', '', '2016-10-19 15:23:11', '212', 'OK', '2016-10-19 16:12:07', '1', '2016-10-19 15:23:11', '2016-10-19 16:12:07');
INSERT INTO `apply` VALUES ('783', '3', '473', '608', '', '2016-10-19 15:25:39', '202', '已入选题目[校园小黄车的智能平台研究]，该申请无效', '2016-10-19 16:12:07', '1', '2016-10-19 15:25:39', '2016-10-19 16:12:07');
INSERT INTO `apply` VALUES ('786', '3', '558', '670', '因为我之前课设有做过处理GIS数据，然后使用地图进行轨迹描划；而且现在在公司有做过使用Mapwingis进行二次开发，有过相关的gis处理经验。本毕设我觉得可以连接到网络的时候可以调用地图api，没有网络的时候可以使用Mapwingis。', '2016-10-19 15:29:49', '266', '可以。', '2016-10-19 16:26:26', '1', '2016-10-19 15:29:49', '2016-10-19 16:26:26');
INSERT INTO `apply` VALUES ('789', '3', '833', '561', '个人对app开发较为感兴趣，希望能得李老师的指导，更进一步学习到这一方面的东西。', '2016-10-19 15:31:33', '864', '同意', '2016-10-19 15:35:47', '1', '2016-10-19 15:31:33', '2016-10-19 15:35:47');
INSERT INTO `apply` VALUES ('794', '3', '837', '483', '不知道是不是可以用html5实现', '2016-10-19 15:35:19', '864', '可以', '2016-10-19 15:38:08', '1', '2016-10-19 15:35:19', '2016-10-19 15:38:08');
INSERT INTO `apply` VALUES ('795', '3', '746', '441', '基于Web编写一个旅游线路管理系统，可以查询景点的具体信息，根据旅游者的兴趣需求推荐旅游景点并提供可行的旅游线路。', '2016-10-19 15:37:23', '211', null, null, '1', '2016-10-19 15:37:23', '2016-10-19 15:37:23');
INSERT INTO `apply` VALUES ('796', '3', '816', '600', '老师,我具备C#，java，C编程基础，Mysql数据库基础，希望能到您的指导，谢谢。', '2016-10-19 15:38:57', '219', '同意。', '2016-10-19 18:45:53', '1', '2016-10-19 15:38:57', '2016-10-19 18:45:53');
INSERT INTO `apply` VALUES ('800', '3', '845', '547', '想做个javaweb网站', '2016-10-19 15:41:30', '862', null, null, '1', '2016-10-19 15:41:30', '2016-10-19 15:41:30');
INSERT INTO `apply` VALUES ('802', '3', '845', '417', '对该题目有大致方向，做过类似系统，请老师允许', '2016-10-19 15:45:22', '862', '已入选题目[小型就业管理信息系统的设计与实现]，该申请无效', '2016-10-19 16:32:40', '1', '2016-10-19 15:45:22', '2016-10-19 16:32:40');
INSERT INTO `apply` VALUES ('805', '3', '839', '417', '做过类似系统，有大致方向', '2016-10-19 15:49:24', '862', '已入选题目[小型就业管理信息系统的设计与实现]，该申请无效', '2016-10-19 16:32:40', '1', '2016-10-19 15:49:24', '2016-10-19 16:32:40');
INSERT INTO `apply` VALUES ('808', '3', '290', '565', '想要从事游戏开发行业，学习游戏制作', '2016-10-19 15:50:26', '237', null, null, '1', '2016-10-19 15:50:26', '2016-10-19 15:50:26');
INSERT INTO `apply` VALUES ('809', '3', '835', '417', '做过类似的题目，能胜任这个题目', '2016-10-19 15:51:33', '238', '同意', '2016-10-19 16:32:40', '1', '2016-10-19 15:51:33', '2016-10-19 16:32:40');
INSERT INTO `apply` VALUES ('810', '3', '850', '373', '对这个题目很感兴趣', '2016-10-19 15:52:25', '862', null, null, '1', '2016-10-19 15:52:25', '2016-10-19 15:52:25');
INSERT INTO `apply` VALUES ('811', '3', '41', '372', '对此题目有兴趣，也有一定的安卓基础知识。', '2016-10-19 15:53:37', '252', '要求：通过Android系统的手机摄像头获取图像，通过wifi局域网上传图像至计算机服务器', '2016-10-19 16:34:54', '1', '2016-10-19 15:53:37', '2016-10-19 16:34:54');
INSERT INTO `apply` VALUES ('812', '3', '839', '547', '想做个javaweb网站', '2016-10-19 15:54:00', '862', null, null, '1', '2016-10-19 15:54:00', '2016-10-19 15:54:00');
INSERT INTO `apply` VALUES ('813', '3', '838', '429', '对这方面的设计开发比较感兴趣', '2016-10-19 15:54:50', '864', '同意', '2016-10-19 16:07:45', '1', '2016-10-19 15:54:50', '2016-10-19 16:07:45');
INSERT INTO `apply` VALUES ('814', '3', '845', '565', '希望能跟老师学习', '2016-10-19 15:55:22', '862', null, null, '1', '2016-10-19 15:55:22', '2016-10-19 15:55:22');
INSERT INTO `apply` VALUES ('815', '3', '845', '599', '', '2016-10-19 15:55:59', '862', null, null, '1', '2016-10-19 15:55:59', '2016-10-19 15:55:59');
INSERT INTO `apply` VALUES ('816', '2', '345', '174', '因为我将来工作的意向是营销策划，所以我很喜欢【互联网思维下品牌营销的应用】，之前的一段时间我也看了很多书籍，包括科特勒的【营销管理】，【互联网营销】，【营销实战】，【020营销宝典】等等。所以我有信心在营销的论文上做得优秀，希望刘老师能给一个机会，谢谢刘老师', '2016-10-19 15:56:01', '11', null, null, '1', '2016-10-19 15:56:01', '2016-10-19 15:56:01');
INSERT INTO `apply` VALUES ('817', '3', '848', '570', '1.对java web 开发比较熟悉  2.对购物网站比较有兴趣  3.百度了一下语义网，对它的概念还不清楚', '2016-10-19 15:56:42', '245', '接收', '2016-10-19 16:16:46', '1', '2016-10-19 15:56:42', '2016-10-19 16:16:46');
INSERT INTO `apply` VALUES ('818', '3', '850', '606', '', '2016-10-19 15:59:15', '862', null, null, '1', '2016-10-19 15:59:15', '2016-10-19 15:59:15');
INSERT INTO `apply` VALUES ('820', '3', '850', '640', '老师你好，我对您的这个题目很感兴趣与此同时急切的希望您能同意我的申请。对于一个企业来说，对于企业的健康发展，员工的工资管理是非常重要的。而传统的人工管理方案，浪费l大量的人力物力。电子化的实现将会对极大地提高企业管理效益。我对您的这个课题很感兴趣，因为曾做过Java的点名系统，对Java较为熟悉，故我会采用Java实现这个系统，希望·您能给我一个机会，谢谢', '2016-10-19 16:01:15', '862', null, null, '1', '2016-10-19 16:01:15', '2016-10-19 16:09:33');
INSERT INTO `apply` VALUES ('821', '3', '845', '640', '拥有一个电子化的旅馆管理系统将极大解放柜台人员，同时对旅馆的经营情况能有一个快速、准确、实时的掌握。鉴于我对Java比较熟悉，我会用Java完成这个毕业设计，当然·，我现在急切的希望老师能给一个机会，谢谢', '2016-10-19 16:05:37', '862', null, null, '1', '2016-10-19 16:05:37', '2016-10-19 16:07:12');
INSERT INTO `apply` VALUES ('822', '3', '845', '429', '对这方面的设计开发比较感兴趣', '2016-10-19 16:06:43', '862', '已入选题目[钓鱼爱好者app开发]，该申请无效', '2016-10-19 16:07:45', '1', '2016-10-19 16:06:43', '2016-10-19 16:07:45');
INSERT INTO `apply` VALUES ('824', '3', '832', '570', '对java web开发比较熟悉，正在学习ssh框架，所以很希望可以选择这方面的题目，在实践中提高自己。', '2016-10-19 16:09:44', '238', '已入选题目[基于语义网的电子购物网站的设计与实现]，该申请无效', '2016-10-19 16:16:46', '1', '2016-10-19 16:09:44', '2016-10-19 16:16:46');
INSERT INTO `apply` VALUES ('825', '3', '839', '596', '开发语言用C#，数据库用SQL Server 。希望得到老师的指导', '2016-10-19 16:10:02', '862', '已入选题目[集约化项目经费额度控制系统]，该申请无效', '2016-10-19 16:41:06', '1', '2016-10-19 16:10:02', '2016-10-19 16:41:06');
INSERT INTO `apply` VALUES ('826', '3', '843', '553', '201330330325 温宇恒 电话18814127587', '2016-10-19 16:15:15', '245', '接收', '2016-10-19 16:16:55', '1', '2016-10-19 16:15:15', '2016-10-19 16:16:55');
INSERT INTO `apply` VALUES ('827', '3', '856', '555', '软工3班 袁洁羔 18814127660（669391）  201330330327', '2016-10-19 16:15:30', '245', '接受', '2016-10-19 16:16:26', '1', '2016-10-19 16:15:30', '2016-10-19 16:16:26');
INSERT INTO `apply` VALUES ('828', '3', '853', '628', '1.对于网站建设具有浓厚兴趣；\r\n2.曾经做过类似的项目。', '2016-10-19 16:16:46', '862', null, null, '1', '2016-10-19 16:16:46', '2016-10-19 16:16:46');
INSERT INTO `apply` VALUES ('829', '3', '551', '331', '有这方面的兴趣。\r\n想法：搭建服务器，做个客户端(时间够再做个网页端)并实现基础邮件功能，实现加密', '2016-10-19 16:19:19', '266', '可以。', '2016-10-19 16:25:50', '1', '2016-10-19 16:19:19', '2016-10-19 16:25:50');
INSERT INTO `apply` VALUES ('830', '3', '839', '613', '王老师，您好\r\n我是13级网络工程1班的张智超，我有web开发的经验，可以独立的开发web平台，对于老师的这个课题也很有兴趣，希望可以跟着老师学习', '2016-10-19 16:20:14', '862', null, null, '1', '2016-10-19 16:20:14', '2016-10-19 16:20:14');
INSERT INTO `apply` VALUES ('831', '3', '845', '600', '我对这系统有感兴趣的，希望可以得到老师的指导。我打算用.NET（C#）开发环境，数据库用MySQL。', '2016-10-19 16:22:19', '862', '已入选题目[网站数字验证码识别技术的研究]，该申请无效', '2016-10-19 18:45:53', '1', '2016-10-19 16:22:19', '2016-10-19 18:45:53');
INSERT INTO `apply` VALUES ('832', '3', '853', '613', '王老师，您好我是13级网络工程1班的张智超，我有web开发的经验，可以独立的开发web平台，对于老师的这个课题也很有兴趣，希望可以跟着老师学习', '2016-10-19 16:23:12', '862', null, null, '1', '2016-10-19 16:23:12', '2016-10-19 16:23:12');
INSERT INTO `apply` VALUES ('833', '3', '526', '282', '只会用Java语言', '2016-10-19 16:26:51', '254', null, null, '1', '2016-10-19 16:26:51', '2016-10-19 16:26:51');
INSERT INTO `apply` VALUES ('834', '2', '831', '189', '会使用JAVA语言，希望尝试一下。', '2016-10-19 16:27:59', '18', '同意选题。', '2016-10-19 18:32:48', '1', '2016-10-19 16:27:59', '2016-10-19 18:32:48');
INSERT INTO `apply` VALUES ('835', '3', '548', '289', '老师您好，我是13级计机1班的黄嘉威。\r\n对這个题目产生兴趣的最大原因之一是我所在实习的公司-广州越秀金融科技有限公司刚好也有一个创新项目是在区块链领域与银行系统未来发展模式的的研究。因此我也了解和关注了区块链的相关信息。　去中心化、开放性、自治性、信息不可篡改、匿名性等特征体现了区块链在信息安方面的重大机遇，也是互联网未来发展的趋势。\r\n看到老师的這个论文题目，我也是很激动，希望能选到這个题目。借着這个契机对区块链进行更深一步的学习和研究。\r\n对于论题的想法:由于我的开发方向是JavaWeb,有过几个web项目经验，所以系统的前端页面设计方面我将采用web技术。而系统的通信协议及数据存储方面采用区块链技术。更详细更深一步的项目设计需要自己接下来花更多时间去研究却学习一步一步开展起来。\r\n因此，希望能选到老师的這个论题，也希望老师多多指教。如果能选到這个题目，学生必将加倍努力，钻研学习，最终完成项目。谢谢。', '2016-10-19 16:30:04', '266', '可以。', '2016-10-19 16:34:34', '1', '2016-10-19 16:30:04', '2016-10-19 16:34:34');
INSERT INTO `apply` VALUES ('837', '2', '345', '170', '互联网思维重构了企业的产生价值的活动，例如运用电子商务拓宽了企业的销售渠道，运用大数据收集用户的需求及其他信息，运用云计算提高了企业信息化进程等等。以上是我对互联网思维下价值链重构的理解，我希望能通过这个课题，深入的了解互联网对价值链的冲击与改造以及如何重构传统的企业价值链、', '2016-10-19 16:35:25', '11', null, null, '1', '2016-10-19 16:35:25', '2016-10-19 16:35:25');
INSERT INTO `apply` VALUES ('839', '3', '763', '649', '以前经常会使用答题小软件，想尝试一下做试卷自动生成系统，提高自己的水平和认识。', '2016-10-19 16:36:56', '211', '好。你晚点可以在选题系统上看到任务书。', '2016-10-19 17:13:27', '1', '2016-10-19 16:36:56', '2016-10-19 21:19:59');
INSERT INTO `apply` VALUES ('840', '3', '845', '280', '对旅馆登记结账等流程有一定了解，相较于其他系统，对旅馆业务流程较为熟悉', '2016-10-19 16:37:58', '862', null, null, '1', '2016-10-19 16:37:58', '2016-10-19 16:37:58');
INSERT INTO `apply` VALUES ('842', '3', '840', '552', '201330330324 王开轩', '2016-10-19 16:39:43', '245', '接收', '2016-10-19 16:43:02', '1', '2016-10-19 16:39:43', '2016-10-19 16:43:02');
INSERT INTO `apply` VALUES ('843', '3', '600', '327', '我是林雅琪，谢谢老师。', '2016-10-19 16:46:08', '228', '好的', '2016-10-19 16:51:55', '1', '2016-10-19 16:46:08', '2016-10-19 16:51:55');
INSERT INTO `apply` VALUES ('844', '3', '850', '322', '熟悉JavaWeb和Mysql数据库，有相似系统的编写经验。', '2016-10-19 16:47:24', '862', null, null, '1', '2016-10-19 16:47:24', '2016-10-19 16:47:24');
INSERT INTO `apply` VALUES ('845', '3', '839', '662', '我认为高校学生档案信息管理系统应实现对学生档案资料的在线录入、编辑、存盘及打印等功能，使学生档案管理工作走向自动化和科学化。如果我能选中该课题，我一定会尽自己最大努力完成该系统。', '2016-10-19 16:50:46', '862', null, null, '1', '2016-10-19 16:50:46', '2016-10-19 16:50:46');
INSERT INTO `apply` VALUES ('846', '3', '355', '375', '打算往安卓开发方向发展，也有意开发一个记账APP', '2016-10-19 16:52:23', '203', '不是记账哦，是手账……就是类似日记本啊什么的……分类记录的东东。也行嘛？我先指定了，不行了再改哈？？', '2016-10-19 20:44:01', '1', '2016-10-19 16:52:23', '2016-10-19 20:44:01');
INSERT INTO `apply` VALUES ('847', '3', '845', '288', '课程题目很贴近大家实际生活，而且自己在工作室也做过类似的管理系统。', '2016-10-19 16:55:18', '862', '已入选题目[农产品电商系统的设计与实现]，该申请无效', '2016-10-19 21:26:15', '1', '2016-10-19 16:55:18', '2016-10-19 21:26:15');
INSERT INTO `apply` VALUES ('848', '3', '379', '680', '对该题目感兴趣', '2016-10-19 16:58:49', '212', 'OK', '2016-10-19 18:06:01', '1', '2016-10-19 16:58:49', '2016-10-19 18:06:01');
INSERT INTO `apply` VALUES ('850', '3', '853', '288', '学校工作室期间独立开发过秉新科技官网', '2016-10-19 17:09:27', '862', '已入选题目[农产品电商系统的设计与实现]，该申请无效', '2016-10-19 21:26:15', '1', '2016-10-19 17:09:27', '2016-10-19 21:26:15');
INSERT INTO `apply` VALUES ('851', '3', '850', '620', '王老师你好，我是13网络工程的黄曼瑜，我对员工管理系统这个项目感兴趣，希望老师给我一个机会', '2016-10-19 17:10:33', '862', null, null, '1', '2016-10-19 17:10:33', '2016-10-19 17:10:33');
INSERT INTO `apply` VALUES ('852', '3', '850', '288', '对题目比较感兴趣，之前有做过类似的项目', '2016-10-19 17:11:34', '862', '已入选题目[农产品电商系统的设计与实现]，该申请无效', '2016-10-19 21:26:15', '1', '2016-10-19 17:11:34', '2016-10-19 21:26:15');
INSERT INTO `apply` VALUES ('853', '3', '636', '611', '喜欢web开发，一直在学习JAVAWEB，希望学习这个课题，以后从事后台开发', '2016-10-19 17:12:31', '253', '好的。', '2016-10-19 20:11:09', '1', '2016-10-19 17:12:31', '2016-10-19 20:11:09');
INSERT INTO `apply` VALUES ('854', '3', '528', '288', '对题目感兴趣', '2016-10-19 17:12:56', '254', '已入选题目[农产品电商系统的设计与实现]，该申请无效', '2016-10-19 21:26:15', '1', '2016-10-19 17:12:56', '2016-10-19 21:26:15');
INSERT INTO `apply` VALUES ('855', '3', '546', '578', '感兴趣', '2016-10-19 17:13:08', '266', '能否介绍一下你的情况，特别是编程能力和自学能力。', '2016-10-19 21:41:12', '1', '2016-10-19 17:13:08', '2016-10-19 21:41:12');
INSERT INTO `apply` VALUES ('858', '3', '850', '281', '我学习过Java编程以及Oracle数据库操作，对这个题目很感兴趣，我打算使用Java语言以及Oracle数据库来实现该系统。希望借此题目检验自己的学习成果，也希望能在老师的指导下巩固自己的专业知识，顺利完成论文。', '2016-10-19 17:18:00', '862', null, null, '1', '2016-10-19 17:18:00', '2016-10-19 17:18:00');
INSERT INTO `apply` VALUES ('859', '3', '42', '319', '对于搜索引擎，互联网信息抓取技术感兴趣，想学习了解下这方面的知识，研究下这方面的内容', '2016-10-19 17:18:14', '278', null, null, '1', '2016-10-19 17:18:14', '2016-10-19 17:18:14');
INSERT INTO `apply` VALUES ('860', '3', '844', '611', '热爱web开发，有一定过得web开发经验，希望学习这个课题培养提高自己的能力', '2016-10-19 17:19:34', '245', '已入选题目[《数据库技术应用基础》课程学习网站]，该申请无效', '2016-10-19 20:11:09', '1', '2016-10-19 17:19:34', '2016-10-19 20:11:09');
INSERT INTO `apply` VALUES ('861', '3', '547', '401', '国内信息安全研究较少希望通过本次设计深入了解这方面知识', '2016-10-19 17:31:53', '266', '申请未通过，该题已有同学入选！', '2016-10-19 21:46:07', '1', '2016-10-19 17:31:53', '2016-10-19 21:46:07');
INSERT INTO `apply` VALUES ('862', '3', '42', '590', '在现代互联网信息爆炸性增长的情况下，如何在大量无用杂乱的信息中快速高效的找到自己需要的信息是需要我们进行研究的。', '2016-10-19 17:32:08', '278', null, null, '1', '2016-10-19 17:32:08', '2016-10-19 17:32:08');
INSERT INTO `apply` VALUES ('865', '3', '818', '340', '老师你好  我对大数据方向比较感兴趣并且希望以后从事这个方向，由于大数据实验班的缘故学习了有关大数据方面的一系列课程，有一定的基础 希望可以参与这个课题', '2016-10-19 17:37:44', '219', '好', '2016-10-19 18:47:02', '1', '2016-10-19 17:37:44', '2016-10-19 18:47:02');
INSERT INTO `apply` VALUES ('866', '3', '855', '497', '以前做过参与过网站类的项目，比较熟悉这题目的一些要求，希望老师给我这个机会，在您的指导下完成。谢谢老师', '2016-10-19 17:44:45', '862', null, null, '1', '2016-10-19 17:44:45', '2016-10-19 17:44:45');
INSERT INTO `apply` VALUES ('867', '3', '850', '494', '由于学生现在从事产品工作，对于技术不是特别擅长，感觉这个题目挺适合我，在我的能力范围内，所以诚恳地希望老师能将这个题目给我并指导我完成，谢谢老师', '2016-10-19 17:50:54', '862', null, null, '1', '2016-10-19 17:50:54', '2016-10-19 17:50:54');
INSERT INTO `apply` VALUES ('868', '3', '476', '603', '前端是我的方向，但是我前端没有太多项目实战的经验，只是自学和做一些百度前端技术的题目，能用JS做一些小游戏页面，希望老师能通过。', '2016-10-19 18:00:35', '231', null, null, '1', '2016-10-19 18:00:35', '2016-10-19 18:00:35');
INSERT INTO `apply` VALUES ('869', '3', '845', '325', '该题目可使用SQL数据库配合JAVA等编程语言进行编写。除了功能上须有一般的入住，退房等必要操作外，更可添加实时的住客请求响应（如需要换床单）。以上是我对题目的一点点理解。希望能跟着老师完成该毕业论文！', '2016-10-19 18:02:16', '862', null, null, '1', '2016-10-19 18:02:16', '2016-10-19 18:02:16');
INSERT INTO `apply` VALUES ('870', '3', '568', '494', '由于学生现在从事产品工作，感觉这个题目挺适合我，在我的能力范围内，所以诚恳地希望老师能将这个题目给我并指导我完成，谢谢老师', '2016-10-19 18:08:39', '247', null, null, '1', '2016-10-19 18:08:39', '2016-10-19 18:08:39');
INSERT INTO `apply` VALUES ('871', '3', '448', '426', '对web技术比较熟悉，曾开发过类似于淘宝的网站', '2016-10-19 18:18:17', '264', null, null, '1', '2016-10-19 18:18:17', '2016-10-19 18:18:17');
INSERT INTO `apply` VALUES ('872', '3', '567', '345', '个人想要学习Android游戏开发', '2016-10-19 18:22:40', '247', null, null, '1', '2016-10-19 18:22:40', '2016-10-19 18:22:40');
INSERT INTO `apply` VALUES ('873', '3', '47', '578', '感兴趣', '2016-10-19 18:22:48', '278', null, null, '1', '2016-10-19 18:22:48', '2016-10-19 18:22:48');
INSERT INTO `apply` VALUES ('874', '3', '845', '478', '：）', '2016-10-19 18:23:16', '862', null, null, '1', '2016-10-19 18:23:16', '2016-10-19 18:23:16');
INSERT INTO `apply` VALUES ('875', '3', '519', '478', '：）', '2016-10-19 18:26:30', '254', null, null, '1', '2016-10-19 18:26:30', '2016-10-19 18:26:30');
INSERT INTO `apply` VALUES ('877', '3', '839', '478', '：）', '2016-10-19 18:30:31', '862', null, null, '1', '2016-10-19 18:30:31', '2016-10-19 18:30:31');
INSERT INTO `apply` VALUES ('878', '3', '850', '345', '我想尝试开发该系统', '2016-10-19 18:31:58', '862', null, null, '1', '2016-10-19 18:31:58', '2016-10-19 18:31:58');
INSERT INTO `apply` VALUES ('879', '3', '236', '660', '老师您好！我热爱运动，特别是球类，球类中对篮球特别热爱！希望能选择这个课题作为我的毕业设计题目。', '2016-10-19 18:41:07', '234', null, null, '1', '2016-10-19 18:41:07', '2016-10-19 18:41:07');
INSERT INTO `apply` VALUES ('881', '3', '355', '478', '学习学习：）', '2016-10-19 18:42:52', '203', '申请未通过，该题已有同学入选！', '2016-10-19 20:44:01', '1', '2016-10-19 18:42:52', '2016-10-19 20:44:01');
INSERT INTO `apply` VALUES ('882', '3', '290', '478', 'Android不是很会，想学习学习，不知道具体的游戏是什么还是自己定？', '2016-10-19 18:46:34', '237', null, null, '1', '2016-10-19 18:46:34', '2016-10-19 18:46:34');
INSERT INTO `apply` VALUES ('883', '3', '845', '629', '', '2016-10-19 18:49:29', '862', null, null, '1', '2016-10-19 18:49:29', '2016-10-19 18:49:29');
INSERT INTO `apply` VALUES ('884', '3', '845', '468', '想尝试一下自己设计一个小型旅馆管理系统，增强自己对这方面知识的掌握。这题目要求比较简单明了，对我也是一个历练机会。', '2016-10-19 19:01:37', '862', null, null, '1', '2016-10-19 19:01:37', '2016-10-19 19:01:37');
INSERT INTO `apply` VALUES ('885', '3', '845', '344', '以下是我对题目要实现的一些功能的简单理解：采用c/s风格，服务器server连接和操作数据库，可以打开多个客户端client窗口即可以在多个电脑上同时进行各种管理和查看操作。', '2016-10-19 19:04:44', '862', null, null, '1', '2016-10-19 19:04:44', '2016-10-19 22:23:32');
INSERT INTO `apply` VALUES ('886', '3', '855', '464', '想做一个web系统，感觉这个很好', '2016-10-19 19:09:46', '862', null, null, '1', '2016-10-19 19:09:46', '2016-10-19 19:09:46');
INSERT INTO `apply` VALUES ('887', '3', '44', '590', '现在是大数据的时代，如何从大量的无用新闻中找到有价值的信息，是我感兴趣的方向，仅凭借人来分析是不足够的，还需要用到计算机来辅助人们筛选', '2016-10-19 19:23:59', '278', null, null, '1', '2016-10-19 19:23:59', '2016-10-19 19:23:59');
INSERT INTO `apply` VALUES ('890', '3', '45', '485', '这个毕设对我来说，难点在于\r\n1、涉及到音频、视频等大对象存储，这个打算用数据库的 blob或clob类型，没用过可以试一试。\r\n2、数据分析功能，这个要跟导师好好交流交流（我也不太清楚具体的功能要求，不过我算法还是可以的）。\r\n3、页面的动态展示，前端编程经验较少，要学一下。\r\n4、实时查询，还要优化一下平台性能。\r\n语言用Java ，数据库 Mysql做得来就用mysql，做不来可以换SQLServer。我SQL方面的知识还是可以的，哪一个数据库没影响太大。', '2016-10-19 19:28:02', '252', null, null, '1', '2016-10-19 19:28:02', '2016-10-19 19:28:02');
INSERT INTO `apply` VALUES ('892', '3', '448', '460', '老师，我想申请您的这道题目，感谢通过', '2016-10-19 19:31:11', '264', null, null, '1', '2016-10-19 19:31:11', '2016-10-19 19:31:11');
INSERT INTO `apply` VALUES ('894', '3', '318', '703', '我已确定和李老师完成该毕业设计课题。', '2016-10-19 19:40:15', '246', '好', '2016-10-19 19:56:00', '1', '2016-10-19 19:40:15', '2016-10-19 19:56:00');
INSERT INTO `apply` VALUES ('895', '3', '853', '496', '老师您好，我是2013级软件工程一班的学生，大学期间平均绩点为3.79，在本专业内排名前20%。由于我现在在4399网络股份有限公司PC游戏运营中心担任运营部的实习生，故希望毕业论文/设计能够完成比较实用的应用系统，希望老师能够成为我的导师，辛苦老师了！', '2016-10-19 19:44:45', '862', null, null, '1', '2016-10-19 19:44:45', '2016-10-19 19:44:45');
INSERT INTO `apply` VALUES ('896', '3', '850', '496', '老师您好，我是2013级软件工程一班的学生，大学期间平均绩点为3.79，在本专业内排名前20%。由于我现在在4399网络股份有限公司PC游戏运营中心担任运营部的实习生，故希望毕业论文/设计能够完成比较实用的应用系统，希望老师能够成为我的导师，辛苦老师了！', '2016-10-19 19:45:10', '862', null, null, '1', '2016-10-19 19:45:10', '2016-10-19 19:45:10');
INSERT INTO `apply` VALUES ('897', '3', '845', '496', '老师您好，我是2013级软件工程一班的学生，大学期间平均绩点为3.79，在本专业内排名前20%。由于我现在在4399网络股份有限公司PC游戏运营中心担任运营部的实习生，故希望毕业论文/设计能够完成比较实用的应用系统，希望老师能够成为我的导师，辛苦老师了！', '2016-10-19 19:45:27', '862', null, null, '1', '2016-10-19 19:45:27', '2016-10-19 19:45:27');
INSERT INTO `apply` VALUES ('898', '3', '476', '477', '个人当前就业方向为前端开发，涉及H5新特性应用，且对2D绘图工具Canvas和3D绘图工具WebGl有一定的认识和浓厚的兴趣，且进行过一定的Canvas开发实践（一款跑步小游戏）。希望可以在个人前端发展向图形图像开发偏移的同时能够有一个相对吻合的毕业设计题目来进行进一步的探索和提升，同时也让毕业设计成为个人职业发展路上的一块敲门砖与垫脚石。', '2016-10-19 19:49:19', '231', null, null, '1', '2016-10-19 19:49:19', '2016-10-19 19:49:19');
INSERT INTO `apply` VALUES ('900', '3', '845', '494', '由于学生现在从事产品工作，对于技术不是特别擅长，感觉这个题目挺适合我，在我的能力范围内，所以诚恳地希望老师能将这个题目给我并指导我完成，谢谢老师', '2016-10-19 19:52:06', '862', null, null, '1', '2016-10-19 19:52:06', '2016-10-19 19:52:06');
INSERT INTO `apply` VALUES ('902', '2', '345', '196', '对该领域有一定的实践经验', '2016-10-19 19:54:35', '11', null, null, '1', '2016-10-19 19:54:35', '2016-10-19 19:54:35');
INSERT INTO `apply` VALUES ('904', '2', '142', '194', '对机器视觉研究感兴趣', '2016-10-19 20:03:05', '15', '同意，周五晚上7：00例会请准时参加。', '2016-10-19 20:34:30', '1', '2016-10-19 20:03:05', '2016-10-19 20:34:30');
INSERT INTO `apply` VALUES ('905', '2', '331', '194', '从事物流行业实习，对物流工作较为熟悉', '2016-10-19 20:04:50', '13', '已入选题目[基于机器视觉的AGV导航算法研究]，该申请无效', '2016-10-19 20:34:30', '1', '2016-10-19 20:04:50', '2016-10-19 20:34:30');
INSERT INTO `apply` VALUES ('906', '2', '145', '194', '对通讯信息技术感兴趣', '2016-10-19 20:06:09', '15', '申请未通过，该题已有同学入选！', '2016-10-19 21:09:52', '1', '2016-10-19 20:06:09', '2016-10-19 21:09:52');
INSERT INTO `apply` VALUES ('907', '3', '481', '657', '擅长于Android应用开发，希望得到老师指导！', '2016-10-19 20:06:43', '231', null, null, '1', '2016-10-19 20:06:43', '2016-10-19 20:06:43');
INSERT INTO `apply` VALUES ('908', '2', '345', '194', '在物流公司实习，对公司价值链有疑问，想向这方面研究', '2016-10-19 20:08:42', '11', '已入选题目[基于机器视觉的AGV导航算法研究]，该申请无效', '2016-10-19 20:34:30', '1', '2016-10-19 20:08:42', '2016-10-19 20:34:30');
INSERT INTO `apply` VALUES ('909', '3', '807', '465', '对此项研究感兴趣。', '2016-10-19 20:09:24', '219', null, null, '1', '2016-10-19 20:09:24', '2016-10-19 20:09:24');
INSERT INTO `apply` VALUES ('910', '3', '480', '657', '优先选择Android手机的行迹记录及其地图显示', '2016-10-19 20:09:53', '231', null, null, '1', '2016-10-19 20:09:53', '2016-10-19 20:09:53');
INSERT INTO `apply` VALUES ('912', '3', '364', '551', '深思熟虑，敌不过兴趣使然，对这个课题还是十分感兴趣的。', '2016-10-19 20:23:28', '246', '确认。', '2016-10-19 20:28:13', '1', '2016-10-19 20:23:28', '2016-10-19 20:28:13');
INSERT INTO `apply` VALUES ('913', '3', '839', '439', '使用任何类型编程语言，实现一款网络版或单机版的档案信息管理系统，可以对高校学生的档案进行电子化管理，具体包括档案信息录入，档案多条件查询，档案分析等。数据库可以使用Access 或 SQL Server等。', '2016-10-19 20:26:13', '862', null, null, '1', '2016-10-19 20:26:13', '2016-10-19 20:26:13');
INSERT INTO `apply` VALUES ('915', '3', '853', '494', '老师您好，我看了题目的要求，感觉我对题目有比较大兴趣，也有信心将这个题目做好，希望您能指导我，谢谢老师', '2016-10-19 20:36:11', '862', null, null, '1', '2016-10-19 20:36:11', '2016-10-19 20:36:11');
INSERT INTO `apply` VALUES ('916', '3', '448', '463', '对前端设计有一定的了解，想要学习并设计网站', '2016-10-19 20:42:55', '264', null, null, '1', '2016-10-19 20:42:55', '2016-10-19 20:42:55');
INSERT INTO `apply` VALUES ('917', '3', '519', '463', '对此系统比较感兴趣', '2016-10-19 20:45:21', '254', null, null, '1', '2016-10-19 20:45:21', '2016-10-19 20:45:21');
INSERT INTO `apply` VALUES ('918', '3', '846', '519', '好像很难', '2016-10-19 20:49:01', '265', null, null, '1', '2016-10-19 20:49:01', '2016-10-19 20:49:01');
INSERT INTO `apply` VALUES ('919', '3', '554', '288', '该课题有很强的实用性，而且在工作室做过类似的项目', '2016-10-19 20:55:00', '266', '可以。', '2016-10-19 21:26:15', '1', '2016-10-19 20:55:00', '2016-10-19 21:26:15');
INSERT INTO `apply` VALUES ('920', '3', '55', '439', '农产品价格具有一定的波动性和规律性，\r\n\r\n对农产品价格的波动的预测具有客观的经济效应和社会效应。\r\n\r\n该项目需要对主流农产品进行价格信息整理、预测和分析，并生成相关图表。', '2016-10-19 21:04:56', '278', null, null, '1', '2016-10-19 21:04:56', '2016-10-19 21:04:56');
INSERT INTO `apply` VALUES ('921', '3', '475', '439', '自主命题', '2016-10-19 21:09:25', '231', null, null, '1', '2016-10-19 21:09:25', '2016-10-19 21:09:25');
INSERT INTO `apply` VALUES ('922', '3', '49', '484', '熟悉java web开发，应用ssh和mysql开发过项目，对于本题目想再尝试一下，包括页面的实现等', '2016-10-19 21:17:28', '252', null, null, '1', '2016-10-19 21:17:28', '2016-10-19 21:17:28');
INSERT INTO `apply` VALUES ('923', '3', '850', '655', '加强本人对编程语言，数据库应用的知识。', '2016-10-19 21:34:51', '862', null, null, '1', '2016-10-19 21:34:51', '2016-10-19 21:34:51');
INSERT INTO `apply` VALUES ('924', '3', '547', '310', '本人有一定的安卓基础，因而认为该项目具有实用意义，合适本人开发。而且指导老师是一个很NICE的老师。', '2016-10-19 21:42:38', '266', '可以。', '2016-10-19 21:46:07', '1', '2016-10-19 21:42:38', '2016-10-19 21:46:07');
INSERT INTO `apply` VALUES ('926', '3', '846', '610', '想学习新技术', '2016-10-19 22:03:25', '265', '如果之前没有深度学习方面的基础，建议还是别选，可能会比较难，看书或资料都会比较花时间。除非你将来时打算做科研的话，那么这个投入可能还行；但如果将来直接找系统开发等方面的职位，这个投入估计没有多少收益，而且做起来比较痛苦。', '2016-10-19 22:30:18', '1', '2016-10-19 22:03:25', '2016-10-19 22:30:18');
INSERT INTO `apply` VALUES ('927', '3', '853', '335', '本人对web开发比较感兴趣，打算采用html5、CSS和Javascript完成网站开发', '2016-10-19 22:07:34', '862', null, null, '1', '2016-10-19 22:07:34', '2016-10-19 22:07:34');
INSERT INTO `apply` VALUES ('928', '3', '610', '601', '对分布式服务器架构感兴趣，自己也简单搭建过分布式监控系统', '2016-10-19 22:19:48', '261', null, null, '1', '2016-10-19 22:19:48', '2016-10-19 22:19:48');
INSERT INTO `apply` VALUES ('929', '3', '572', '437', '本人对股票有过一定的研究，对炒股也很有兴趣，之前就想过是否能通过算法结合一些数据对股票走势做预测', '2016-10-19 22:21:29', '247', null, null, '1', '2016-10-19 22:21:29', '2016-10-19 22:21:29');
INSERT INTO `apply` VALUES ('930', '3', '845', '336', '拥有HTML5+CSS3轻混合APP项目开发经验，这道题我想可以做个APP应用', '2016-10-19 22:22:07', '862', null, null, '1', '2016-10-19 22:22:07', '2016-10-19 22:22:07');
INSERT INTO `apply` VALUES ('931', '3', '845', '437', '本人觉得开发一个这样的旅馆系统是很有意义的，现在的旅馆这么多，如果设计的不错的话，还可以出售给一些旅馆', '2016-10-19 22:28:41', '862', null, null, '1', '2016-10-19 22:28:41', '2016-10-19 22:28:41');
INSERT INTO `apply` VALUES ('932', '3', '855', '601', '感兴趣，希望能通过', '2016-10-19 22:29:56', '862', null, null, '1', '2016-10-19 22:29:56', '2016-10-19 22:29:56');
INSERT INTO `apply` VALUES ('934', '1', '8', '29', '手动阀', '2017-08-01 09:26:07', '4', '已入选题目[基于企业视角的珠三角地区工业工程专业能力需求分析]，该申请无效', '2017-09-06 09:50:32', '1', '2017-08-01 09:26:07', '2017-09-06 09:50:32');
INSERT INTO `apply` VALUES ('936', '2', '1', '29', '我问问', '2017-08-05 11:06:49', '4', 'hhhhhhhhh', '2017-09-06 09:50:32', '1', '2017-08-05 11:06:49', '2017-09-06 09:50:32');
INSERT INTO `apply` VALUES ('937', '4', '868', '29', '777', '2017-08-12 22:16:50', '6', '已入选题目[基于企业视角的珠三角地区工业工程专业能力需求分析]，该申请无效', '2017-09-06 09:50:32', '1', '2017-08-12 22:16:50', '2017-09-06 09:50:32');
INSERT INTO `apply` VALUES ('938', '1', '108', '43', '77', '2017-08-12 22:19:40', '6', '88', '2017-08-12 22:20:02', '1', '2017-08-12 22:19:40', '2017-08-12 22:20:02');

-- ----------------------------
-- Table structure for defense_group
-- ----------------------------
DROP TABLE IF EXISTS `defense_group`;
CREATE TABLE `defense_group` (
  `id` bigint(10) NOT NULL AUTO_INCREMENT,
  `projectid` bigint(10) DEFAULT NULL COMMENT '论文工作id',
  `taskid` bigint(10) DEFAULT NULL,
  `groupno` int(10) DEFAULT NULL COMMENT '分组编号，同一次答辩不允许重复',
  `grouptype` varchar(20) DEFAULT NULL COMMENT '分组类型，优秀/普通',
  `leaderid` bigint(10) DEFAULT NULL COMMENT '组长，教师id',
  `secretaryid` bigint(10) DEFAULT NULL COMMENT '秘书，老师id',
  `teachers` text COMMENT '小组老师,JSON格式，带ID、工号、姓名、职称',
  `students` text COMMENT '小组学生,JSON格式，带ID、学号、姓名、班级',
  `defensetime` datetime DEFAULT NULL COMMENT '答辩时间',
  `defenseroom` varchar(100) DEFAULT NULL,
  `cdate` datetime DEFAULT NULL,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=67 DEFAULT CHARSET=utf8;

-- ----------------------------
-- Records of defense_group
-- ----------------------------
INSERT INTO `defense_group` VALUES ('12', '2', '17', '2', '0', '10', '8', '[{\"teacherid\":9,\"account\":\"30001792\",\"userName\":\"吴春胤\",\"titleName\":\"讲师\",\"titleLevel\":\"中级\"}]', '[{\"studentid\":163,\"stuno\":\"201330850132\",\"stuname\":\"张耿锋\",\"clazz\":\"工业工程1班\",\"defenseStatus\":\"正常答辩\"},{\"studentid\":164,\"stuno\":\"201330850133\",\"stuname\":\"张鹏\",\"clazz\":\"工业工程1班\",\"defenseStatus\":\"正常答辩\"},{\"studentid\":195,\"stuno\":\"201330850231\",\"stuname\":\"叶俊威\",\"clazz\":\"工业工程2班\",\"defenseStatus\":\"正常答辩\"},{\"studentid\":196,\"stuno\":\"201330850232\",\"stuname\":\"叶政明\",\"clazz\":\"工业工程2班\",\"defenseStatus\":\"正常答辩\"},{\"studentid\":197,\"stuno\":\"201330850233\",\"stuname\":\"张明阳\",\"clazz\":\"工业工程2班\",\"defenseStatus\":\"正常答辩\"},{\"studentid\":198,\"stuno\":\"201330850235\",\"stuname\":\"钟国盛\",\"clazz\":\"工业工程2班\",\"defenseStatus\":\"正常答辩\"},{\"studentid\":199,\"stuno\":\"201330850236\",\"stuname\":\"周广科\",\"clazz\":\"工业工程2班\",\"defenseStatus\":\"正常答辩\"}]', '2017-08-23 00:00:00', null, null);
INSERT INTO `defense_group` VALUES ('50', '3', '26', '1', '0', null, null, null, '[{\"studentid\":867,\"stuno\":\"201230690223\",\"stuname\":\"魏然立\",\"clazz\":\"软工2\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null},{\"studentid\":866,\"stuno\":\"201231000827\",\"stuname\":\"王龙海\",\"clazz\":\"软工R5\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null},{\"studentid\":671,\"stuno\":\"201330180221\",\"stuname\":\"苏湘堡\",\"clazz\":\"软工R1\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null},{\"studentid\":284,\"stuno\":\"201330320104\",\"stuname\":\"陈艳云\",\"clazz\":\"计算机1\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null},{\"studentid\":285,\"stuno\":\"201330320105\",\"stuname\":\"邓逸海\",\"clazz\":\"计算机1\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null},{\"studentid\":286,\"stuno\":\"201330320106\",\"stuname\":\"邓振鹏\",\"clazz\":\"计算机1\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null},{\"studentid\":287,\"stuno\":\"201330320107\",\"stuname\":\"韩诗云\",\"clazz\":\"计算机1\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null},{\"studentid\":288,\"stuno\":\"201330320108\",\"stuname\":\"胡越\",\"clazz\":\"计算机1\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null},{\"studentid\":289,\"stuno\":\"201330320109\",\"stuname\":\"黄嘉威\",\"clazz\":\"计算机1\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null},{\"studentid\":291,\"stuno\":\"201330320111\",\"stuname\":\"蓝小烨\",\"clazz\":\"计算机1\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null},{\"studentid\":293,\"stuno\":\"201330320113\",\"stuname\":\"李威威\",\"clazz\":\"计算机1\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null},{\"studentid\":294,\"stuno\":\"201330320115\",\"stuname\":\"林捷聪\",\"clazz\":\"计算机1\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null},{\"studentid\":296,\"stuno\":\"201330320117\",\"stuname\":\"罗发伟\",\"clazz\":\"计算机1\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null},{\"studentid\":297,\"stuno\":\"201330320118\",\"stuname\":\"谭伟丰\",\"clazz\":\"计算机1\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null},{\"studentid\":298,\"stuno\":\"201330320119\",\"stuname\":\"汤兰\",\"clazz\":\"计算机1\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null},{\"studentid\":299,\"stuno\":\"201330320120\",\"stuname\":\"吴艳倩\",\"clazz\":\"计算机1\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null},{\"studentid\":300,\"stuno\":\"201330320121\",\"stuname\":\"伍缙宇\",\"clazz\":\"计算机1\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null},{\"studentid\":301,\"stuno\":\"201330320123\",\"stuname\":\"严智林\",\"clazz\":\"计算机1\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null},{\"studentid\":303,\"stuno\":\"201330320125\",\"stuname\":\"杨添坤\",\"clazz\":\"计算机1\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null},{\"studentid\":304,\"stuno\":\"201330320126\",\"stuname\":\"张惠娜\",\"clazz\":\"计算机1\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null},{\"studentid\":306,\"stuno\":\"201330320128\",\"stuname\":\"钟义坚\",\"clazz\":\"计算机1\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null},{\"studentid\":307,\"stuno\":\"201330320130\",\"stuname\":\"周俊鹏\",\"clazz\":\"计算机1\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null}]', '2017-09-28 00:00:00', null, null);
INSERT INTO `defense_group` VALUES ('51', '3', '26', '2', '0', null, null, null, '[{\"studentid\":308,\"stuno\":\"201330320131\",\"stuname\":\"庄嘉豪\",\"clazz\":\"计算机1\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null},{\"studentid\":315,\"stuno\":\"201330320202\",\"stuname\":\"陈铎文\",\"clazz\":\"计算机2\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null},{\"studentid\":318,\"stuno\":\"201330320205\",\"stuname\":\"何桂康\",\"clazz\":\"计算机2\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null},{\"studentid\":321,\"stuno\":\"201330320208\",\"stuname\":\"黄伟杰\",\"clazz\":\"计算机2\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null},{\"studentid\":323,\"stuno\":\"201330320211\",\"stuname\":\"赖治成\",\"clazz\":\"计算机2\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null},{\"studentid\":324,\"stuno\":\"201330320213\",\"stuname\":\"李炳新\",\"clazz\":\"计算机2\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null},{\"studentid\":326,\"stuno\":\"201330320215\",\"stuname\":\"林城轩\",\"clazz\":\"计算机2\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null},{\"studentid\":327,\"stuno\":\"201330320216\",\"stuname\":\"林雅琪\",\"clazz\":\"2班\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null},{\"studentid\":310,\"stuno\":\"201330320217\",\"stuname\":\"刘宏德\",\"clazz\":\"计算机1\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null},{\"studentid\":328,\"stuno\":\"201330320218\",\"stuname\":\"刘铭坚\",\"clazz\":\"计算机2\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null},{\"studentid\":329,\"stuno\":\"201330320219\",\"stuname\":\"刘运传\",\"clazz\":\"计算机2\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null},{\"studentid\":311,\"stuno\":\"201330320220\",\"stuname\":\"彭熙\",\"clazz\":\"计算机1\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null},{\"studentid\":331,\"stuno\":\"201330320222\",\"stuname\":\"孙煜楷\",\"clazz\":\"计算机2\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null},{\"studentid\":332,\"stuno\":\"201330320223\",\"stuname\":\"萧敏惠\",\"clazz\":\"计算机2\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null},{\"studentid\":333,\"stuno\":\"201330320224\",\"stuname\":\"姚林镇\",\"clazz\":\"计算机2\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null},{\"studentid\":334,\"stuno\":\"201330320225\",\"stuname\":\"曾宏余\",\"clazz\":\"计算机2\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null},{\"studentid\":337,\"stuno\":\"201330320228\",\"stuname\":\"钟家明\",\"clazz\":\"计算机2\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null},{\"studentid\":338,\"stuno\":\"201330320229\",\"stuname\":\"周家智\",\"clazz\":\"计算机2\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null},{\"studentid\":339,\"stuno\":\"201330320231\",\"stuname\":\"周宇文\",\"clazz\":\"计算机2\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null},{\"studentid\":341,\"stuno\":\"201330320301\",\"stuname\":\"陈力键\",\"clazz\":\"计算机3\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null},{\"studentid\":342,\"stuno\":\"201330320302\",\"stuname\":\"陈晓朗\",\"clazz\":\"计算机3\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null},{\"studentid\":343,\"stuno\":\"201330320303\",\"stuname\":\"邓水凤\",\"clazz\":\"计算机3\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null},{\"studentid\":346,\"stuno\":\"201330320306\",\"stuname\":\"黄宇畅\",\"clazz\":\"计算机3\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null},{\"studentid\":347,\"stuno\":\"201330320308\",\"stuname\":\"黎骅德\",\"clazz\":\"计算机3\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null}]', '2017-09-28 00:00:00', null, null);
INSERT INTO `defense_group` VALUES ('52', '3', '26', '3', '0', null, null, null, '[{\"studentid\":348,\"stuno\":\"201330320309\",\"stuname\":\"李杰\",\"clazz\":\"计算机3\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null},{\"studentid\":349,\"stuno\":\"201330320310\",\"stuname\":\"李裕豪\",\"clazz\":\"计算机3\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null},{\"studentid\":352,\"stuno\":\"201330320313\",\"stuname\":\"刘兆坤\",\"clazz\":\"计算机3\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null},{\"studentid\":353,\"stuno\":\"201330320314\",\"stuname\":\"楼瑞文\",\"clazz\":\"计算机3\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null},{\"studentid\":355,\"stuno\":\"201330320316\",\"stuname\":\"彭威\",\"clazz\":\"计算机3\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null},{\"studentid\":356,\"stuno\":\"201330320317\",\"stuname\":\"谭春霞\",\"clazz\":\"计算机3\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null},{\"studentid\":357,\"stuno\":\"201330320318\",\"stuname\":\"唐操\",\"clazz\":\"计算机3\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null},{\"studentid\":358,\"stuno\":\"201330320319\",\"stuname\":\"温婷婷\",\"clazz\":\"计算机3\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null},{\"studentid\":359,\"stuno\":\"201330320320\",\"stuname\":\"吴立钦\",\"clazz\":\"计算机3\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null},{\"studentid\":360,\"stuno\":\"201330320321\",\"stuname\":\"谢秋颖\",\"clazz\":\"计算机3\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null},{\"studentid\":361,\"stuno\":\"201330320322\",\"stuname\":\"徐灿冰\",\"clazz\":\"计算机3\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null},{\"studentid\":362,\"stuno\":\"201330320323\",\"stuname\":\"尹从容\",\"clazz\":\"计算机3\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null},{\"studentid\":363,\"stuno\":\"201330320324\",\"stuname\":\"尹烽旭\",\"clazz\":\"计算机3\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null},{\"studentid\":365,\"stuno\":\"201330320326\",\"stuname\":\"曾晓翔\",\"clazz\":\"计算机3\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null},{\"studentid\":366,\"stuno\":\"201330320327\",\"stuname\":\"张威\",\"clazz\":\"计算机3\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null},{\"studentid\":367,\"stuno\":\"201330320328\",\"stuname\":\"张展康\",\"clazz\":\"计算机3\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null},{\"studentid\":368,\"stuno\":\"201330320329\",\"stuname\":\"赵敏敏\",\"clazz\":\"计算机3\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null},{\"studentid\":369,\"stuno\":\"201330320330\",\"stuname\":\"郑文龙\",\"clazz\":\"计算机3\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null},{\"studentid\":370,\"stuno\":\"201330320331\",\"stuname\":\"周家永\",\"clazz\":\"计算机3\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null},{\"studentid\":372,\"stuno\":\"201330320401\",\"stuname\":\"蔡睿\",\"clazz\":\"计算机4\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null},{\"studentid\":375,\"stuno\":\"201330320404\",\"stuname\":\"陈嘉滨\",\"clazz\":\"计算机4\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null},{\"studentid\":376,\"stuno\":\"201330320405\",\"stuname\":\"陈雪基\",\"clazz\":\"计算机4\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null},{\"studentid\":377,\"stuno\":\"201330320406\",\"stuname\":\"胡奕豪\",\"clazz\":\"计算机4\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null},{\"studentid\":378,\"stuno\":\"201330320407\",\"stuname\":\"黄琳琳\",\"clazz\":\"计算机4\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null},{\"studentid\":379,\"stuno\":\"201330320408\",\"stuname\":\"黎颖\",\"clazz\":\"计算机4\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null}]', '2017-09-28 00:00:00', null, null);
INSERT INTO `defense_group` VALUES ('53', '3', '26', '4', '0', null, null, null, '[{\"studentid\":380,\"stuno\":\"201330320409\",\"stuname\":\"梁颖怡\",\"clazz\":\"计算机4\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null},{\"studentid\":382,\"stuno\":\"201330320411\",\"stuname\":\"林智源\",\"clazz\":\"计算机4\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null},{\"studentid\":383,\"stuno\":\"201330320412\",\"stuname\":\"刘家辉\",\"clazz\":\"计算机4\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null},{\"studentid\":384,\"stuno\":\"201330320413\",\"stuname\":\"卢贵阳\",\"clazz\":\"计算机4\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null},{\"studentid\":385,\"stuno\":\"201330320414\",\"stuname\":\"陆慧杰\",\"clazz\":\"计算机4\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null},{\"studentid\":386,\"stuno\":\"201330320415\",\"stuname\":\"吕立特\",\"clazz\":\"计算机4\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null},{\"studentid\":388,\"stuno\":\"201330320417\",\"stuname\":\"201330320417\",\"clazz\":\"计算机4\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null},{\"studentid\":389,\"stuno\":\"201330320418\",\"stuname\":\"庞郁赢\",\"clazz\":\"计算机4\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null},{\"studentid\":390,\"stuno\":\"201330320419\",\"stuname\":\"饶家铭\",\"clazz\":\"计算机4\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null},{\"studentid\":391,\"stuno\":\"201330320420\",\"stuname\":\"涂清韶\",\"clazz\":\"计算机4\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null},{\"studentid\":392,\"stuno\":\"201330320421\",\"stuname\":\"王玲玲\",\"clazz\":\"计算机4\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null},{\"studentid\":393,\"stuno\":\"201330320422\",\"stuname\":\"邬鑫浩\",\"clazz\":\"计算机4\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null},{\"studentid\":394,\"stuno\":\"201330320423\",\"stuname\":\"杨梦瑶\",\"clazz\":\"计算机4\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null},{\"studentid\":395,\"stuno\":\"201330320424\",\"stuname\":\"叶康论\",\"clazz\":\"计算机4\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null},{\"studentid\":396,\"stuno\":\"201330320425\",\"stuname\":\"袁炜尧\",\"clazz\":\"计算机4\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null},{\"studentid\":397,\"stuno\":\"201330320426\",\"stuname\":\"曾增威\",\"clazz\":\"计算机4\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null},{\"studentid\":398,\"stuno\":\"201330320427\",\"stuname\":\"张兵\",\"clazz\":\"计算机4\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null},{\"studentid\":399,\"stuno\":\"201330320428\",\"stuname\":\"张焕旭\",\"clazz\":\"计算机4\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null},{\"studentid\":401,\"stuno\":\"201330320430\",\"stuname\":\"钟沛霖\",\"clazz\":\"计算机4\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null},{\"studentid\":402,\"stuno\":\"201330320431\",\"stuname\":\"钟卓伦\",\"clazz\":\"计算机4\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null},{\"studentid\":403,\"stuno\":\"201330320432\",\"stuname\":\"周展博\",\"clazz\":\"计算机4\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null},{\"studentid\":405,\"stuno\":\"201330320501\",\"stuname\":\"蔡家豪\",\"clazz\":\"计算机5\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null},{\"studentid\":406,\"stuno\":\"201330320503\",\"stuname\":\"陈俊旺\",\"clazz\":\"计算机5\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null},{\"studentid\":407,\"stuno\":\"201330320504\",\"stuname\":\"陈启贤\",\"clazz\":\"计算机5\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null},{\"studentid\":408,\"stuno\":\"201330320505\",\"stuname\":\"陈思敏\",\"clazz\":\"计算机5\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null}]', '2017-09-28 00:00:00', null, null);
INSERT INTO `defense_group` VALUES ('54', '3', '26', '5', '0', null, null, null, '[{\"studentid\":409,\"stuno\":\"201330320506\",\"stuname\":\"陈文玉\",\"clazz\":\"计算机5\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null},{\"studentid\":410,\"stuno\":\"201330320507\",\"stuname\":\"陈晓霞\",\"clazz\":\"计算机5\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null},{\"studentid\":411,\"stuno\":\"201330320508\",\"stuname\":\"陈学凡\",\"clazz\":\"计算机5\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null},{\"studentid\":412,\"stuno\":\"201330320509\",\"stuname\":\"陈正阳\",\"clazz\":\"计算机5\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null},{\"studentid\":413,\"stuno\":\"201330320510\",\"stuname\":\"成玉琪\",\"clazz\":\"计算机5\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null},{\"studentid\":414,\"stuno\":\"201330320511\",\"stuname\":\"何思音\",\"clazz\":\"计算机5\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null},{\"studentid\":415,\"stuno\":\"201330320512\",\"stuname\":\"黄宝多\",\"clazz\":\"计算机5\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null},{\"studentid\":416,\"stuno\":\"201330320513\",\"stuname\":\"黄家健\",\"clazz\":\"计算机5\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null},{\"studentid\":417,\"stuno\":\"201330320514\",\"stuname\":\"蓝佑金\",\"clazz\":\"计算机5\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null},{\"studentid\":418,\"stuno\":\"201330320515\",\"stuname\":\"李嘉龙\",\"clazz\":\"计算机5\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null},{\"studentid\":419,\"stuno\":\"201330320516\",\"stuname\":\"梁永坚\",\"clazz\":\"计算机5\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null},{\"studentid\":420,\"stuno\":\"201330320517\",\"stuname\":\"梁智颖\",\"clazz\":\"计算机5\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null},{\"studentid\":421,\"stuno\":\"201330320518\",\"stuname\":\"刘德炜\",\"clazz\":\"计算机5\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null},{\"studentid\":422,\"stuno\":\"201330320519\",\"stuname\":\"刘付文韬\",\"clazz\":\"计算机5\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null},{\"studentid\":423,\"stuno\":\"201330320520\",\"stuname\":\"201330320520\",\"clazz\":\"计算机5\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null},{\"studentid\":424,\"stuno\":\"201330320521\",\"stuname\":\"卢文辉\",\"clazz\":\"计算机5\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null},{\"studentid\":425,\"stuno\":\"201330320522\",\"stuname\":\"莫海麟\",\"clazz\":\"计算机5\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null},{\"studentid\":427,\"stuno\":\"201330320524\",\"stuname\":\"苏国龙\",\"clazz\":\"计算机5\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null},{\"studentid\":428,\"stuno\":\"201330320525\",\"stuname\":\"谭锐文\",\"clazz\":\"计算机5\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null},{\"studentid\":429,\"stuno\":\"201330320526\",\"stuname\":\"王达\",\"clazz\":\"计算机5\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null},{\"studentid\":430,\"stuno\":\"201330320527\",\"stuname\":\"王靖宇\",\"clazz\":\"计算机5\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null},{\"studentid\":431,\"stuno\":\"201330320528\",\"stuname\":\"叶伟鹏\",\"clazz\":\"计算机5\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null},{\"studentid\":432,\"stuno\":\"201330320529\",\"stuname\":\"詹夏城\",\"clazz\":\"计算机5\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null},{\"studentid\":434,\"stuno\":\"201330320531\",\"stuname\":\"郑荣欢\",\"clazz\":\"计算机5\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null},{\"studentid\":435,\"stuno\":\"201330320532\",\"stuname\":\"周宏滨\",\"clazz\":\"计算机5\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null}]', '2017-09-28 00:00:00', null, null);
INSERT INTO `defense_group` VALUES ('55', '3', '26', '6', '0', null, null, null, '[{\"studentid\":438,\"stuno\":\"201330320601\",\"stuname\":\"白佳琳\",\"clazz\":\"计算机6\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null},{\"studentid\":440,\"stuno\":\"201330320603\",\"stuname\":\"陈嘉兴\",\"clazz\":\"计算机6\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null},{\"studentid\":441,\"stuno\":\"201330320604\",\"stuname\":\"陈良柱\",\"clazz\":\"计算机6\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null},{\"studentid\":442,\"stuno\":\"201330320605\",\"stuname\":\"陈诗林\",\"clazz\":\"计算机6\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null},{\"studentid\":443,\"stuno\":\"201330320606\",\"stuname\":\"陈舒怡\",\"clazz\":\"计算机6\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null},{\"studentid\":444,\"stuno\":\"201330320607\",\"stuname\":\"郭紫航\",\"clazz\":\"计算机6\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null},{\"studentid\":445,\"stuno\":\"201330320608\",\"stuname\":\"郝凌霄\",\"clazz\":\"计算机6\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null},{\"studentid\":446,\"stuno\":\"201330320609\",\"stuname\":\"黄凤英\",\"clazz\":\"计算机6\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null},{\"studentid\":447,\"stuno\":\"201330320610\",\"stuname\":\"黄杰聪\",\"clazz\":\"计算机6\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null},{\"studentid\":448,\"stuno\":\"201330320611\",\"stuname\":\"柯文涛\",\"clazz\":\"计算机6\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null},{\"studentid\":449,\"stuno\":\"201330320612\",\"stuname\":\"柯振旭\",\"clazz\":\"计算机6\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null},{\"studentid\":450,\"stuno\":\"201330320613\",\"stuname\":\"孔耀烺\",\"clazz\":\"计算机6\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null},{\"studentid\":451,\"stuno\":\"201330320614\",\"stuname\":\"赖远新\",\"clazz\":\"计算机6\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null},{\"studentid\":452,\"stuno\":\"201330320615\",\"stuname\":\"赖智辉\",\"clazz\":\"计算机6\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null},{\"studentid\":453,\"stuno\":\"201330320616\",\"stuname\":\"李东泽\",\"clazz\":\"计算机6\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null},{\"studentid\":454,\"stuno\":\"201330320617\",\"stuname\":\"李金鹏\",\"clazz\":\"计算机6\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null},{\"studentid\":455,\"stuno\":\"201330320618\",\"stuname\":\"林督翔\",\"clazz\":\"计算机6\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null},{\"studentid\":456,\"stuno\":\"201330320619\",\"stuname\":\"林明键\",\"clazz\":\"计算机6\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null},{\"studentid\":457,\"stuno\":\"201330320620\",\"stuname\":\"卢洪俊\",\"clazz\":\"计算机6\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null},{\"studentid\":458,\"stuno\":\"201330320621\",\"stuname\":\"彭海聪\",\"clazz\":\"计算机6\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null},{\"studentid\":459,\"stuno\":\"201330320622\",\"stuname\":\"彭鹏辉\",\"clazz\":\"计算机6\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null},{\"studentid\":461,\"stuno\":\"201330320624\",\"stuname\":\"吴文涛\",\"clazz\":\"计算机6\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null},{\"studentid\":462,\"stuno\":\"201330320625\",\"stuname\":\"谢晨诺\",\"clazz\":\"计算机6\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null},{\"studentid\":463,\"stuno\":\"201330320626\",\"stuname\":\"严敏玲\",\"clazz\":\"计算机6\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null},{\"studentid\":464,\"stuno\":\"201330320627\",\"stuname\":\"余镇邦\",\"clazz\":\"计算机6\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null}]', '2017-09-28 00:00:00', null, null);
INSERT INTO `defense_group` VALUES ('56', '3', '26', '7', '0', null, null, null, '[{\"studentid\":466,\"stuno\":\"201330320629\",\"stuname\":\"翟志伟\",\"clazz\":\"计算机6\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null},{\"studentid\":467,\"stuno\":\"201330320630\",\"stuname\":\"张晋荣\",\"clazz\":\"计算机6\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null},{\"studentid\":473,\"stuno\":\"201330330103\",\"stuname\":\"何宇虹\",\"clazz\":\"软件工程1\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null},{\"studentid\":476,\"stuno\":\"201330330106\",\"stuname\":\"黄锵嘉\",\"clazz\":\"软件工程1\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null},{\"studentid\":480,\"stuno\":\"201330330110\",\"stuname\":\"李元芝\",\"clazz\":\"软件工程1\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null},{\"studentid\":481,\"stuno\":\"201330330111\",\"stuname\":\"廖辉强\",\"clazz\":\"软件工程1\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null},{\"studentid\":482,\"stuno\":\"201330330112\",\"stuname\":\"林金锋\",\"clazz\":\"软件工程1\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null},{\"studentid\":483,\"stuno\":\"201330330113\",\"stuname\":\"林彦林\",\"clazz\":\"软件工程1\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null},{\"studentid\":486,\"stuno\":\"201330330116\",\"stuname\":\"罗毅豪\",\"clazz\":\"软件工程1\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null},{\"studentid\":488,\"stuno\":\"201330330118\",\"stuname\":\"彭颖志\",\"clazz\":\"软件工程1\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null},{\"studentid\":490,\"stuno\":\"201330330120\",\"stuname\":\"唐建明\",\"clazz\":\"软件工程1\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null},{\"studentid\":493,\"stuno\":\"201330330123\",\"stuname\":\"谢志茂\",\"clazz\":\"软件工程1\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null},{\"studentid\":495,\"stuno\":\"201330330125\",\"stuname\":\"张海娴\",\"clazz\":\"软件工程1\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null},{\"studentid\":496,\"stuno\":\"201330330126\",\"stuname\":\"张嘉明\",\"clazz\":\"软件工程1\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null},{\"studentid\":498,\"stuno\":\"201330330128\",\"stuname\":\"张维国\",\"clazz\":\"软件工程1\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null},{\"studentid\":499,\"stuno\":\"201330330129\",\"stuname\":\"招子贤\",\"clazz\":\"软件工程1\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null},{\"studentid\":500,\"stuno\":\"201330330130\",\"stuname\":\"赵若宸\",\"clazz\":\"软件工程1\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null},{\"studentid\":502,\"stuno\":\"201330330201\",\"stuname\":\"蔡丽勿\",\"clazz\":\"软件工程2\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null},{\"studentid\":503,\"stuno\":\"201330330202\",\"stuname\":\"陈楚萍\",\"clazz\":\"软件工程2\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null},{\"studentid\":504,\"stuno\":\"201330330203\",\"stuname\":\"陈健辉\",\"clazz\":\"软件工程2\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null},{\"studentid\":510,\"stuno\":\"201330330209\",\"stuname\":\"何熠辉\",\"clazz\":\"软件工程2\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null},{\"studentid\":511,\"stuno\":\"201330330210\",\"stuname\":\"黄磊\",\"clazz\":\"软件工程2\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null},{\"studentid\":512,\"stuno\":\"201330330211\",\"stuname\":\"黄媛\",\"clazz\":\"软件工程2\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null},{\"studentid\":514,\"stuno\":\"201330330213\",\"stuname\":\"梁志军\",\"clazz\":\"软件工程2\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null},{\"studentid\":517,\"stuno\":\"201330330216\",\"stuname\":\"邱诗婷\",\"clazz\":\"软件工程2\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null}]', '2017-09-28 00:00:00', null, null);
INSERT INTO `defense_group` VALUES ('57', '3', '26', '8', '0', null, null, null, '[{\"studentid\":518,\"stuno\":\"201330330218\",\"stuname\":\"吴骏鹏\",\"clazz\":\"软件工程2\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null},{\"studentid\":520,\"stuno\":\"201330330221\",\"stuname\":\"徐禹洪\",\"clazz\":\"软件工程2\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null},{\"studentid\":521,\"stuno\":\"201330330222\",\"stuname\":\"叶俊邦\",\"clazz\":\"软件工程2\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null},{\"studentid\":522,\"stuno\":\"201330330223\",\"stuname\":\"叶培湛\",\"clazz\":\"软件工程2\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null},{\"studentid\":526,\"stuno\":\"201330330227\",\"stuname\":\"曾少聪\",\"clazz\":\"软件工程2\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null},{\"studentid\":527,\"stuno\":\"201330330228\",\"stuname\":\"钟浩\",\"clazz\":\"软件工程2\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null},{\"studentid\":528,\"stuno\":\"201330330229\",\"stuname\":\"钟俊滨\",\"clazz\":\"软件工程2\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null},{\"studentid\":529,\"stuno\":\"201330330230\",\"stuname\":\"周文婷\",\"clazz\":\"软件工程2\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null},{\"studentid\":531,\"stuno\":\"201330330301\",\"stuname\":\"陈竟贤\",\"clazz\":\"软件工程3\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null},{\"studentid\":533,\"stuno\":\"201330330303\",\"stuname\":\"陈培丹\",\"clazz\":\"软件工程3\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null},{\"studentid\":534,\"stuno\":\"201330330304\",\"stuname\":\"单汶进\",\"clazz\":\"软件工程3\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null},{\"studentid\":536,\"stuno\":\"201330330306\",\"stuname\":\"杜惠英\",\"clazz\":\"软件工程3\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null},{\"studentid\":540,\"stuno\":\"201330330310\",\"stuname\":\"黄善荣\",\"clazz\":\"软件工程3\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null},{\"studentid\":541,\"stuno\":\"201330330311\",\"stuname\":\"黄友生\",\"clazz\":\"软件工程3\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null},{\"studentid\":542,\"stuno\":\"201330330313\",\"stuname\":\"劳伟文\",\"clazz\":\"软件工程3\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null},{\"studentid\":543,\"stuno\":\"201330330315\",\"stuname\":\"林帆\",\"clazz\":\"软件工程3\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null},{\"studentid\":544,\"stuno\":\"201330330316\",\"stuname\":\"林龙彪\",\"clazz\":\"软件工程3\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null},{\"studentid\":545,\"stuno\":\"201330330317\",\"stuname\":\"林楠\",\"clazz\":\"软件工程3\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null},{\"studentid\":546,\"stuno\":\"201330330318\",\"stuname\":\"林少正\",\"clazz\":\"软件工程3\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null},{\"studentid\":548,\"stuno\":\"201330330320\",\"stuname\":\"林泽鹤\",\"clazz\":\"软件工程3\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null},{\"studentid\":549,\"stuno\":\"201330330321\",\"stuname\":\"毛爱华\",\"clazz\":\"软件工程3\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null},{\"studentid\":550,\"stuno\":\"201330330322\",\"stuname\":\"慕丹琳\",\"clazz\":\"软件工程3\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null},{\"studentid\":551,\"stuno\":\"201330330323\",\"stuname\":\"王家永\",\"clazz\":\"软件工程3\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null},{\"studentid\":552,\"stuno\":\"201330330324\",\"stuname\":\"王开轩\",\"clazz\":\"软件工程3\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null},{\"studentid\":553,\"stuno\":\"201330330325\",\"stuname\":\"温宇恒\",\"clazz\":\"软件工程3\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null}]', '2017-09-28 00:00:00', null, null);
INSERT INTO `defense_group` VALUES ('58', '3', '26', '9', '0', null, null, null, '[{\"studentid\":554,\"stuno\":\"201330330326\",\"stuname\":\"严肇勇\",\"clazz\":\"软件工程3\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null},{\"studentid\":555,\"stuno\":\"201330330327\",\"stuname\":\"201330330327\",\"clazz\":\"软件工程3\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null},{\"studentid\":556,\"stuno\":\"201330330328\",\"stuname\":\"曾庆隆\",\"clazz\":\"软件工程3\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null},{\"studentid\":557,\"stuno\":\"201330330329\",\"stuname\":\"郑健震\",\"clazz\":\"软件工程3\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null},{\"studentid\":558,\"stuno\":\"201330330330\",\"stuname\":\"朱晓森\",\"clazz\":\"软件工程3\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null},{\"studentid\":559,\"stuno\":\"201330330401\",\"stuname\":\"敖广骏\",\"clazz\":\"软件工程4\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null},{\"studentid\":560,\"stuno\":\"201330330402\",\"stuname\":\"陈首论\",\"clazz\":\"软件工程4\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null},{\"studentid\":561,\"stuno\":\"201330330403\",\"stuname\":\"邓寿光\",\"clazz\":\"软件工程4\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null},{\"studentid\":562,\"stuno\":\"201330330404\",\"stuname\":\"黄宝源\",\"clazz\":\"软件工程4\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null},{\"studentid\":563,\"stuno\":\"201330330405\",\"stuname\":\"黄婷婷\",\"clazz\":\"软件工程4\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null},{\"studentid\":564,\"stuno\":\"201330330406\",\"stuname\":\"黄治民\",\"clazz\":\"软件工程4\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null},{\"studentid\":566,\"stuno\":\"201330330408\",\"stuname\":\"李梦仪\",\"clazz\":\"软件工程4\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null},{\"studentid\":567,\"stuno\":\"201330330410\",\"stuname\":\"李小辉\",\"clazz\":\"软件工程4\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null},{\"studentid\":569,\"stuno\":\"201330330412\",\"stuname\":\"林锦新\",\"clazz\":\"软件工程4\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null},{\"studentid\":570,\"stuno\":\"201330330413\",\"stuname\":\"林景富\",\"clazz\":\"软件工程4\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null},{\"studentid\":571,\"stuno\":\"201330330414\",\"stuname\":\"林少彪\",\"clazz\":\"软件工程4\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null},{\"studentid\":572,\"stuno\":\"201330330415\",\"stuname\":\"林智\",\"clazz\":\"软件工程4\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null},{\"studentid\":574,\"stuno\":\"201330330417\",\"stuname\":\"刘哲玮\",\"clazz\":\"软件工程4\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null},{\"studentid\":575,\"stuno\":\"201330330418\",\"stuname\":\"卢伟健\",\"clazz\":\"软件工程4\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null},{\"studentid\":576,\"stuno\":\"201330330419\",\"stuname\":\"宁崛峰\",\"clazz\":\"\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null},{\"studentid\":577,\"stuno\":\"201330330420\",\"stuname\":\"丘万洪\",\"clazz\":\"软件工程4\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null},{\"studentid\":579,\"stuno\":\"201330330422\",\"stuname\":\"阮文炜\",\"clazz\":\"软件工程4\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null},{\"studentid\":580,\"stuno\":\"201330330423\",\"stuname\":\"苏锐佳\",\"clazz\":\"软件工程4\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null},{\"studentid\":581,\"stuno\":\"201330330424\",\"stuname\":\"严成铭\",\"clazz\":\"软件工程4\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null},{\"studentid\":582,\"stuno\":\"201330330425\",\"stuname\":\"杨育镰\",\"clazz\":\"软件工程4\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null}]', '2017-09-28 00:00:00', null, null);
INSERT INTO `defense_group` VALUES ('59', '3', '26', '10', '0', '214', '209', null, '[{\"studentid\":583,\"stuno\":\"201330330426\",\"stuname\":\"杨志潮\",\"clazz\":\"软件工程4\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null},{\"studentid\":584,\"stuno\":\"201330330427\",\"stuname\":\"叶永成\",\"clazz\":\"软件工程4\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null},{\"studentid\":585,\"stuno\":\"201330330428\",\"stuname\":\"张家辉\",\"clazz\":\"软件工程4\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null},{\"studentid\":586,\"stuno\":\"201330330429\",\"stuname\":\"张应滨\",\"clazz\":\"软件工程4\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null},{\"studentid\":587,\"stuno\":\"201330330430\",\"stuname\":\"朱颖超\",\"clazz\":\"软件工程4\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null},{\"studentid\":588,\"stuno\":\"201330330431\",\"stuname\":\"卓新苗\",\"clazz\":\"软件工程4\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null},{\"studentid\":672,\"stuno\":\"201330340101\",\"stuname\":\"陈惠\",\"clazz\":\"软工R1\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null},{\"studentid\":673,\"stuno\":\"201330340102\",\"stuname\":\"陈健强\",\"clazz\":\"软工R1\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null},{\"studentid\":674,\"stuno\":\"201330340103\",\"stuname\":\"陈沃源\",\"clazz\":\"软工R1\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null},{\"studentid\":675,\"stuno\":\"201330340104\",\"stuname\":\"陈奕名\",\"clazz\":\"软工R1\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null},{\"studentid\":676,\"stuno\":\"201330340105\",\"stuname\":\"陈泽武\",\"clazz\":\"软工R1\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null},{\"studentid\":677,\"stuno\":\"201330340106\",\"stuname\":\"陈子加\",\"clazz\":\"软工R1\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null},{\"studentid\":678,\"stuno\":\"201330340107\",\"stuname\":\"韩思敏\",\"clazz\":\"软工R1\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null},{\"studentid\":680,\"stuno\":\"201330340109\",\"stuname\":\"黄嘉明\",\"clazz\":\"软工R1\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null},{\"studentid\":681,\"stuno\":\"201330340110\",\"stuname\":\"黄锦健\",\"clazz\":\"软工R1\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null},{\"studentid\":682,\"stuno\":\"201330340111\",\"stuname\":\"黎焱辉\",\"clazz\":\"软工R1\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null},{\"studentid\":683,\"stuno\":\"201330340112\",\"stuname\":\"黎志鸿\",\"clazz\":\"软工R1\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null},{\"studentid\":684,\"stuno\":\"201330340113\",\"stuname\":\"李佳洋\",\"clazz\":\"软工R1\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null},{\"studentid\":685,\"stuno\":\"201330340114\",\"stuname\":\"李圣杰\",\"clazz\":\"软工R1\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null},{\"studentid\":686,\"stuno\":\"201330340115\",\"stuname\":\"廖健\",\"clazz\":\"软工R1\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null},{\"studentid\":687,\"stuno\":\"201330340116\",\"stuname\":\"林恩禄\",\"clazz\":\"软工R1\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null},{\"studentid\":688,\"stuno\":\"201330340117\",\"stuname\":\"林浩鹏\",\"clazz\":\"软工R1\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null},{\"studentid\":689,\"stuno\":\"201330340118\",\"stuname\":\"林均煜\",\"clazz\":\"软工R1\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null},{\"studentid\":690,\"stuno\":\"201330340119\",\"stuname\":\"林曦\",\"clazz\":\"软工R1\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null},{\"studentid\":691,\"stuno\":\"201330340120\",\"stuname\":\"陆冰如\",\"clazz\":\"软工R1\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null}]', '2017-09-28 00:00:00', '', null);
INSERT INTO `defense_group` VALUES ('60', '3', '26', '11', '0', null, null, null, '[{\"studentid\":692,\"stuno\":\"201330340121\",\"stuname\":\"罗斌城\",\"clazz\":\"软工R1\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null},{\"studentid\":693,\"stuno\":\"201330340122\",\"stuname\":\"罗洋\",\"clazz\":\"软工R1\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null},{\"studentid\":694,\"stuno\":\"201330340123\",\"stuname\":\"潘颖斌\",\"clazz\":\"软工R1\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null},{\"studentid\":695,\"stuno\":\"201330340125\",\"stuname\":\"王一佳\",\"clazz\":\"软工R1\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null},{\"studentid\":696,\"stuno\":\"201330340126\",\"stuname\":\"吴家宜\",\"clazz\":\"软工R1\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null},{\"studentid\":697,\"stuno\":\"201330340127\",\"stuname\":\"吴植鹏\",\"clazz\":\"软工R1\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null},{\"studentid\":699,\"stuno\":\"201330340129\",\"stuname\":\"颜烈帆\",\"clazz\":\"软工R1\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null},{\"studentid\":700,\"stuno\":\"201330340130\",\"stuname\":\"杨仕文\",\"clazz\":\"软工R1\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null},{\"studentid\":701,\"stuno\":\"201330340131\",\"stuname\":\"杨育斌\",\"clazz\":\"软工R1\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null},{\"studentid\":702,\"stuno\":\"201330340132\",\"stuname\":\"张君泽\",\"clazz\":\"软工R1\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null},{\"studentid\":703,\"stuno\":\"201330340133\",\"stuname\":\"张森洋\",\"clazz\":\"软工R1\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null},{\"studentid\":704,\"stuno\":\"201330340134\",\"stuname\":\"郑昱文\",\"clazz\":\"软工R1\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null},{\"studentid\":706,\"stuno\":\"201330340201\",\"stuname\":\"陈名立\",\"clazz\":\"软工R2\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null},{\"studentid\":707,\"stuno\":\"201330340202\",\"stuname\":\"陈勇浩\",\"clazz\":\"软工R2\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null},{\"studentid\":708,\"stuno\":\"201330340203\",\"stuname\":\"陈宇翔\",\"clazz\":\"软工R2\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null},{\"studentid\":709,\"stuno\":\"201330340204\",\"stuname\":\"郭灏\",\"clazz\":\"软工R2\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null},{\"studentid\":710,\"stuno\":\"201330340205\",\"stuname\":\"胡金炜\",\"clazz\":\"软工R2\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null},{\"studentid\":711,\"stuno\":\"201330340206\",\"stuname\":\"黄嘉栋\",\"clazz\":\"软工R2\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null},{\"studentid\":712,\"stuno\":\"201330340207\",\"stuname\":\"黄建东\",\"clazz\":\"软工R2\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null},{\"studentid\":713,\"stuno\":\"201330340208\",\"stuname\":\"黄圣琨\",\"clazz\":\"软工R2\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null},{\"studentid\":714,\"stuno\":\"201330340209\",\"stuname\":\"李嘉乐\",\"clazz\":\"软工R2\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null},{\"studentid\":715,\"stuno\":\"201330340210\",\"stuname\":\"李书蔚\",\"clazz\":\"软工R2\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null},{\"studentid\":716,\"stuno\":\"201330340212\",\"stuname\":\"林宏\",\"clazz\":\"软工R2\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null},{\"studentid\":717,\"stuno\":\"201330340213\",\"stuname\":\"林景峰\",\"clazz\":\"软工R2\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null},{\"studentid\":718,\"stuno\":\"201330340214\",\"stuname\":\"林良福\",\"clazz\":\"软工R2\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null}]', '2017-09-28 00:00:00', null, null);
INSERT INTO `defense_group` VALUES ('61', '3', '26', '12', '0', null, null, null, '[{\"studentid\":719,\"stuno\":\"201330340215\",\"stuname\":\"刘付鸣\",\"clazz\":\"软工R2\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null},{\"studentid\":720,\"stuno\":\"201330340216\",\"stuname\":\"刘嘉健\",\"clazz\":\"软工R2\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null},{\"studentid\":721,\"stuno\":\"201330340217\",\"stuname\":\"莫鸿远\",\"clazz\":\"软工R2\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null},{\"studentid\":722,\"stuno\":\"201330340218\",\"stuname\":\"苏敏\",\"clazz\":\"软工R2\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null},{\"studentid\":723,\"stuno\":\"201330340219\",\"stuname\":\"吴伟贤\",\"clazz\":\"软工R2\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null},{\"studentid\":724,\"stuno\":\"201330340220\",\"stuname\":\"吴潇渊\",\"clazz\":\"软工R2\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null},{\"studentid\":725,\"stuno\":\"201330340221\",\"stuname\":\"吴晓锋\",\"clazz\":\"软工R2\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null},{\"studentid\":726,\"stuno\":\"201330340222\",\"stuname\":\"吴鑫\",\"clazz\":\"软工R2\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null},{\"studentid\":727,\"stuno\":\"201330340223\",\"stuname\":\"谢克冠\",\"clazz\":\"软工R2\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null},{\"studentid\":728,\"stuno\":\"201330340224\",\"stuname\":\"谢子扬\",\"clazz\":\"软工R2\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null},{\"studentid\":729,\"stuno\":\"201330340225\",\"stuname\":\"杨俊泉\",\"clazz\":\"软工R2\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null},{\"studentid\":730,\"stuno\":\"201330340226\",\"stuname\":\"叶子龙\",\"clazz\":\"软工R2\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null},{\"studentid\":731,\"stuno\":\"201330340227\",\"stuname\":\"俞林健\",\"clazz\":\"软工R2\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null},{\"studentid\":732,\"stuno\":\"201330340228\",\"stuname\":\"张碧露\",\"clazz\":\"软工R2\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null},{\"studentid\":733,\"stuno\":\"201330340230\",\"stuname\":\"张淑兰\",\"clazz\":\"软工R2\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null},{\"studentid\":734,\"stuno\":\"201330340231\",\"stuname\":\"赵文俊\",\"clazz\":\"软工R2\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null},{\"studentid\":735,\"stuno\":\"201330340232\",\"stuname\":\"钟俊辉\",\"clazz\":\"软工R2\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null},{\"studentid\":736,\"stuno\":\"201330340233\",\"stuname\":\"钟远星\",\"clazz\":\"软工R2\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null},{\"studentid\":737,\"stuno\":\"201330340234\",\"stuname\":\"庄于儿\",\"clazz\":\"软工R2\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null},{\"studentid\":738,\"stuno\":\"201330340301\",\"stuname\":\"蔡家荣\",\"clazz\":\"软工R3\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null},{\"studentid\":739,\"stuno\":\"201330340302\",\"stuname\":\"蔡嘉晨\",\"clazz\":\"软工R3\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null},{\"studentid\":740,\"stuno\":\"201330340303\",\"stuname\":\"陈德林\",\"clazz\":\"软工R3\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null},{\"studentid\":741,\"stuno\":\"201330340304\",\"stuname\":\"董灿佳\",\"clazz\":\"软工R3\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null},{\"studentid\":742,\"stuno\":\"201330340305\",\"stuname\":\"方锦德\",\"clazz\":\"软工R3\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null},{\"studentid\":743,\"stuno\":\"201330340306\",\"stuname\":\"顾浚源\",\"clazz\":\"软工R3\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null}]', '2017-09-28 00:00:00', null, null);
INSERT INTO `defense_group` VALUES ('62', '3', '26', '13', '0', null, null, null, '[{\"studentid\":744,\"stuno\":\"201330340308\",\"stuname\":\"黄倩婷\",\"clazz\":\"软工R3\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null},{\"studentid\":745,\"stuno\":\"201330340310\",\"stuname\":\"李锦\",\"clazz\":\"软工R3\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null},{\"studentid\":746,\"stuno\":\"201330340311\",\"stuname\":\"李晶晶\",\"clazz\":\"软工R3\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null},{\"studentid\":747,\"stuno\":\"201330340312\",\"stuname\":\"李伟豪\",\"clazz\":\"软工R3\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null},{\"studentid\":748,\"stuno\":\"201330340313\",\"stuname\":\"李一飞\",\"clazz\":\"软工R3\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null},{\"studentid\":749,\"stuno\":\"201330340314\",\"stuname\":\"梁铭\",\"clazz\":\"软工R3\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null},{\"studentid\":750,\"stuno\":\"201330340315\",\"stuname\":\"梁思源\",\"clazz\":\"软工R3\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null},{\"studentid\":751,\"stuno\":\"201330340316\",\"stuname\":\"廖旺辉\",\"clazz\":\"软工R3\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null},{\"studentid\":752,\"stuno\":\"201330340317\",\"stuname\":\"林博俊\",\"clazz\":\"软工R3\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null},{\"studentid\":753,\"stuno\":\"201330340318\",\"stuname\":\"林柱轩\",\"clazz\":\"软工R3\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null},{\"studentid\":754,\"stuno\":\"201330340319\",\"stuname\":\"吕文彬\",\"clazz\":\"软工R3\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null},{\"studentid\":755,\"stuno\":\"201330340320\",\"stuname\":\"任达\",\"clazz\":\"软工R3\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null},{\"studentid\":756,\"stuno\":\"201330340321\",\"stuname\":\"沈志铭\",\"clazz\":\"软工R3\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null},{\"studentid\":757,\"stuno\":\"201330340322\",\"stuname\":\"吴伟豪\",\"clazz\":\"软工R3\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null},{\"studentid\":758,\"stuno\":\"201330340323\",\"stuname\":\"伍均国\",\"clazz\":\"软工R3\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null},{\"studentid\":759,\"stuno\":\"201330340324\",\"stuname\":\"伍肇强\",\"clazz\":\"软工R3\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null},{\"studentid\":760,\"stuno\":\"201330340325\",\"stuname\":\"杨秋涛\",\"clazz\":\"软工R3\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null},{\"studentid\":761,\"stuno\":\"201330340326\",\"stuname\":\"曾俊阶\",\"clazz\":\"软工R3\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null},{\"studentid\":762,\"stuno\":\"201330340327\",\"stuname\":\"张彭杰\",\"clazz\":\"软工R3\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null},{\"studentid\":763,\"stuno\":\"201330340328\",\"stuname\":\"张伟伦\",\"clazz\":\"软工R3\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null},{\"studentid\":764,\"stuno\":\"201330340329\",\"stuname\":\"张镇涛\",\"clazz\":\"软工R3\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null},{\"studentid\":765,\"stuno\":\"201330340330\",\"stuname\":\"钟锐锋\",\"clazz\":\"软工R3\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null},{\"studentid\":766,\"stuno\":\"201330340331\",\"stuname\":\"钟文权\",\"clazz\":\"软工R3\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null},{\"studentid\":767,\"stuno\":\"201330340332\",\"stuname\":\"周嘉富\",\"clazz\":\"软工R3\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null},{\"studentid\":768,\"stuno\":\"201330340333\",\"stuname\":\"卓志炜\",\"clazz\":\"软工R3\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null}]', '2017-09-28 00:00:00', null, null);
INSERT INTO `defense_group` VALUES ('63', '3', '26', '14', '0', '208', '202', null, '[{\"studentid\":769,\"stuno\":\"201330340401\",\"stuname\":\"蔡杨超\",\"clazz\":\"软工R4\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null},{\"studentid\":770,\"stuno\":\"201330340402\",\"stuname\":\"陈孝民\",\"clazz\":\"软工R4\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null},{\"studentid\":771,\"stuno\":\"201330340403\",\"stuname\":\"陈尧庚\",\"clazz\":\"软工R4\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null},{\"studentid\":772,\"stuno\":\"201330340404\",\"stuname\":\"陈勇亮\",\"clazz\":\"软工R4\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null},{\"studentid\":773,\"stuno\":\"201330340405\",\"stuname\":\"成安安\",\"clazz\":\"软工R4\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null},{\"studentid\":774,\"stuno\":\"201330340407\",\"stuname\":\"冯配宾\",\"clazz\":\"软工R4\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null},{\"studentid\":775,\"stuno\":\"201330340408\",\"stuname\":\"何嘉荣\",\"clazz\":\"软工R4\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null},{\"studentid\":776,\"stuno\":\"201330340410\",\"stuname\":\"黄伟铭\",\"clazz\":\"软工R4\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null},{\"studentid\":777,\"stuno\":\"201330340411\",\"stuname\":\"兰阳佳\",\"clazz\":\"软工R4\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null},{\"studentid\":778,\"stuno\":\"201330340412\",\"stuname\":\"李英淦\",\"clazz\":\"软工R4\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null},{\"studentid\":779,\"stuno\":\"201330340413\",\"stuname\":\"梁志豪\",\"clazz\":\"软工R4\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null},{\"studentid\":780,\"stuno\":\"201330340414\",\"stuname\":\"林宝明\",\"clazz\":\"软工R4\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null},{\"studentid\":781,\"stuno\":\"201330340415\",\"stuname\":\"林力昂\",\"clazz\":\"软工R4\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null},{\"studentid\":782,\"stuno\":\"201330340416\",\"stuname\":\"刘泽妮\",\"clazz\":\"软工R4\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null},{\"studentid\":783,\"stuno\":\"201330340418\",\"stuname\":\"欧卓鸿\",\"clazz\":\"软工R4\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null},{\"studentid\":784,\"stuno\":\"201330340419\",\"stuname\":\"石云飞\",\"clazz\":\"软工R4\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null},{\"studentid\":785,\"stuno\":\"201330340420\",\"stuname\":\"宋奇星\",\"clazz\":\"软工R4\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null},{\"studentid\":787,\"stuno\":\"201330340422\",\"stuname\":\"王丛林\",\"clazz\":\"软工R4\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null},{\"studentid\":788,\"stuno\":\"201330340423\",\"stuname\":\"王友锐\",\"clazz\":\"软工R4\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null},{\"studentid\":790,\"stuno\":\"201330340426\",\"stuname\":\"许伟鹏\",\"clazz\":\"软工R4\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null},{\"studentid\":791,\"stuno\":\"201330340427\",\"stuname\":\"杨伟杰\",\"clazz\":\"软工R4\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null},{\"studentid\":792,\"stuno\":\"201330340428\",\"stuname\":\"姚怡虹\",\"clazz\":\"软工R4\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null},{\"studentid\":793,\"stuno\":\"201330340429\",\"stuname\":\"叶韦灼\",\"clazz\":\"软工R4\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null},{\"studentid\":794,\"stuno\":\"201330340430\",\"stuname\":\"叶绪创\",\"clazz\":\"软工R4\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null}]', '2017-09-28 00:00:00', '', null);
INSERT INTO `defense_group` VALUES ('66', '3', '26', '15', '2', null, null, null, '[{\"studentid\":863,\"stuno\":\"201231000521\",\"stuname\":\"宋宪灵\",\"clazz\":\"软工R2\",\"defenseStatus\":\"争优答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null}]', '2017-09-28 00:00:00', null, null);

-- ----------------------------
-- Table structure for defense_task
-- ----------------------------
DROP TABLE IF EXISTS `defense_task`;
CREATE TABLE `defense_task` (
  `id` bigint(10) NOT NULL AUTO_INCREMENT,
  `projectid` bigint(10) DEFAULT NULL COMMENT '论文工作id',
  `name` varchar(20) DEFAULT NULL COMMENT '答辩任务名称',
  `president` varchar(100) DEFAULT NULL COMMENT '答辩主席',
  `contact` varchar(100) DEFAULT NULL COMMENT '联系人',
  `remark` varchar(100) DEFAULT NULL COMMENT '备注',
  `nums` int(10) DEFAULT NULL COMMENT '答辩小组数',
  `excelnums` int(10) DEFAULT NULL COMMENT '争优组数量',
  `teachers` text COMMENT '参加老师,JSON格式，带ID、工号、姓名、职称',
  `students` text COMMENT '参加学生,JSON格式，带ID、学号、姓名、班级',
  `defensetime` datetime DEFAULT NULL COMMENT '答辩时间',
  `cdate` datetime DEFAULT NULL,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=27 DEFAULT CHARSET=utf8;

-- ----------------------------
-- Records of defense_task
-- ----------------------------
INSERT INTO `defense_task` VALUES ('17', '4', '2', '2', '2', '', '2', null, '[{\"teacherid\":24,\"account\":\"30001248\",\"userName\":\"陈炜颖\",\"titleName\":\"讲师\",\"titleLevel\":\"中级\"},{\"teacherid\":5,\"account\":\"30001763\",\"userName\":\"俞守华\",\"titleName\":\"教授\",\"titleLevel\":\"高级\"},{\"teacherid\":8,\"account\":\"30001791\",\"userName\":\"余平祥\",\"titleName\":\"讲师\",\"titleLevel\":\"中级\"},{\"teacherid\":9,\"account\":\"30001792\",\"userName\":\"吴春胤\",\"titleName\":\"讲师\",\"titleLevel\":\"中级\"},{\"teacherid\":26,\"account\":\"30001794\",\"userName\":\"曹咏\",\"titleName\":\"讲师\",\"titleLevel\":\"中级\"},{\"teacherid\":25,\"account\":\"30001795\",\"userName\":\"毛小娟\",\"titleName\":\"讲师\",\"titleLevel\":\"中级\"},{\"teacherid\":11,\"account\":\"30001796\",\"userName\":\"刘伟章\",\"titleName\":\"副教授\",\"titleLevel\":\"副高级\"},{\"teacherid\":27,\"account\":\"30001801\",\"userName\":\"韩方珍\",\"titleName\":\"实验师\",\"titleLevel\":\"中级\"},{\"teacherid\":10,\"account\":\"30001802\",\"userName\":\"杨振刚\",\"titleName\":\"副教授\",\"titleLevel\":\"副高级\"},{\"teacherid\":7,\"account\":\"30002435\",\"userName\":\"张建桃\",\"titleName\":\"副教授\",\"titleLevel\":\"副高级\"},{\"teacherid\":20,\"account\":\"30002447\",\"userName\":\"邓成剑\",\"titleName\":\"讲师\",\"titleLevel\":\"中级\"},{\"teacherid\":21,\"account\":\"30002448\",\"userName\":\"方永美\",\"titleName\":\"讲师\",\"titleLevel\":\"中级\"},{\"teacherid\":23,\"account\":\"30002449\",\"userName\":\"黄文玲\",\"titleName\":\"讲师\",\"titleLevel\":\"中级\"},{\"teacherid\":28,\"account\":\"30003085\",\"userName\":\"欧阳庆\",\"titleName\":\"实验师\",\"titleLevel\":\"中级\"},{\"teacherid\":4,\"account\":\"30003148\",\"userName\":\"陈建国\",\"titleName\":\"高级实验师\",\"titleLevel\":\"副高级\"},{\"teacherid\":22,\"account\":\"30003249\",\"userName\":\"凌立文\",\"titleName\":\"讲师\",\"titleLevel\":\"中级\"},{\"teacherid\":12,\"account\":\"30003250\",\"userName\":\"熊俊涛\",\"titleName\":\"副教授\",\"titleLevel\":\"副高级\"},{\"teacherid\":13,\"account\":\"30003479\",\"userName\":\"杨春\",\"titleName\":\"讲师\",\"titleLevel\":\"中级\"},{\"teacherid\":14,\"account\":\"30003938\",\"userName\":\"宋歌\",\"titleName\":\"讲师\",\"titleLevel\":\"中级\"},{\"teacherid\":6,\"account\":\"30003958\",\"userName\":\"张大斌\",\"titleName\":\"教授\",\"titleLevel\":\"高级\"},{\"teacherid\":16,\"account\":\"30004049\",\"userName\":\"刘昌余\",\"titleName\":\"讲师\",\"titleLevel\":\"中级\"},{\"teacherid\":15,\"account\":\"30004109\",\"userName\":\"张凯\",\"titleName\":\"讲师\",\"titleLevel\":\"中级\"},{\"teacherid\":17,\"account\":\"30004136\",\"userName\":\"骆威\",\"titleName\":\"讲师\",\"titleLevel\":\"中级\"},{\"teacherid\":18,\"account\":\"30004263\",\"userName\":\"韦婷婷\",\"titleName\":\"讲师\",\"titleLevel\":\"中级\"},{\"teacherid\":19,\"account\":\"30004327\",\"userName\":\"宋世领\",\"titleName\":\"讲师\",\"titleLevel\":\"中级\"}]', '[{\"studentid\":29,\"stuno\":\"201330810101\",\"stuname\":\"陈浩南\",\"clazz\":\"工业工程2班\",\"defenseStatus\":\"正常答辩\"},{\"studentid\":169,\"stuno\":\"201330850203\",\"stuname\":\"陈埸铖\",\"clazz\":\"工业工程2班\",\"defenseStatus\":\"正常答辩\"},{\"studentid\":175,\"stuno\":\"201330850209\",\"stuname\":\"黄城勤\",\"clazz\":\"工业工程2班\",\"defenseStatus\":\"正常答辩\"},{\"studentid\":136,\"stuno\":\"201330850101\",\"stuname\":\"白宏盛\",\"clazz\":\"工业工程1班\",\"defenseStatus\":\"正常答辩\"},{\"studentid\":137,\"stuno\":\"201330850102\",\"stuname\":\"陈嘉豪\",\"clazz\":\"工业工程1班\",\"defenseStatus\":\"正常答辩\"},{\"studentid\":140,\"stuno\":\"201330850105\",\"stuname\":\"方泳诗\",\"clazz\":\"工业工程1班\",\"defenseStatus\":\"正常答辩\"},{\"studentid\":156,\"stuno\":\"201330850124\",\"stuname\":\"吴思彬\",\"clazz\":\"工业工程1班\",\"defenseStatus\":\"正常答辩\"},{\"studentid\":160,\"stuno\":\"201330850128\",\"stuname\":\"谢义基\",\"clazz\":\"工业工程1班\",\"defenseStatus\":\"正常答辩\"},{\"studentid\":167,\"stuno\":\"201330850201\",\"stuname\":\"陈嘉进\",\"clazz\":\"工业工程2班\",\"defenseStatus\":\"正常答辩\"},{\"studentid\":168,\"stuno\":\"201330850202\",\"stuname\":\"陈雄威\",\"clazz\":\"工业工程2班\",\"defenseStatus\":\"正常答辩\"},{\"studentid\":173,\"stuno\":\"201330850207\",\"stuname\":\"何德麟\",\"clazz\":\"工业工程2班\",\"defenseStatus\":\"正常答辩\"},{\"studentid\":29,\"stuno\":\"201330810102\",\"stuname\":\"陈浩南\",\"clazz\":\"工业工程2班\",\"defenseStatus\":\"正常答辩\"}]', '2017-08-26 00:00:00', '2017-08-24 17:13:47');
INSERT INTO `defense_task` VALUES ('26', '3', '计算机测试', '黄琼', '铭凯', '哈哈', '15', '1', '[{\"teacherid\":202,\"account\":\"30001530\",\"userName\":\"郭艾侠\",\"titleName\":\"副教授\",\"titleLevel\":\"副高级\"},{\"teacherid\":203,\"account\":\"30001757\",\"userName\":\"邢仲璟\",\"titleName\":\"讲师\",\"titleLevel\":\"中级\"},{\"teacherid\":204,\"account\":\"30001765\",\"userName\":\"朱同林\",\"titleName\":\"教授\",\"titleLevel\":\"高级\"},{\"teacherid\":205,\"account\":\"30001766\",\"userName\":\"林丕源\",\"titleName\":\"教授\",\"titleLevel\":\"高级\"},{\"teacherid\":206,\"account\":\"30001767\",\"userName\":\"徐东风\",\"titleName\":\"副教授\",\"titleLevel\":\"副高级\"},{\"teacherid\":207,\"account\":\"30001768\",\"userName\":\"肖德琴\",\"titleName\":\"教授\",\"titleLevel\":\"高级\"},{\"teacherid\":208,\"account\":\"30001769\",\"userName\":\"刘财兴\",\"titleName\":\"教授\",\"titleLevel\":\"高级\"},{\"teacherid\":209,\"account\":\"30001777\",\"userName\":\"严尚维\",\"titleName\":\"副教授\",\"titleLevel\":\"副高级\"},{\"teacherid\":210,\"account\":\"30001778\",\"userName\":\"祝胜林\",\"titleName\":\"副教授\",\"titleLevel\":\"副高级\"},{\"teacherid\":211,\"account\":\"30001779\",\"userName\":\"陈浩磊\",\"titleName\":\"讲师\",\"titleLevel\":\"中级\"},{\"teacherid\":212,\"account\":\"30001780\",\"userName\":\"王美华\",\"titleName\":\"副教授\",\"titleLevel\":\"副高级\"},{\"teacherid\":213,\"account\":\"30001781\",\"userName\":\"田绪红\",\"titleName\":\"教授\",\"titleLevel\":\"高级\"},{\"teacherid\":214,\"account\":\"30001783\",\"userName\":\"孙微微\",\"titleName\":\"副教授\",\"titleLevel\":\"副高级\"},{\"teacherid\":215,\"account\":\"30001784\",\"userName\":\"章晓华\",\"titleName\":\"讲师\",\"titleLevel\":\"中级\"},{\"teacherid\":216,\"account\":\"30001785\",\"userName\":\"朱梅阶\",\"titleName\":\"副教授\",\"titleLevel\":\"副高级\"},{\"teacherid\":217,\"account\":\"30001786\",\"userName\":\"肖磊\",\"titleName\":\"副教授\",\"titleLevel\":\"副高级\"},{\"teacherid\":218,\"account\":\"30001788\",\"userName\":\"周敏\",\"titleName\":\"副教授\",\"titleLevel\":\"副高级\"},{\"teacherid\":219,\"account\":\"30001789\",\"userName\":\"王琴\",\"titleName\":\"副教授\",\"titleLevel\":\"副高级\"},{\"teacherid\":220,\"account\":\"30001798\",\"userName\":\"刘汉兴\",\"titleName\":\"讲师\",\"titleLevel\":\"中级\"},{\"teacherid\":222,\"account\":\"30001807\",\"userName\":\"方凤美\",\"titleName\":\"讲师\",\"titleLevel\":\"中级\"},{\"teacherid\":223,\"account\":\"30001808\",\"userName\":\"潘春华\",\"titleName\":\"讲师\",\"titleLevel\":\"中级\"},{\"teacherid\":224,\"account\":\"30001809\",\"userName\":\"张义青\",\"titleName\":\"讲师\",\"titleLevel\":\"中级\"},{\"teacherid\":225,\"account\":\"30001810\",\"userName\":\"尹令\",\"titleName\":\"副教授\",\"titleLevel\":\"副高级\"},{\"teacherid\":226,\"account\":\"30001811\",\"userName\":\"高月芳\",\"titleName\":\"副教授\",\"titleLevel\":\"副高级\"},{\"teacherid\":227,\"account\":\"30001812\",\"userName\":\"张丽霞\",\"titleName\":\"副教授\",\"titleLevel\":\"副高级\"},{\"teacherid\":228,\"account\":\"30001813\",\"userName\":\"万华\",\"titleName\":\"副教授\",\"titleLevel\":\"副高级\"},{\"teacherid\":229,\"account\":\"30001814\",\"userName\":\"王栋\",\"titleName\":\"副教授\",\"titleLevel\":\"副高级\"},{\"teacherid\":230,\"account\":\"30001815\",\"userName\":\"彭明明\",\"titleName\":\"讲师\",\"titleLevel\":\"中级\"},{\"teacherid\":231,\"account\":\"30001816\",\"userName\":\"郑婵\",\"titleName\":\"讲师\",\"titleLevel\":\"中级\"},{\"teacherid\":232,\"account\":\"30001818\",\"userName\":\"肖媚燕\",\"titleName\":\"实验师\",\"titleLevel\":\"中级\"},{\"teacherid\":233,\"account\":\"30001821\",\"userName\":\"杜治国\",\"titleName\":\"高级实验师\",\"titleLevel\":\"副高级\"},{\"teacherid\":234,\"account\":\"30001899\",\"userName\":\"陈孟娴\",\"titleName\":\"副教授\",\"titleLevel\":\"副高级\"},{\"teacherid\":236,\"account\":\"30002436\",\"userName\":\"张素敏\",\"titleName\":\"讲师\",\"titleLevel\":\"中级\"},{\"teacherid\":237,\"account\":\"30002437\",\"userName\":\"张春玲\",\"titleName\":\"讲师\",\"titleLevel\":\"中级\"},{\"teacherid\":238,\"account\":\"30002441\",\"userName\":\"涂淑琴\",\"titleName\":\"讲师\",\"titleLevel\":\"中级\"},{\"teacherid\":239,\"account\":\"30002442\",\"userName\":\"陈湘骥\",\"titleName\":\"讲师\",\"titleLevel\":\"中级\"},{\"teacherid\":240,\"account\":\"30002445\",\"userName\":\"姚金涛\",\"titleName\":\"副教授\",\"titleLevel\":\"副高级\"},{\"teacherid\":241,\"account\":\"30002452\",\"userName\":\"彭红星\",\"titleName\":\"副教授\",\"titleLevel\":\"副高级\"},{\"teacherid\":242,\"account\":\"30002453\",\"userName\":\"毛宜军\",\"titleName\":\"讲师\",\"titleLevel\":\"中级\"},{\"teacherid\":243,\"account\":\"30002454\",\"userName\":\"曹维\",\"titleName\":\"实验师\",\"titleLevel\":\"中级\"},{\"teacherid\":244,\"account\":\"30002489\",\"userName\":\"宋鸿陟\",\"titleName\":\"教授\",\"titleLevel\":\"高级\"},{\"teacherid\":245,\"account\":\"30002490\",\"userName\":\"綦羽\",\"titleName\":\"讲师\",\"titleLevel\":\"中级\"},{\"teacherid\":246,\"account\":\"30002678\",\"userName\":\"李西明\",\"titleName\":\"副教授\",\"titleLevel\":\"副高级\"},{\"teacherid\":247,\"account\":\"30002688\",\"userName\":\"陈琰\",\"titleName\":\"讲师\",\"titleLevel\":\"中级\"},{\"teacherid\":248,\"account\":\"30002689\",\"userName\":\"邝颖杰\",\"titleName\":\"讲师\",\"titleLevel\":\"中级\"},{\"teacherid\":249,\"account\":\"30002690\",\"userName\":\"梁云\",\"titleName\":\"副教授\",\"titleLevel\":\"副高级\"},{\"teacherid\":250,\"account\":\"30002692\",\"userName\":\"司国东\",\"titleName\":\"副教授\",\"titleLevel\":\"副高级\"},{\"teacherid\":251,\"account\":\"30002693\",\"userName\":\"万军洲\",\"titleName\":\"讲师\",\"titleLevel\":\"中级\"},{\"teacherid\":252,\"account\":\"30002696\",\"userName\":\"肖克辉\",\"titleName\":\"实验师\",\"titleLevel\":\"中级\"},{\"teacherid\":253,\"account\":\"30003008\",\"userName\":\"杨磊\",\"titleName\":\"讲师\",\"titleLevel\":\"中级\"},{\"teacherid\":254,\"account\":\"30003018\",\"userName\":\"马莎\",\"titleName\":\"副教授\",\"titleLevel\":\"副高级\"},{\"teacherid\":255,\"account\":\"30003020\",\"userName\":\"殷建军\",\"titleName\":\"讲师\",\"titleLevel\":\"中级\"},{\"teacherid\":256,\"account\":\"30003021\",\"userName\":\"杨秋妹\",\"titleName\":\"讲师\",\"titleLevel\":\"中级\"},{\"teacherid\":257,\"account\":\"30003247\",\"userName\":\"朱凯\",\"titleName\":\"讲师\",\"titleLevel\":\"中级\"},{\"teacherid\":258,\"account\":\"30003272\",\"userName\":\"曾玲\",\"titleName\":\"副教授\",\"titleLevel\":\"副高级\"},{\"teacherid\":259,\"account\":\"30003276\",\"userName\":\"梁早清\",\"titleName\":\"讲师\",\"titleLevel\":\"中级\"},{\"teacherid\":260,\"account\":\"30003277\",\"userName\":\"林旭东\",\"titleName\":\"副教授\",\"titleLevel\":\"副高级\"},{\"teacherid\":261,\"account\":\"30003325\",\"userName\":\"郭玉彬\",\"titleName\":\"副教授\",\"titleLevel\":\"副高级\"},{\"teacherid\":262,\"account\":\"30003384\",\"userName\":\"黄沛杰\",\"titleName\":\"副教授\",\"titleLevel\":\"副高级\"},{\"teacherid\":263,\"account\":\"30003385\",\"userName\":\"林毅申\",\"titleName\":\"讲师\",\"titleLevel\":\"中级\"},{\"teacherid\":264,\"account\":\"30003420\",\"userName\":\"李康顺\",\"titleName\":\"教授\",\"titleLevel\":\"高级\"},{\"teacherid\":265,\"account\":\"30003565\",\"userName\":\"王春桃\",\"titleName\":\"副教授\",\"titleLevel\":\"副高级\"},{\"teacherid\":266,\"account\":\"30003623\",\"userName\":\"黄琼\",\"titleName\":\"教授\",\"titleLevel\":\"高级\"},{\"teacherid\":267,\"account\":\"30003628\",\"userName\":\"吴理华\",\"titleName\":\"讲师\",\"titleLevel\":\"中级\"},{\"teacherid\":268,\"account\":\"30003696\",\"userName\":\"司徒浩臻\",\"titleName\":\"讲师\",\"titleLevel\":\"中级\"},{\"teacherid\":269,\"account\":\"30003786\",\"userName\":\"王金凤\",\"titleName\":\"讲师\",\"titleLevel\":\"中级\"},{\"teacherid\":270,\"account\":\"30003941\",\"userName\":\"边山\",\"titleName\":\"讲师\",\"titleLevel\":\"中级\"},{\"teacherid\":271,\"account\":\"30003980\",\"userName\":\"张猜\",\"titleName\":\"讲师\",\"titleLevel\":\"中级\"},{\"teacherid\":272,\"account\":\"30003982\",\"userName\":\"黄栋\",\"titleName\":\"讲师\",\"titleLevel\":\"中级\"},{\"teacherid\":273,\"account\":\"30003983\",\"userName\":\"孔元\",\"titleName\":\"讲师\",\"titleLevel\":\"中级\"},{\"teacherid\":274,\"account\":\"30004066\",\"userName\":\"陈霓\",\"titleName\":\"讲师\",\"titleLevel\":\"中级\"},{\"teacherid\":275,\"account\":\"30004117\",\"userName\":\"李舜鹏\",\"titleName\":\"实验师\",\"titleLevel\":\"中级\"},{\"teacherid\":276,\"account\":\"30004118\",\"userName\":\"彭利民\",\"titleName\":\"副教授\",\"titleLevel\":\"副高级\"},{\"teacherid\":279,\"account\":\"30004151\",\"userName\":\"崔金荣\",\"titleName\":\"讲师\",\"titleLevel\":\"中级\"},{\"teacherid\":864,\"account\":\"30004238\",\"userName\":\"李双娟\",\"titleName\":\"讲师\",\"titleLevel\":\"中级\"},{\"teacherid\":862,\"account\":\"30004260\",\"userName\":\"王国华\",\"titleName\":\"讲师\",\"titleLevel\":\"中级\"},{\"teacherid\":278,\"account\":\"30004297\",\"userName\":\"古万荣\",\"titleName\":\"讲师\",\"titleLevel\":\"中级\"},{\"teacherid\":277,\"account\":\"33003246\",\"userName\":\"冯健昭\",\"titleName\":\"讲师\",\"titleLevel\":\"中级\"}]', '[{\"studentid\":867,\"stuno\":\"201230690223\",\"stuname\":\"魏然立\",\"clazz\":\"软工2\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null},{\"studentid\":863,\"stuno\":\"201231000521\",\"stuname\":\"宋宪灵\",\"clazz\":\"软工R2\",\"defenseStatus\":\"争优答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null},{\"studentid\":866,\"stuno\":\"201231000827\",\"stuname\":\"王龙海\",\"clazz\":\"软工R5\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null},{\"studentid\":865,\"stuno\":\"201231001014\",\"stuname\":\"卢富源\",\"clazz\":\"软工R7\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null},{\"studentid\":671,\"stuno\":\"201330180221\",\"stuname\":\"苏湘堡\",\"clazz\":\"软工R1\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null},{\"studentid\":284,\"stuno\":\"201330320104\",\"stuname\":\"陈艳云\",\"clazz\":\"计算机1\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null},{\"studentid\":285,\"stuno\":\"201330320105\",\"stuname\":\"邓逸海\",\"clazz\":\"计算机1\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null},{\"studentid\":286,\"stuno\":\"201330320106\",\"stuname\":\"邓振鹏\",\"clazz\":\"计算机1\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null},{\"studentid\":287,\"stuno\":\"201330320107\",\"stuname\":\"韩诗云\",\"clazz\":\"计算机1\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null},{\"studentid\":288,\"stuno\":\"201330320108\",\"stuname\":\"胡越\",\"clazz\":\"计算机1\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null},{\"studentid\":289,\"stuno\":\"201330320109\",\"stuname\":\"黄嘉威\",\"clazz\":\"计算机1\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null},{\"studentid\":291,\"stuno\":\"201330320111\",\"stuname\":\"蓝小烨\",\"clazz\":\"计算机1\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null},{\"studentid\":293,\"stuno\":\"201330320113\",\"stuname\":\"李威威\",\"clazz\":\"计算机1\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null},{\"studentid\":294,\"stuno\":\"201330320115\",\"stuname\":\"林捷聪\",\"clazz\":\"计算机1\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null},{\"studentid\":296,\"stuno\":\"201330320117\",\"stuname\":\"罗发伟\",\"clazz\":\"计算机1\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null},{\"studentid\":297,\"stuno\":\"201330320118\",\"stuname\":\"谭伟丰\",\"clazz\":\"计算机1\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null},{\"studentid\":298,\"stuno\":\"201330320119\",\"stuname\":\"汤兰\",\"clazz\":\"计算机1\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null},{\"studentid\":299,\"stuno\":\"201330320120\",\"stuname\":\"吴艳倩\",\"clazz\":\"计算机1\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null},{\"studentid\":300,\"stuno\":\"201330320121\",\"stuname\":\"伍缙宇\",\"clazz\":\"计算机1\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null},{\"studentid\":301,\"stuno\":\"201330320123\",\"stuname\":\"严智林\",\"clazz\":\"计算机1\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null},{\"studentid\":303,\"stuno\":\"201330320125\",\"stuname\":\"杨添坤\",\"clazz\":\"计算机1\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null},{\"studentid\":304,\"stuno\":\"201330320126\",\"stuname\":\"张惠娜\",\"clazz\":\"计算机1\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null},{\"studentid\":306,\"stuno\":\"201330320128\",\"stuname\":\"钟义坚\",\"clazz\":\"计算机1\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null},{\"studentid\":307,\"stuno\":\"201330320130\",\"stuname\":\"周俊鹏\",\"clazz\":\"计算机1\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null},{\"studentid\":308,\"stuno\":\"201330320131\",\"stuname\":\"庄嘉豪\",\"clazz\":\"计算机1\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null},{\"studentid\":315,\"stuno\":\"201330320202\",\"stuname\":\"陈铎文\",\"clazz\":\"计算机2\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null},{\"studentid\":318,\"stuno\":\"201330320205\",\"stuname\":\"何桂康\",\"clazz\":\"计算机2\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null},{\"studentid\":321,\"stuno\":\"201330320208\",\"stuname\":\"黄伟杰\",\"clazz\":\"计算机2\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null},{\"studentid\":323,\"stuno\":\"201330320211\",\"stuname\":\"赖治成\",\"clazz\":\"计算机2\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null},{\"studentid\":324,\"stuno\":\"201330320213\",\"stuname\":\"李炳新\",\"clazz\":\"计算机2\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null},{\"studentid\":326,\"stuno\":\"201330320215\",\"stuname\":\"林城轩\",\"clazz\":\"计算机2\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null},{\"studentid\":327,\"stuno\":\"201330320216\",\"stuname\":\"林雅琪\",\"clazz\":\"2班\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null},{\"studentid\":310,\"stuno\":\"201330320217\",\"stuname\":\"刘宏德\",\"clazz\":\"计算机1\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null},{\"studentid\":328,\"stuno\":\"201330320218\",\"stuname\":\"刘铭坚\",\"clazz\":\"计算机2\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null},{\"studentid\":329,\"stuno\":\"201330320219\",\"stuname\":\"刘运传\",\"clazz\":\"计算机2\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null},{\"studentid\":311,\"stuno\":\"201330320220\",\"stuname\":\"彭熙\",\"clazz\":\"计算机1\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null},{\"studentid\":331,\"stuno\":\"201330320222\",\"stuname\":\"孙煜楷\",\"clazz\":\"计算机2\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null},{\"studentid\":332,\"stuno\":\"201330320223\",\"stuname\":\"萧敏惠\",\"clazz\":\"计算机2\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null},{\"studentid\":333,\"stuno\":\"201330320224\",\"stuname\":\"姚林镇\",\"clazz\":\"计算机2\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null},{\"studentid\":334,\"stuno\":\"201330320225\",\"stuname\":\"曾宏余\",\"clazz\":\"计算机2\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null},{\"studentid\":337,\"stuno\":\"201330320228\",\"stuname\":\"钟家明\",\"clazz\":\"计算机2\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null},{\"studentid\":338,\"stuno\":\"201330320229\",\"stuname\":\"周家智\",\"clazz\":\"计算机2\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null},{\"studentid\":339,\"stuno\":\"201330320231\",\"stuname\":\"周宇文\",\"clazz\":\"计算机2\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null},{\"studentid\":341,\"stuno\":\"201330320301\",\"stuname\":\"陈力键\",\"clazz\":\"计算机3\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null},{\"studentid\":342,\"stuno\":\"201330320302\",\"stuname\":\"陈晓朗\",\"clazz\":\"计算机3\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null},{\"studentid\":343,\"stuno\":\"201330320303\",\"stuname\":\"邓水凤\",\"clazz\":\"计算机3\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null},{\"studentid\":346,\"stuno\":\"201330320306\",\"stuname\":\"黄宇畅\",\"clazz\":\"计算机3\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null},{\"studentid\":347,\"stuno\":\"201330320308\",\"stuname\":\"黎骅德\",\"clazz\":\"计算机3\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null},{\"studentid\":348,\"stuno\":\"201330320309\",\"stuname\":\"李杰\",\"clazz\":\"计算机3\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null},{\"studentid\":349,\"stuno\":\"201330320310\",\"stuname\":\"李裕豪\",\"clazz\":\"计算机3\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null},{\"studentid\":352,\"stuno\":\"201330320313\",\"stuname\":\"刘兆坤\",\"clazz\":\"计算机3\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null},{\"studentid\":353,\"stuno\":\"201330320314\",\"stuname\":\"楼瑞文\",\"clazz\":\"计算机3\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null},{\"studentid\":355,\"stuno\":\"201330320316\",\"stuname\":\"彭威\",\"clazz\":\"计算机3\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null},{\"studentid\":356,\"stuno\":\"201330320317\",\"stuname\":\"谭春霞\",\"clazz\":\"计算机3\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null},{\"studentid\":357,\"stuno\":\"201330320318\",\"stuname\":\"唐操\",\"clazz\":\"计算机3\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null},{\"studentid\":358,\"stuno\":\"201330320319\",\"stuname\":\"温婷婷\",\"clazz\":\"计算机3\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null},{\"studentid\":359,\"stuno\":\"201330320320\",\"stuname\":\"吴立钦\",\"clazz\":\"计算机3\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null},{\"studentid\":360,\"stuno\":\"201330320321\",\"stuname\":\"谢秋颖\",\"clazz\":\"计算机3\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null},{\"studentid\":361,\"stuno\":\"201330320322\",\"stuname\":\"徐灿冰\",\"clazz\":\"计算机3\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null},{\"studentid\":362,\"stuno\":\"201330320323\",\"stuname\":\"尹从容\",\"clazz\":\"计算机3\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null},{\"studentid\":363,\"stuno\":\"201330320324\",\"stuname\":\"尹烽旭\",\"clazz\":\"计算机3\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null},{\"studentid\":365,\"stuno\":\"201330320326\",\"stuname\":\"曾晓翔\",\"clazz\":\"计算机3\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null},{\"studentid\":366,\"stuno\":\"201330320327\",\"stuname\":\"张威\",\"clazz\":\"计算机3\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null},{\"studentid\":367,\"stuno\":\"201330320328\",\"stuname\":\"张展康\",\"clazz\":\"计算机3\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null},{\"studentid\":368,\"stuno\":\"201330320329\",\"stuname\":\"赵敏敏\",\"clazz\":\"计算机3\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null},{\"studentid\":369,\"stuno\":\"201330320330\",\"stuname\":\"郑文龙\",\"clazz\":\"计算机3\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null},{\"studentid\":370,\"stuno\":\"201330320331\",\"stuname\":\"周家永\",\"clazz\":\"计算机3\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null},{\"studentid\":372,\"stuno\":\"201330320401\",\"stuname\":\"蔡睿\",\"clazz\":\"计算机4\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null},{\"studentid\":375,\"stuno\":\"201330320404\",\"stuname\":\"陈嘉滨\",\"clazz\":\"计算机4\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null},{\"studentid\":376,\"stuno\":\"201330320405\",\"stuname\":\"陈雪基\",\"clazz\":\"计算机4\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null},{\"studentid\":377,\"stuno\":\"201330320406\",\"stuname\":\"胡奕豪\",\"clazz\":\"计算机4\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null},{\"studentid\":378,\"stuno\":\"201330320407\",\"stuname\":\"黄琳琳\",\"clazz\":\"计算机4\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null},{\"studentid\":379,\"stuno\":\"201330320408\",\"stuname\":\"黎颖\",\"clazz\":\"计算机4\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null},{\"studentid\":380,\"stuno\":\"201330320409\",\"stuname\":\"梁颖怡\",\"clazz\":\"计算机4\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null},{\"studentid\":382,\"stuno\":\"201330320411\",\"stuname\":\"林智源\",\"clazz\":\"计算机4\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null},{\"studentid\":383,\"stuno\":\"201330320412\",\"stuname\":\"刘家辉\",\"clazz\":\"计算机4\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null},{\"studentid\":384,\"stuno\":\"201330320413\",\"stuname\":\"卢贵阳\",\"clazz\":\"计算机4\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null},{\"studentid\":385,\"stuno\":\"201330320414\",\"stuname\":\"陆慧杰\",\"clazz\":\"计算机4\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null},{\"studentid\":386,\"stuno\":\"201330320415\",\"stuname\":\"吕立特\",\"clazz\":\"计算机4\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null},{\"studentid\":388,\"stuno\":\"201330320417\",\"stuname\":\"201330320417\",\"clazz\":\"计算机4\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null},{\"studentid\":389,\"stuno\":\"201330320418\",\"stuname\":\"庞郁赢\",\"clazz\":\"计算机4\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null},{\"studentid\":390,\"stuno\":\"201330320419\",\"stuname\":\"饶家铭\",\"clazz\":\"计算机4\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null},{\"studentid\":391,\"stuno\":\"201330320420\",\"stuname\":\"涂清韶\",\"clazz\":\"计算机4\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null},{\"studentid\":392,\"stuno\":\"201330320421\",\"stuname\":\"王玲玲\",\"clazz\":\"计算机4\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null},{\"studentid\":393,\"stuno\":\"201330320422\",\"stuname\":\"邬鑫浩\",\"clazz\":\"计算机4\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null},{\"studentid\":394,\"stuno\":\"201330320423\",\"stuname\":\"杨梦瑶\",\"clazz\":\"计算机4\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null},{\"studentid\":395,\"stuno\":\"201330320424\",\"stuname\":\"叶康论\",\"clazz\":\"计算机4\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null},{\"studentid\":396,\"stuno\":\"201330320425\",\"stuname\":\"袁炜尧\",\"clazz\":\"计算机4\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null},{\"studentid\":397,\"stuno\":\"201330320426\",\"stuname\":\"曾增威\",\"clazz\":\"计算机4\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null},{\"studentid\":398,\"stuno\":\"201330320427\",\"stuname\":\"张兵\",\"clazz\":\"计算机4\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null},{\"studentid\":399,\"stuno\":\"201330320428\",\"stuname\":\"张焕旭\",\"clazz\":\"计算机4\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null},{\"studentid\":401,\"stuno\":\"201330320430\",\"stuname\":\"钟沛霖\",\"clazz\":\"计算机4\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null},{\"studentid\":402,\"stuno\":\"201330320431\",\"stuname\":\"钟卓伦\",\"clazz\":\"计算机4\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null},{\"studentid\":403,\"stuno\":\"201330320432\",\"stuname\":\"周展博\",\"clazz\":\"计算机4\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null},{\"studentid\":405,\"stuno\":\"201330320501\",\"stuname\":\"蔡家豪\",\"clazz\":\"计算机5\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null},{\"studentid\":406,\"stuno\":\"201330320503\",\"stuname\":\"陈俊旺\",\"clazz\":\"计算机5\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null},{\"studentid\":407,\"stuno\":\"201330320504\",\"stuname\":\"陈启贤\",\"clazz\":\"计算机5\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null},{\"studentid\":408,\"stuno\":\"201330320505\",\"stuname\":\"陈思敏\",\"clazz\":\"计算机5\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null},{\"studentid\":409,\"stuno\":\"201330320506\",\"stuname\":\"陈文玉\",\"clazz\":\"计算机5\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null},{\"studentid\":410,\"stuno\":\"201330320507\",\"stuname\":\"陈晓霞\",\"clazz\":\"计算机5\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null},{\"studentid\":411,\"stuno\":\"201330320508\",\"stuname\":\"陈学凡\",\"clazz\":\"计算机5\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null},{\"studentid\":412,\"stuno\":\"201330320509\",\"stuname\":\"陈正阳\",\"clazz\":\"计算机5\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null},{\"studentid\":413,\"stuno\":\"201330320510\",\"stuname\":\"成玉琪\",\"clazz\":\"计算机5\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null},{\"studentid\":414,\"stuno\":\"201330320511\",\"stuname\":\"何思音\",\"clazz\":\"计算机5\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null},{\"studentid\":415,\"stuno\":\"201330320512\",\"stuname\":\"黄宝多\",\"clazz\":\"计算机5\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null},{\"studentid\":416,\"stuno\":\"201330320513\",\"stuname\":\"黄家健\",\"clazz\":\"计算机5\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null},{\"studentid\":417,\"stuno\":\"201330320514\",\"stuname\":\"蓝佑金\",\"clazz\":\"计算机5\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null},{\"studentid\":418,\"stuno\":\"201330320515\",\"stuname\":\"李嘉龙\",\"clazz\":\"计算机5\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null},{\"studentid\":419,\"stuno\":\"201330320516\",\"stuname\":\"梁永坚\",\"clazz\":\"计算机5\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null},{\"studentid\":420,\"stuno\":\"201330320517\",\"stuname\":\"梁智颖\",\"clazz\":\"计算机5\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null},{\"studentid\":421,\"stuno\":\"201330320518\",\"stuname\":\"刘德炜\",\"clazz\":\"计算机5\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null},{\"studentid\":422,\"stuno\":\"201330320519\",\"stuname\":\"刘付文韬\",\"clazz\":\"计算机5\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null},{\"studentid\":423,\"stuno\":\"201330320520\",\"stuname\":\"201330320520\",\"clazz\":\"计算机5\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null},{\"studentid\":424,\"stuno\":\"201330320521\",\"stuname\":\"卢文辉\",\"clazz\":\"计算机5\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null},{\"studentid\":425,\"stuno\":\"201330320522\",\"stuname\":\"莫海麟\",\"clazz\":\"计算机5\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null},{\"studentid\":427,\"stuno\":\"201330320524\",\"stuname\":\"苏国龙\",\"clazz\":\"计算机5\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null},{\"studentid\":428,\"stuno\":\"201330320525\",\"stuname\":\"谭锐文\",\"clazz\":\"计算机5\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null},{\"studentid\":429,\"stuno\":\"201330320526\",\"stuname\":\"王达\",\"clazz\":\"计算机5\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null},{\"studentid\":430,\"stuno\":\"201330320527\",\"stuname\":\"王靖宇\",\"clazz\":\"计算机5\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null},{\"studentid\":431,\"stuno\":\"201330320528\",\"stuname\":\"叶伟鹏\",\"clazz\":\"计算机5\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null},{\"studentid\":432,\"stuno\":\"201330320529\",\"stuname\":\"詹夏城\",\"clazz\":\"计算机5\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null},{\"studentid\":434,\"stuno\":\"201330320531\",\"stuname\":\"郑荣欢\",\"clazz\":\"计算机5\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null},{\"studentid\":435,\"stuno\":\"201330320532\",\"stuname\":\"周宏滨\",\"clazz\":\"计算机5\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null},{\"studentid\":438,\"stuno\":\"201330320601\",\"stuname\":\"白佳琳\",\"clazz\":\"计算机6\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null},{\"studentid\":440,\"stuno\":\"201330320603\",\"stuname\":\"陈嘉兴\",\"clazz\":\"计算机6\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null},{\"studentid\":441,\"stuno\":\"201330320604\",\"stuname\":\"陈良柱\",\"clazz\":\"计算机6\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null},{\"studentid\":442,\"stuno\":\"201330320605\",\"stuname\":\"陈诗林\",\"clazz\":\"计算机6\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null},{\"studentid\":443,\"stuno\":\"201330320606\",\"stuname\":\"陈舒怡\",\"clazz\":\"计算机6\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null},{\"studentid\":444,\"stuno\":\"201330320607\",\"stuname\":\"郭紫航\",\"clazz\":\"计算机6\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null},{\"studentid\":445,\"stuno\":\"201330320608\",\"stuname\":\"郝凌霄\",\"clazz\":\"计算机6\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null},{\"studentid\":446,\"stuno\":\"201330320609\",\"stuname\":\"黄凤英\",\"clazz\":\"计算机6\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null},{\"studentid\":447,\"stuno\":\"201330320610\",\"stuname\":\"黄杰聪\",\"clazz\":\"计算机6\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null},{\"studentid\":448,\"stuno\":\"201330320611\",\"stuname\":\"柯文涛\",\"clazz\":\"计算机6\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null},{\"studentid\":449,\"stuno\":\"201330320612\",\"stuname\":\"柯振旭\",\"clazz\":\"计算机6\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null},{\"studentid\":450,\"stuno\":\"201330320613\",\"stuname\":\"孔耀烺\",\"clazz\":\"计算机6\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null},{\"studentid\":451,\"stuno\":\"201330320614\",\"stuname\":\"赖远新\",\"clazz\":\"计算机6\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null},{\"studentid\":452,\"stuno\":\"201330320615\",\"stuname\":\"赖智辉\",\"clazz\":\"计算机6\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null},{\"studentid\":453,\"stuno\":\"201330320616\",\"stuname\":\"李东泽\",\"clazz\":\"计算机6\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null},{\"studentid\":454,\"stuno\":\"201330320617\",\"stuname\":\"李金鹏\",\"clazz\":\"计算机6\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null},{\"studentid\":455,\"stuno\":\"201330320618\",\"stuname\":\"林督翔\",\"clazz\":\"计算机6\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null},{\"studentid\":456,\"stuno\":\"201330320619\",\"stuname\":\"林明键\",\"clazz\":\"计算机6\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null},{\"studentid\":457,\"stuno\":\"201330320620\",\"stuname\":\"卢洪俊\",\"clazz\":\"计算机6\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null},{\"studentid\":458,\"stuno\":\"201330320621\",\"stuname\":\"彭海聪\",\"clazz\":\"计算机6\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null},{\"studentid\":459,\"stuno\":\"201330320622\",\"stuname\":\"彭鹏辉\",\"clazz\":\"计算机6\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null},{\"studentid\":461,\"stuno\":\"201330320624\",\"stuname\":\"吴文涛\",\"clazz\":\"计算机6\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null},{\"studentid\":462,\"stuno\":\"201330320625\",\"stuname\":\"谢晨诺\",\"clazz\":\"计算机6\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null},{\"studentid\":463,\"stuno\":\"201330320626\",\"stuname\":\"严敏玲\",\"clazz\":\"计算机6\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null},{\"studentid\":464,\"stuno\":\"201330320627\",\"stuname\":\"余镇邦\",\"clazz\":\"计算机6\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null},{\"studentid\":466,\"stuno\":\"201330320629\",\"stuname\":\"翟志伟\",\"clazz\":\"计算机6\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null},{\"studentid\":467,\"stuno\":\"201330320630\",\"stuname\":\"张晋荣\",\"clazz\":\"计算机6\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null},{\"studentid\":473,\"stuno\":\"201330330103\",\"stuname\":\"何宇虹\",\"clazz\":\"软件工程1\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null},{\"studentid\":476,\"stuno\":\"201330330106\",\"stuname\":\"黄锵嘉\",\"clazz\":\"软件工程1\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null},{\"studentid\":480,\"stuno\":\"201330330110\",\"stuname\":\"李元芝\",\"clazz\":\"软件工程1\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null},{\"studentid\":481,\"stuno\":\"201330330111\",\"stuname\":\"廖辉强\",\"clazz\":\"软件工程1\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null},{\"studentid\":482,\"stuno\":\"201330330112\",\"stuname\":\"林金锋\",\"clazz\":\"软件工程1\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null},{\"studentid\":483,\"stuno\":\"201330330113\",\"stuname\":\"林彦林\",\"clazz\":\"软件工程1\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null},{\"studentid\":486,\"stuno\":\"201330330116\",\"stuname\":\"罗毅豪\",\"clazz\":\"软件工程1\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null},{\"studentid\":488,\"stuno\":\"201330330118\",\"stuname\":\"彭颖志\",\"clazz\":\"软件工程1\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null},{\"studentid\":490,\"stuno\":\"201330330120\",\"stuname\":\"唐建明\",\"clazz\":\"软件工程1\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null},{\"studentid\":493,\"stuno\":\"201330330123\",\"stuname\":\"谢志茂\",\"clazz\":\"软件工程1\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null},{\"studentid\":495,\"stuno\":\"201330330125\",\"stuname\":\"张海娴\",\"clazz\":\"软件工程1\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null},{\"studentid\":496,\"stuno\":\"201330330126\",\"stuname\":\"张嘉明\",\"clazz\":\"软件工程1\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null},{\"studentid\":498,\"stuno\":\"201330330128\",\"stuname\":\"张维国\",\"clazz\":\"软件工程1\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null},{\"studentid\":499,\"stuno\":\"201330330129\",\"stuname\":\"招子贤\",\"clazz\":\"软件工程1\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null},{\"studentid\":500,\"stuno\":\"201330330130\",\"stuname\":\"赵若宸\",\"clazz\":\"软件工程1\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null},{\"studentid\":502,\"stuno\":\"201330330201\",\"stuname\":\"蔡丽勿\",\"clazz\":\"软件工程2\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null},{\"studentid\":503,\"stuno\":\"201330330202\",\"stuname\":\"陈楚萍\",\"clazz\":\"软件工程2\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null},{\"studentid\":504,\"stuno\":\"201330330203\",\"stuname\":\"陈健辉\",\"clazz\":\"软件工程2\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null},{\"studentid\":510,\"stuno\":\"201330330209\",\"stuname\":\"何熠辉\",\"clazz\":\"软件工程2\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null},{\"studentid\":511,\"stuno\":\"201330330210\",\"stuname\":\"黄磊\",\"clazz\":\"软件工程2\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null},{\"studentid\":512,\"stuno\":\"201330330211\",\"stuname\":\"黄媛\",\"clazz\":\"软件工程2\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null},{\"studentid\":514,\"stuno\":\"201330330213\",\"stuname\":\"梁志军\",\"clazz\":\"软件工程2\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null},{\"studentid\":517,\"stuno\":\"201330330216\",\"stuname\":\"邱诗婷\",\"clazz\":\"软件工程2\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null},{\"studentid\":518,\"stuno\":\"201330330218\",\"stuname\":\"吴骏鹏\",\"clazz\":\"软件工程2\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null},{\"studentid\":520,\"stuno\":\"201330330221\",\"stuname\":\"徐禹洪\",\"clazz\":\"软件工程2\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null},{\"studentid\":521,\"stuno\":\"201330330222\",\"stuname\":\"叶俊邦\",\"clazz\":\"软件工程2\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null},{\"studentid\":522,\"stuno\":\"201330330223\",\"stuname\":\"叶培湛\",\"clazz\":\"软件工程2\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null},{\"studentid\":526,\"stuno\":\"201330330227\",\"stuname\":\"曾少聪\",\"clazz\":\"软件工程2\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null},{\"studentid\":527,\"stuno\":\"201330330228\",\"stuname\":\"钟浩\",\"clazz\":\"软件工程2\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null},{\"studentid\":528,\"stuno\":\"201330330229\",\"stuname\":\"钟俊滨\",\"clazz\":\"软件工程2\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null},{\"studentid\":529,\"stuno\":\"201330330230\",\"stuname\":\"周文婷\",\"clazz\":\"软件工程2\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null},{\"studentid\":531,\"stuno\":\"201330330301\",\"stuname\":\"陈竟贤\",\"clazz\":\"软件工程3\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null},{\"studentid\":533,\"stuno\":\"201330330303\",\"stuname\":\"陈培丹\",\"clazz\":\"软件工程3\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null},{\"studentid\":534,\"stuno\":\"201330330304\",\"stuname\":\"单汶进\",\"clazz\":\"软件工程3\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null},{\"studentid\":536,\"stuno\":\"201330330306\",\"stuname\":\"杜惠英\",\"clazz\":\"软件工程3\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null},{\"studentid\":540,\"stuno\":\"201330330310\",\"stuname\":\"黄善荣\",\"clazz\":\"软件工程3\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null},{\"studentid\":541,\"stuno\":\"201330330311\",\"stuname\":\"黄友生\",\"clazz\":\"软件工程3\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null},{\"studentid\":542,\"stuno\":\"201330330313\",\"stuname\":\"劳伟文\",\"clazz\":\"软件工程3\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null},{\"studentid\":543,\"stuno\":\"201330330315\",\"stuname\":\"林帆\",\"clazz\":\"软件工程3\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null},{\"studentid\":544,\"stuno\":\"201330330316\",\"stuname\":\"林龙彪\",\"clazz\":\"软件工程3\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null},{\"studentid\":545,\"stuno\":\"201330330317\",\"stuname\":\"林楠\",\"clazz\":\"软件工程3\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null},{\"studentid\":546,\"stuno\":\"201330330318\",\"stuname\":\"林少正\",\"clazz\":\"软件工程3\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null},{\"studentid\":548,\"stuno\":\"201330330320\",\"stuname\":\"林泽鹤\",\"clazz\":\"软件工程3\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null},{\"studentid\":549,\"stuno\":\"201330330321\",\"stuname\":\"毛爱华\",\"clazz\":\"软件工程3\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null},{\"studentid\":550,\"stuno\":\"201330330322\",\"stuname\":\"慕丹琳\",\"clazz\":\"软件工程3\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null},{\"studentid\":551,\"stuno\":\"201330330323\",\"stuname\":\"王家永\",\"clazz\":\"软件工程3\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null},{\"studentid\":552,\"stuno\":\"201330330324\",\"stuname\":\"王开轩\",\"clazz\":\"软件工程3\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null},{\"studentid\":553,\"stuno\":\"201330330325\",\"stuname\":\"温宇恒\",\"clazz\":\"软件工程3\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null},{\"studentid\":554,\"stuno\":\"201330330326\",\"stuname\":\"严肇勇\",\"clazz\":\"软件工程3\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null},{\"studentid\":555,\"stuno\":\"201330330327\",\"stuname\":\"201330330327\",\"clazz\":\"软件工程3\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null},{\"studentid\":556,\"stuno\":\"201330330328\",\"stuname\":\"曾庆隆\",\"clazz\":\"软件工程3\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null},{\"studentid\":557,\"stuno\":\"201330330329\",\"stuname\":\"郑健震\",\"clazz\":\"软件工程3\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null},{\"studentid\":558,\"stuno\":\"201330330330\",\"stuname\":\"朱晓森\",\"clazz\":\"软件工程3\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null},{\"studentid\":559,\"stuno\":\"201330330401\",\"stuname\":\"敖广骏\",\"clazz\":\"软件工程4\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null},{\"studentid\":560,\"stuno\":\"201330330402\",\"stuname\":\"陈首论\",\"clazz\":\"软件工程4\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null},{\"studentid\":561,\"stuno\":\"201330330403\",\"stuname\":\"邓寿光\",\"clazz\":\"软件工程4\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null},{\"studentid\":562,\"stuno\":\"201330330404\",\"stuname\":\"黄宝源\",\"clazz\":\"软件工程4\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null},{\"studentid\":563,\"stuno\":\"201330330405\",\"stuname\":\"黄婷婷\",\"clazz\":\"软件工程4\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null},{\"studentid\":564,\"stuno\":\"201330330406\",\"stuname\":\"黄治民\",\"clazz\":\"软件工程4\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null},{\"studentid\":566,\"stuno\":\"201330330408\",\"stuname\":\"李梦仪\",\"clazz\":\"软件工程4\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null},{\"studentid\":567,\"stuno\":\"201330330410\",\"stuname\":\"李小辉\",\"clazz\":\"软件工程4\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null},{\"studentid\":569,\"stuno\":\"201330330412\",\"stuname\":\"林锦新\",\"clazz\":\"软件工程4\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null},{\"studentid\":570,\"stuno\":\"201330330413\",\"stuname\":\"林景富\",\"clazz\":\"软件工程4\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null},{\"studentid\":571,\"stuno\":\"201330330414\",\"stuname\":\"林少彪\",\"clazz\":\"软件工程4\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null},{\"studentid\":572,\"stuno\":\"201330330415\",\"stuname\":\"林智\",\"clazz\":\"软件工程4\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null},{\"studentid\":574,\"stuno\":\"201330330417\",\"stuname\":\"刘哲玮\",\"clazz\":\"软件工程4\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null},{\"studentid\":575,\"stuno\":\"201330330418\",\"stuname\":\"卢伟健\",\"clazz\":\"软件工程4\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null},{\"studentid\":576,\"stuno\":\"201330330419\",\"stuname\":\"宁崛峰\",\"clazz\":\"\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null},{\"studentid\":577,\"stuno\":\"201330330420\",\"stuname\":\"丘万洪\",\"clazz\":\"软件工程4\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null},{\"studentid\":579,\"stuno\":\"201330330422\",\"stuname\":\"阮文炜\",\"clazz\":\"软件工程4\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null},{\"studentid\":580,\"stuno\":\"201330330423\",\"stuname\":\"苏锐佳\",\"clazz\":\"软件工程4\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null},{\"studentid\":581,\"stuno\":\"201330330424\",\"stuname\":\"严成铭\",\"clazz\":\"软件工程4\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null},{\"studentid\":582,\"stuno\":\"201330330425\",\"stuname\":\"杨育镰\",\"clazz\":\"软件工程4\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null},{\"studentid\":583,\"stuno\":\"201330330426\",\"stuname\":\"杨志潮\",\"clazz\":\"软件工程4\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null},{\"studentid\":584,\"stuno\":\"201330330427\",\"stuname\":\"叶永成\",\"clazz\":\"软件工程4\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null},{\"studentid\":585,\"stuno\":\"201330330428\",\"stuname\":\"张家辉\",\"clazz\":\"软件工程4\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null},{\"studentid\":586,\"stuno\":\"201330330429\",\"stuname\":\"张应滨\",\"clazz\":\"软件工程4\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null},{\"studentid\":587,\"stuno\":\"201330330430\",\"stuname\":\"朱颖超\",\"clazz\":\"软件工程4\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null},{\"studentid\":588,\"stuno\":\"201330330431\",\"stuname\":\"卓新苗\",\"clazz\":\"软件工程4\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null},{\"studentid\":672,\"stuno\":\"201330340101\",\"stuname\":\"陈惠\",\"clazz\":\"软工R1\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null},{\"studentid\":673,\"stuno\":\"201330340102\",\"stuname\":\"陈健强\",\"clazz\":\"软工R1\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null},{\"studentid\":674,\"stuno\":\"201330340103\",\"stuname\":\"陈沃源\",\"clazz\":\"软工R1\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null},{\"studentid\":675,\"stuno\":\"201330340104\",\"stuname\":\"陈奕名\",\"clazz\":\"软工R1\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null},{\"studentid\":676,\"stuno\":\"201330340105\",\"stuname\":\"陈泽武\",\"clazz\":\"软工R1\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null},{\"studentid\":677,\"stuno\":\"201330340106\",\"stuname\":\"陈子加\",\"clazz\":\"软工R1\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null},{\"studentid\":678,\"stuno\":\"201330340107\",\"stuname\":\"韩思敏\",\"clazz\":\"软工R1\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null},{\"studentid\":680,\"stuno\":\"201330340109\",\"stuname\":\"黄嘉明\",\"clazz\":\"软工R1\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null},{\"studentid\":681,\"stuno\":\"201330340110\",\"stuname\":\"黄锦健\",\"clazz\":\"软工R1\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null},{\"studentid\":682,\"stuno\":\"201330340111\",\"stuname\":\"黎焱辉\",\"clazz\":\"软工R1\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null},{\"studentid\":683,\"stuno\":\"201330340112\",\"stuname\":\"黎志鸿\",\"clazz\":\"软工R1\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null},{\"studentid\":684,\"stuno\":\"201330340113\",\"stuname\":\"李佳洋\",\"clazz\":\"软工R1\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null},{\"studentid\":685,\"stuno\":\"201330340114\",\"stuname\":\"李圣杰\",\"clazz\":\"软工R1\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null},{\"studentid\":686,\"stuno\":\"201330340115\",\"stuname\":\"廖健\",\"clazz\":\"软工R1\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null},{\"studentid\":687,\"stuno\":\"201330340116\",\"stuname\":\"林恩禄\",\"clazz\":\"软工R1\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null},{\"studentid\":688,\"stuno\":\"201330340117\",\"stuname\":\"林浩鹏\",\"clazz\":\"软工R1\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null},{\"studentid\":689,\"stuno\":\"201330340118\",\"stuname\":\"林均煜\",\"clazz\":\"软工R1\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null},{\"studentid\":690,\"stuno\":\"201330340119\",\"stuname\":\"林曦\",\"clazz\":\"软工R1\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null},{\"studentid\":691,\"stuno\":\"201330340120\",\"stuname\":\"陆冰如\",\"clazz\":\"软工R1\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null},{\"studentid\":692,\"stuno\":\"201330340121\",\"stuname\":\"罗斌城\",\"clazz\":\"软工R1\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null},{\"studentid\":693,\"stuno\":\"201330340122\",\"stuname\":\"罗洋\",\"clazz\":\"软工R1\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null},{\"studentid\":694,\"stuno\":\"201330340123\",\"stuname\":\"潘颖斌\",\"clazz\":\"软工R1\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null},{\"studentid\":695,\"stuno\":\"201330340125\",\"stuname\":\"王一佳\",\"clazz\":\"软工R1\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null},{\"studentid\":696,\"stuno\":\"201330340126\",\"stuname\":\"吴家宜\",\"clazz\":\"软工R1\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null},{\"studentid\":697,\"stuno\":\"201330340127\",\"stuname\":\"吴植鹏\",\"clazz\":\"软工R1\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null},{\"studentid\":699,\"stuno\":\"201330340129\",\"stuname\":\"颜烈帆\",\"clazz\":\"软工R1\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null},{\"studentid\":700,\"stuno\":\"201330340130\",\"stuname\":\"杨仕文\",\"clazz\":\"软工R1\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null},{\"studentid\":701,\"stuno\":\"201330340131\",\"stuname\":\"杨育斌\",\"clazz\":\"软工R1\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null},{\"studentid\":702,\"stuno\":\"201330340132\",\"stuname\":\"张君泽\",\"clazz\":\"软工R1\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null},{\"studentid\":703,\"stuno\":\"201330340133\",\"stuname\":\"张森洋\",\"clazz\":\"软工R1\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null},{\"studentid\":704,\"stuno\":\"201330340134\",\"stuname\":\"郑昱文\",\"clazz\":\"软工R1\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null},{\"studentid\":706,\"stuno\":\"201330340201\",\"stuname\":\"陈名立\",\"clazz\":\"软工R2\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null},{\"studentid\":707,\"stuno\":\"201330340202\",\"stuname\":\"陈勇浩\",\"clazz\":\"软工R2\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null},{\"studentid\":708,\"stuno\":\"201330340203\",\"stuname\":\"陈宇翔\",\"clazz\":\"软工R2\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null},{\"studentid\":709,\"stuno\":\"201330340204\",\"stuname\":\"郭灏\",\"clazz\":\"软工R2\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null},{\"studentid\":710,\"stuno\":\"201330340205\",\"stuname\":\"胡金炜\",\"clazz\":\"软工R2\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null},{\"studentid\":711,\"stuno\":\"201330340206\",\"stuname\":\"黄嘉栋\",\"clazz\":\"软工R2\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null},{\"studentid\":712,\"stuno\":\"201330340207\",\"stuname\":\"黄建东\",\"clazz\":\"软工R2\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null},{\"studentid\":713,\"stuno\":\"201330340208\",\"stuname\":\"黄圣琨\",\"clazz\":\"软工R2\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null},{\"studentid\":714,\"stuno\":\"201330340209\",\"stuname\":\"李嘉乐\",\"clazz\":\"软工R2\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null},{\"studentid\":715,\"stuno\":\"201330340210\",\"stuname\":\"李书蔚\",\"clazz\":\"软工R2\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null},{\"studentid\":716,\"stuno\":\"201330340212\",\"stuname\":\"林宏\",\"clazz\":\"软工R2\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null},{\"studentid\":717,\"stuno\":\"201330340213\",\"stuname\":\"林景峰\",\"clazz\":\"软工R2\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null},{\"studentid\":718,\"stuno\":\"201330340214\",\"stuname\":\"林良福\",\"clazz\":\"软工R2\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null},{\"studentid\":719,\"stuno\":\"201330340215\",\"stuname\":\"刘付鸣\",\"clazz\":\"软工R2\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null},{\"studentid\":720,\"stuno\":\"201330340216\",\"stuname\":\"刘嘉健\",\"clazz\":\"软工R2\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null},{\"studentid\":721,\"stuno\":\"201330340217\",\"stuname\":\"莫鸿远\",\"clazz\":\"软工R2\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null},{\"studentid\":722,\"stuno\":\"201330340218\",\"stuname\":\"苏敏\",\"clazz\":\"软工R2\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null},{\"studentid\":723,\"stuno\":\"201330340219\",\"stuname\":\"吴伟贤\",\"clazz\":\"软工R2\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null},{\"studentid\":724,\"stuno\":\"201330340220\",\"stuname\":\"吴潇渊\",\"clazz\":\"软工R2\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null},{\"studentid\":725,\"stuno\":\"201330340221\",\"stuname\":\"吴晓锋\",\"clazz\":\"软工R2\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null},{\"studentid\":726,\"stuno\":\"201330340222\",\"stuname\":\"吴鑫\",\"clazz\":\"软工R2\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null},{\"studentid\":727,\"stuno\":\"201330340223\",\"stuname\":\"谢克冠\",\"clazz\":\"软工R2\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null},{\"studentid\":728,\"stuno\":\"201330340224\",\"stuname\":\"谢子扬\",\"clazz\":\"软工R2\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null},{\"studentid\":729,\"stuno\":\"201330340225\",\"stuname\":\"杨俊泉\",\"clazz\":\"软工R2\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null},{\"studentid\":730,\"stuno\":\"201330340226\",\"stuname\":\"叶子龙\",\"clazz\":\"软工R2\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null},{\"studentid\":731,\"stuno\":\"201330340227\",\"stuname\":\"俞林健\",\"clazz\":\"软工R2\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null},{\"studentid\":732,\"stuno\":\"201330340228\",\"stuname\":\"张碧露\",\"clazz\":\"软工R2\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null},{\"studentid\":733,\"stuno\":\"201330340230\",\"stuname\":\"张淑兰\",\"clazz\":\"软工R2\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null},{\"studentid\":734,\"stuno\":\"201330340231\",\"stuname\":\"赵文俊\",\"clazz\":\"软工R2\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null},{\"studentid\":735,\"stuno\":\"201330340232\",\"stuname\":\"钟俊辉\",\"clazz\":\"软工R2\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null},{\"studentid\":736,\"stuno\":\"201330340233\",\"stuname\":\"钟远星\",\"clazz\":\"软工R2\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null},{\"studentid\":737,\"stuno\":\"201330340234\",\"stuname\":\"庄于儿\",\"clazz\":\"软工R2\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null},{\"studentid\":738,\"stuno\":\"201330340301\",\"stuname\":\"蔡家荣\",\"clazz\":\"软工R3\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null},{\"studentid\":739,\"stuno\":\"201330340302\",\"stuname\":\"蔡嘉晨\",\"clazz\":\"软工R3\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null},{\"studentid\":740,\"stuno\":\"201330340303\",\"stuname\":\"陈德林\",\"clazz\":\"软工R3\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null},{\"studentid\":741,\"stuno\":\"201330340304\",\"stuname\":\"董灿佳\",\"clazz\":\"软工R3\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null},{\"studentid\":742,\"stuno\":\"201330340305\",\"stuname\":\"方锦德\",\"clazz\":\"软工R3\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null},{\"studentid\":743,\"stuno\":\"201330340306\",\"stuname\":\"顾浚源\",\"clazz\":\"软工R3\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null},{\"studentid\":744,\"stuno\":\"201330340308\",\"stuname\":\"黄倩婷\",\"clazz\":\"软工R3\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null},{\"studentid\":745,\"stuno\":\"201330340310\",\"stuname\":\"李锦\",\"clazz\":\"软工R3\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null},{\"studentid\":746,\"stuno\":\"201330340311\",\"stuname\":\"李晶晶\",\"clazz\":\"软工R3\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null},{\"studentid\":747,\"stuno\":\"201330340312\",\"stuname\":\"李伟豪\",\"clazz\":\"软工R3\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null},{\"studentid\":748,\"stuno\":\"201330340313\",\"stuname\":\"李一飞\",\"clazz\":\"软工R3\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null},{\"studentid\":749,\"stuno\":\"201330340314\",\"stuname\":\"梁铭\",\"clazz\":\"软工R3\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null},{\"studentid\":750,\"stuno\":\"201330340315\",\"stuname\":\"梁思源\",\"clazz\":\"软工R3\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null},{\"studentid\":751,\"stuno\":\"201330340316\",\"stuname\":\"廖旺辉\",\"clazz\":\"软工R3\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null},{\"studentid\":752,\"stuno\":\"201330340317\",\"stuname\":\"林博俊\",\"clazz\":\"软工R3\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null},{\"studentid\":753,\"stuno\":\"201330340318\",\"stuname\":\"林柱轩\",\"clazz\":\"软工R3\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null},{\"studentid\":754,\"stuno\":\"201330340319\",\"stuname\":\"吕文彬\",\"clazz\":\"软工R3\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null},{\"studentid\":755,\"stuno\":\"201330340320\",\"stuname\":\"任达\",\"clazz\":\"软工R3\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null},{\"studentid\":756,\"stuno\":\"201330340321\",\"stuname\":\"沈志铭\",\"clazz\":\"软工R3\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null},{\"studentid\":757,\"stuno\":\"201330340322\",\"stuname\":\"吴伟豪\",\"clazz\":\"软工R3\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null},{\"studentid\":758,\"stuno\":\"201330340323\",\"stuname\":\"伍均国\",\"clazz\":\"软工R3\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null},{\"studentid\":759,\"stuno\":\"201330340324\",\"stuname\":\"伍肇强\",\"clazz\":\"软工R3\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null},{\"studentid\":760,\"stuno\":\"201330340325\",\"stuname\":\"杨秋涛\",\"clazz\":\"软工R3\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null},{\"studentid\":761,\"stuno\":\"201330340326\",\"stuname\":\"曾俊阶\",\"clazz\":\"软工R3\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null},{\"studentid\":762,\"stuno\":\"201330340327\",\"stuname\":\"张彭杰\",\"clazz\":\"软工R3\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null},{\"studentid\":763,\"stuno\":\"201330340328\",\"stuname\":\"张伟伦\",\"clazz\":\"软工R3\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null},{\"studentid\":764,\"stuno\":\"201330340329\",\"stuname\":\"张镇涛\",\"clazz\":\"软工R3\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null},{\"studentid\":765,\"stuno\":\"201330340330\",\"stuname\":\"钟锐锋\",\"clazz\":\"软工R3\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null},{\"studentid\":766,\"stuno\":\"201330340331\",\"stuname\":\"钟文权\",\"clazz\":\"软工R3\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null},{\"studentid\":767,\"stuno\":\"201330340332\",\"stuname\":\"周嘉富\",\"clazz\":\"软工R3\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null},{\"studentid\":768,\"stuno\":\"201330340333\",\"stuname\":\"卓志炜\",\"clazz\":\"软工R3\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null},{\"studentid\":769,\"stuno\":\"201330340401\",\"stuname\":\"蔡杨超\",\"clazz\":\"软工R4\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null},{\"studentid\":770,\"stuno\":\"201330340402\",\"stuname\":\"陈孝民\",\"clazz\":\"软工R4\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null},{\"studentid\":771,\"stuno\":\"201330340403\",\"stuname\":\"陈尧庚\",\"clazz\":\"软工R4\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null},{\"studentid\":772,\"stuno\":\"201330340404\",\"stuname\":\"陈勇亮\",\"clazz\":\"软工R4\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null},{\"studentid\":773,\"stuno\":\"201330340405\",\"stuname\":\"成安安\",\"clazz\":\"软工R4\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null},{\"studentid\":774,\"stuno\":\"201330340407\",\"stuname\":\"冯配宾\",\"clazz\":\"软工R4\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null},{\"studentid\":775,\"stuno\":\"201330340408\",\"stuname\":\"何嘉荣\",\"clazz\":\"软工R4\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null},{\"studentid\":776,\"stuno\":\"201330340410\",\"stuname\":\"黄伟铭\",\"clazz\":\"软工R4\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null},{\"studentid\":777,\"stuno\":\"201330340411\",\"stuname\":\"兰阳佳\",\"clazz\":\"软工R4\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null},{\"studentid\":778,\"stuno\":\"201330340412\",\"stuname\":\"李英淦\",\"clazz\":\"软工R4\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null},{\"studentid\":779,\"stuno\":\"201330340413\",\"stuname\":\"梁志豪\",\"clazz\":\"软工R4\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null},{\"studentid\":780,\"stuno\":\"201330340414\",\"stuname\":\"林宝明\",\"clazz\":\"软工R4\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null},{\"studentid\":781,\"stuno\":\"201330340415\",\"stuname\":\"林力昂\",\"clazz\":\"软工R4\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null},{\"studentid\":782,\"stuno\":\"201330340416\",\"stuname\":\"刘泽妮\",\"clazz\":\"软工R4\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null},{\"studentid\":783,\"stuno\":\"201330340418\",\"stuname\":\"欧卓鸿\",\"clazz\":\"软工R4\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null},{\"studentid\":784,\"stuno\":\"201330340419\",\"stuname\":\"石云飞\",\"clazz\":\"软工R4\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null},{\"studentid\":785,\"stuno\":\"201330340420\",\"stuname\":\"宋奇星\",\"clazz\":\"软工R4\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null},{\"studentid\":787,\"stuno\":\"201330340422\",\"stuname\":\"王丛林\",\"clazz\":\"软工R4\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null},{\"studentid\":788,\"stuno\":\"201330340423\",\"stuname\":\"王友锐\",\"clazz\":\"软工R4\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null},{\"studentid\":790,\"stuno\":\"201330340426\",\"stuname\":\"许伟鹏\",\"clazz\":\"软工R4\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null},{\"studentid\":791,\"stuno\":\"201330340427\",\"stuname\":\"杨伟杰\",\"clazz\":\"软工R4\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null},{\"studentid\":792,\"stuno\":\"201330340428\",\"stuname\":\"姚怡虹\",\"clazz\":\"软工R4\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null},{\"studentid\":793,\"stuno\":\"201330340429\",\"stuname\":\"叶韦灼\",\"clazz\":\"软工R4\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null},{\"studentid\":794,\"stuno\":\"201330340430\",\"stuname\":\"叶绪创\",\"clazz\":\"软工R4\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null},{\"studentid\":283,\"stuno\":\"201330320103\",\"stuname\":\"陈雪虹\",\"clazz\":\"计算机1\",\"defenseStatus\":\"正常答辩\",\"topic\":null,\"ifupload\":false,\"thesisid\":null}]', '2017-09-28 00:00:00', '2017-09-29 21:08:15');

-- ----------------------------
-- Table structure for gooddelay
-- ----------------------------
DROP TABLE IF EXISTS `gooddelay`;
CREATE TABLE `gooddelay` (
  `id` bigint(10) NOT NULL AUTO_INCREMENT,
  `thesisid` bigint(10) DEFAULT NULL,
  `reason` varchar(1000) DEFAULT NULL,
  `studentconf` int(4) DEFAULT '0',
  `advice` varchar(100) DEFAULT NULL,
  `teacherconf` int(4) DEFAULT '0',
  `review` varchar(100) DEFAULT NULL,
  `orgconf` int(4) DEFAULT '0',
  `applytype` tinyint(2) DEFAULT NULL,
  `cdate` datetime DEFAULT NULL,
  `mdate` datetime DEFAULT NULL,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=66 DEFAULT CHARSET=utf8;

-- ----------------------------
-- Records of gooddelay
-- ----------------------------
INSERT INTO `gooddelay` VALUES ('39', '297', '申请争优', '1', '同意', '0', '同意', '0', '1', '2017-08-17 00:15:37', '2017-08-19 12:34:01');
INSERT INTO `gooddelay` VALUES ('48', '7', 'kkkkkkkkkkkkkkkkjhgbn', '1', 'uuu', '1', 'ppp', '1', '1', '2017-09-06 09:37:36', '2017-09-29 13:53:39');
INSERT INTO `gooddelay` VALUES ('49', '1', 'hhhhhhhhhhh', '0', '回去重新写申请原因', '0', null, '0', '1', '2017-09-06 09:42:28', '2017-09-22 09:48:25');
INSERT INTO `gooddelay` VALUES ('50', '866', 'hhhhhhh', '1', '55555555555555555555555', '-1', null, '-1', '1', '2017-09-06 10:15:34', '2017-10-07 00:10:13');
INSERT INTO `gooddelay` VALUES ('51', '187', '566565654', '1', '66666666666', '0', null, '0', '1', '2017-09-19 22:56:36', '2017-09-19 22:58:42');
INSERT INTO `gooddelay` VALUES ('52', '8', 'sss', '0', null, '0', null, '0', '-1', '2017-09-25 19:35:00', '2017-09-25 19:35:00');
INSERT INTO `gooddelay` VALUES ('53', '457', 'ff', '1', 'll', '1', 'ddd', '1', '1', '2017-09-29 23:17:24', '2017-09-29 23:19:03');
INSERT INTO `gooddelay` VALUES ('54', '92', 'ff', '1', 'hh', '1', 'kkk', '1', '1', '2017-09-29 23:27:08', '2017-09-29 23:28:00');
INSERT INTO `gooddelay` VALUES ('55', '75', 'sfdf', '1', 'kkk', '1', 'cx', '1', '1', '2017-09-29 23:40:22', '2017-09-29 23:41:19');
INSERT INTO `gooddelay` VALUES ('56', '3', '坎坎坷坷扩', '1', '斤斤计较军军军军军', '1', '哦哦哦哦哦哦哦', '1', '1', '2017-09-30 11:11:26', '2017-09-30 11:44:48');
INSERT INTO `gooddelay` VALUES ('57', '128', 'hhhhhhhhhhh', '1', 'sdfa', '1', 'kkkkkkkkkk', '1', '1', '2017-09-30 11:46:36', '2017-09-30 11:50:51');
INSERT INTO `gooddelay` VALUES ('58', '74', 'dsf', '1', 'df', '1', 'oo', '1', '-1', '2017-09-30 11:59:48', '2017-09-30 12:00:50');
INSERT INTO `gooddelay` VALUES ('59', '85', 'vvvv', '1', 'hhhhhhhhhh', '1', 'ii', '1', '-1', '2017-09-30 12:40:53', '2017-09-30 12:42:29');
INSERT INTO `gooddelay` VALUES ('62', '289', 'kkkkkk', '1', 'dafs', '1', 'a ds', '1', '-1', '2017-10-01 17:15:34', '2017-10-01 17:16:34');
INSERT INTO `gooddelay` VALUES ('63', '73', 'dsaf', '1', 'asdf', '1', 'dsa', '1', '-1', '2017-10-01 17:17:53', '2017-10-01 17:18:39');
INSERT INTO `gooddelay` VALUES ('64', '81', 'dsaf asd', '1', 'dsaf', '1', 'das asd fas', '1', '1', '2017-10-01 17:19:10', '2017-10-01 17:20:08');
INSERT INTO `gooddelay` VALUES ('65', '77', 'gg', '0', 'jjjjjj', '0', 'kk', '0', '-1', '2017-10-13 09:49:06', '2017-10-13 09:52:25');

-- ----------------------------
-- Table structure for midcheck
-- ----------------------------
DROP TABLE IF EXISTS `midcheck`;
CREATE TABLE `midcheck` (
  `id` bigint(10) NOT NULL AUTO_INCREMENT,
  `thesisid` bigint(10) DEFAULT NULL COMMENT '论文题目ID',
  `content` varchar(1000) DEFAULT '' COMMENT '内容要求，包括技术路线',
  `schedule` varchar(1000) DEFAULT '' COMMENT '进度安排',
  `reference` varchar(1000) DEFAULT '' COMMENT '参考文献',
  `advice` varchar(1000) DEFAULT '' COMMENT '指导老师意见与建议',
  `tconfirm` tinyint(1) DEFAULT '0' COMMENT '指导老师确认',
  `sconfirm` tinyint(1) DEFAULT NULL COMMENT '学生确认',
  `valid` tinyint(1) DEFAULT NULL COMMENT '是否可用（也即是否删除）',
  `cdate` datetime DEFAULT NULL COMMENT '创建时间',
  `mdate` datetime DEFAULT NULL COMMENT '更新时间',
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=6 DEFAULT CHARSET=utf8;

-- ----------------------------
-- Records of midcheck
-- ----------------------------
INSERT INTO `midcheck` VALUES ('1', '742', '校园出租屋管理系统', '校园出租屋管理系统', '校园出租屋管理系统', '校园出租屋管理系统', '1', '1', '1', '2016-11-01 00:00:00', '2016-11-01 18:18:39');
INSERT INTO `midcheck` VALUES ('2', '866', 'uuu', '呃呃呃', '通天塔', '士大夫', '1', '1', '1', '2017-08-01 00:00:00', '2017-08-13 20:02:38');
INSERT INTO `midcheck` VALUES ('3', '108', '3', '3', '3', '3', '1', '1', '1', '2017-08-12 00:00:00', '2017-08-12 22:39:21');
INSERT INTO `midcheck` VALUES ('4', '117', '5', '5', '55', '5', '1', '1', '1', '2017-08-12 00:00:00', '2017-08-12 23:17:30');
INSERT INTO `midcheck` VALUES ('5', '187', '5', '5', '5', '5', '1', '1', '1', '2017-09-20 00:00:00', '2017-09-19 23:00:15');

-- ----------------------------
-- Table structure for org
-- ----------------------------
DROP TABLE IF EXISTS `org`;
CREATE TABLE `org` (
  `id` bigint(10) NOT NULL AUTO_INCREMENT,
  `name` varchar(255) DEFAULT '' COMMENT '机构名称',
  `projlimit` int(10) NOT NULL DEFAULT '0' COMMENT '最多同时进行的毕业论文工作数量，0表示不限制',
  `studlimit` int(10) NOT NULL DEFAULT '0' COMMENT '最多学生数量，0表示不限制',
  `uploadlimit` int(10) NOT NULL DEFAULT '0' COMMENT '单个文件上传限制，单位M，0表示不限制',
  `docroot` varchar(255) NOT NULL COMMENT '文档存储根目录，其中论文上传在根目录中建立一个paper，每个论文工作用其主键再建立子目录',
  `valid` tinyint(1) DEFAULT NULL COMMENT '是否可用（也即是否删除）',
  `cdate` datetime DEFAULT NULL COMMENT '创建时间',
  `mdate` datetime DEFAULT NULL COMMENT '更新时间',
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=5 DEFAULT CHARSET=utf8;

-- ----------------------------
-- Records of org
-- ----------------------------
INSERT INTO `org` VALUES ('1', '计算机科学与工程系', '10', '2000', '100', '计算机科学与工程系', '1', '2016-10-09 21:48:04', '2016-10-09 21:48:04');
INSERT INTO `org` VALUES ('2', '信息管理系', '5', '1000', '50', '信息管理系', '1', '2016-10-09 21:48:36', '2016-10-09 21:48:36');
INSERT INTO `org` VALUES ('3', '经管学院', '100', '1500', '20', '经管学院', '1', '2017-07-31 21:23:57', '2017-07-31 21:23:57');
INSERT INTO `org` VALUES ('4', '1', '1', '1', '1', '1', '0', '2017-08-13 10:41:14', '2017-09-10 17:29:39');

-- ----------------------------
-- Table structure for pdirection
-- ----------------------------
DROP TABLE IF EXISTS `pdirection`;
CREATE TABLE `pdirection` (
  `id` bigint(10) NOT NULL AUTO_INCREMENT,
  `orgid` bigint(10) DEFAULT NULL COMMENT '所属组织机构',
  `direction` varchar(255) DEFAULT '' COMMENT '论文研究方向',
  `valid` tinyint(1) DEFAULT NULL COMMENT '是否可用（也即是否删除）',
  `cdate` datetime DEFAULT NULL COMMENT '创建时间',
  `mdate` datetime DEFAULT NULL COMMENT '更新时间',
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=20 DEFAULT CHARSET=utf8;

-- ----------------------------
-- Records of pdirection
-- ----------------------------
INSERT INTO `pdirection` VALUES ('2', '2', '设计类', '1', '2016-10-11 11:47:46', '2016-10-11 11:52:42');
INSERT INTO `pdirection` VALUES ('3', '2', '论文类', '1', '2016-10-11 11:47:56', '2016-10-11 11:52:51');
INSERT INTO `pdirection` VALUES ('7', '2', '其他', '1', '2016-10-11 11:53:49', '2016-10-11 11:53:49');
INSERT INTO `pdirection` VALUES ('8', '1', '应用软件开发', '1', '2016-10-11 15:07:33', '2016-10-11 15:07:33');
INSERT INTO `pdirection` VALUES ('9', '1', '人工智能', '1', '2016-10-11 15:07:48', '2016-10-11 15:07:48');
INSERT INTO `pdirection` VALUES ('10', '1', '信息安全', '1', '2016-10-11 15:08:01', '2016-10-11 15:08:01');
INSERT INTO `pdirection` VALUES ('11', '1', '生物信息学', '1', '2016-10-11 15:08:13', '2016-10-11 15:08:13');
INSERT INTO `pdirection` VALUES ('12', '1', '计算机图形学', '1', '2016-10-11 15:08:38', '2016-10-11 15:08:38');
INSERT INTO `pdirection` VALUES ('13', '1', '数字图像处理', '1', '2016-10-11 15:08:48', '2016-10-11 15:08:48');
INSERT INTO `pdirection` VALUES ('14', '1', '网络技术与应用', '1', '2016-10-11 15:09:06', '2016-10-11 15:09:06');
INSERT INTO `pdirection` VALUES ('15', '1', '人机交互', '1', '2016-10-11 15:09:22', '2016-10-11 15:09:22');
INSERT INTO `pdirection` VALUES ('16', '1', '数据挖掘', '1', '2016-10-11 15:09:37', '2016-10-11 15:09:37');
INSERT INTO `pdirection` VALUES ('17', '1', '云计算', '1', '2016-10-11 15:09:59', '2016-10-11 15:09:59');
INSERT INTO `pdirection` VALUES ('18', '1', '大数据', '1', '2016-10-11 15:10:10', '2016-10-11 15:10:10');
INSERT INTO `pdirection` VALUES ('19', '1', '其他', '1', '2016-10-11 15:12:07', '2016-10-11 15:12:07');

-- ----------------------------
-- Table structure for permission
-- ----------------------------
DROP TABLE IF EXISTS `permission`;
CREATE TABLE `permission` (
  `id` bigint(10) NOT NULL AUTO_INCREMENT COMMENT '主键，自动递增',
  `name` varchar(255) NOT NULL COMMENT '中文名',
  `keystr` varchar(255) NOT NULL COMMENT '权限键值',
  `resid` bigint(10) DEFAULT NULL COMMENT '关联的资源，如果没有则为系统权限',
  `valid` tinyint(1) DEFAULT '1' COMMENT '当前元组是否有效，1（true）表示有效；0（false）表示无效【无效时不能操作该元组】',
  `cdate` datetime NOT NULL COMMENT '当前元组的生成时间',
  `mdate` datetime NOT NULL COMMENT '当前元组信息发生变化的时间',
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=174 DEFAULT CHARSET=utf8;

-- ----------------------------
-- Records of permission
-- ----------------------------
INSERT INTO `permission` VALUES ('1', '查看用户', 'user:list', '8', '1', '2015-10-25 11:00:00', '2015-10-25 11:00:00');
INSERT INTO `permission` VALUES ('2', '查看班级', 'clazz:list', '9', '1', '2015-10-25 11:02:00', '2015-10-25 11:02:00');
INSERT INTO `permission` VALUES ('4', '查看工作单位', 'work:list', '11', '1', '2015-10-25 11:02:00', '2015-10-25 11:02:00');
INSERT INTO `permission` VALUES ('5', '查看信息分类', 'category:list', '12', '1', '2015-10-25 11:02:00', '2015-10-25 11:02:00');
INSERT INTO `permission` VALUES ('6', '查看文章', 'article:list', '13', '1', '2015-10-25 11:02:00', '2015-10-25 11:02:00');
INSERT INTO `permission` VALUES ('7', '查看页面', 'page:list', '14', '1', '2015-10-25 11:02:00', '2015-10-25 11:02:00');
INSERT INTO `permission` VALUES ('8', '查看留言', 'message:list', '15', '1', '2015-10-25 11:02:00', '2015-12-26 16:08:29');
INSERT INTO `permission` VALUES ('9', '查看通知', 'notice:list', '16', '1', '2015-10-25 11:02:00', '2015-10-25 11:02:00');
INSERT INTO `permission` VALUES ('10', '查看角色', 'role:list', '17', '1', '2015-10-25 11:02:00', '2015-10-25 11:02:00');
INSERT INTO `permission` VALUES ('11', '查看资源', 'resource:list', '18', '1', '2015-10-25 11:02:00', '2015-10-25 11:02:00');
INSERT INTO `permission` VALUES ('12', '查看权限', 'permission:list', '19', '1', '2015-10-25 11:02:00', '2015-10-25 11:02:00');
INSERT INTO `permission` VALUES ('13', '查看文件分类', 'fileCatalog:list', '20', '1', '2015-10-25 11:02:00', '2015-10-25 11:02:00');
INSERT INTO `permission` VALUES ('14', '查看文件', 'file:list', '21', '1', '2015-10-25 11:02:00', '2015-10-25 11:02:00');
INSERT INTO `permission` VALUES ('15', '查看导航', 'nav:list', '22', '1', '2015-10-25 11:02:00', '2015-10-25 11:02:00');
INSERT INTO `permission` VALUES ('16', '查看友情链接', 'link:list', '23', '1', '2015-10-25 11:02:00', '2015-10-25 11:02:00');
INSERT INTO `permission` VALUES ('17', '查看场地', 'place:list', '24', '1', '2015-10-25 11:02:00', '2015-10-25 11:02:00');
INSERT INTO `permission` VALUES ('18', '添加用户', 'user:add', '8', '1', '2015-10-25 11:02:00', '2015-11-25 08:42:30');
INSERT INTO `permission` VALUES ('19', '添加班级', 'clazz:add', '9', '1', '2015-10-25 11:02:00', '2015-10-25 11:02:00');
INSERT INTO `permission` VALUES ('21', '添加工作单位', 'work:add', '11', '1', '2015-10-25 11:02:00', '2015-10-25 11:02:00');
INSERT INTO `permission` VALUES ('22', '添加信息分类', 'category:add', '12', '1', '2015-10-25 11:02:00', '2015-10-25 11:02:00');
INSERT INTO `permission` VALUES ('23', '添加文章', 'article:add', '13', '1', '2015-10-25 11:02:00', '2015-10-25 11:02:00');
INSERT INTO `permission` VALUES ('24', '添加页面', 'page:add', '14', '1', '2015-10-25 11:02:00', '2015-10-25 11:02:00');
INSERT INTO `permission` VALUES ('25', '添加留言', 'message:add', '15', '1', '2015-11-09 21:36:00', '2015-11-09 21:36:00');
INSERT INTO `permission` VALUES ('26', '添加通知', 'notice:add', '16', '1', '2015-10-25 11:00:00', '2015-10-25 11:00:00');
INSERT INTO `permission` VALUES ('30', '添加文件分类', 'fileCatalog:add', '20', '1', '2015-10-25 11:02:00', '2015-10-25 11:02:00');
INSERT INTO `permission` VALUES ('31', '添加文件', 'file:add', '21', '1', '2015-10-25 11:02:00', '2015-10-25 11:02:00');
INSERT INTO `permission` VALUES ('32', '添加导航', 'nav:add', '22', '1', '2015-10-25 11:02:00', '2015-10-25 11:02:00');
INSERT INTO `permission` VALUES ('33', '添加友情链接', 'link:add', '23', '1', '2015-10-25 11:02:00', '2015-10-25 11:02:00');
INSERT INTO `permission` VALUES ('34', '添加场地', 'place:add', '24', '1', '2015-10-25 11:02:00', '2015-10-25 11:02:00');
INSERT INTO `permission` VALUES ('35', '删除用户', 'user:delete', '8', '1', '2015-10-25 11:00:00', '2015-10-25 11:00:00');
INSERT INTO `permission` VALUES ('36', '删除班级', 'clazz:delete', '9', '1', '2015-10-25 11:02:00', '2015-10-25 11:02:00');
INSERT INTO `permission` VALUES ('38', '删除工作单位', 'work:delete', '11', '1', '2015-10-25 11:02:00', '2015-10-25 11:02:00');
INSERT INTO `permission` VALUES ('39', '删除信息分类', 'category:delete', '12', '1', '2015-10-25 11:02:00', '2015-10-25 11:02:00');
INSERT INTO `permission` VALUES ('40', '删除文章', 'article:delete', '13', '1', '2015-10-25 11:02:00', '2015-10-25 11:02:00');
INSERT INTO `permission` VALUES ('41', '删除页面', 'page:delete', '14', '1', '2015-10-25 11:02:00', '2015-10-25 11:02:00');
INSERT INTO `permission` VALUES ('42', '删除留言', 'message:delete', '15', '1', '2015-10-25 11:02:00', '2015-10-25 11:02:00');
INSERT INTO `permission` VALUES ('43', '删除通知', 'notice:delete', '16', '1', '2015-10-25 11:02:00', '2015-10-25 11:02:00');
INSERT INTO `permission` VALUES ('44', '删除角色', 'role:delete', '17', '1', '2015-10-25 11:02:00', '2015-10-25 11:02:00');
INSERT INTO `permission` VALUES ('45', '删除资源', 'resource:delete', '18', '1', '2015-10-25 11:02:00', '2015-10-25 11:02:00');
INSERT INTO `permission` VALUES ('46', '删除权限', 'permission:delete', '19', '1', '2015-10-25 11:02:00', '2015-10-25 11:02:00');
INSERT INTO `permission` VALUES ('47', '删除文件分类', 'fileCatalog:delete', '20', '1', '2015-10-25 11:02:00', '2015-10-25 11:02:00');
INSERT INTO `permission` VALUES ('48', '删除文件', 'file:delete', '21', '1', '2015-10-25 11:02:00', '2015-10-25 11:02:00');
INSERT INTO `permission` VALUES ('49', '删除导航', 'nav:delete', '22', '1', '2015-10-25 11:02:00', '2015-10-25 11:02:00');
INSERT INTO `permission` VALUES ('50', '删除友情链接', 'link:delete', '23', '1', '2015-10-25 11:02:00', '2015-10-25 11:02:00');
INSERT INTO `permission` VALUES ('51', '删除场地', 'place:delete', '24', '1', '2015-10-25 11:02:00', '2015-10-25 11:02:00');
INSERT INTO `permission` VALUES ('52', '修改用户信息', 'user:editInfo', '8', '1', '2015-10-25 11:02:00', '2015-12-22 09:11:49');
INSERT INTO `permission` VALUES ('53', '修改班级', 'clazz:edit', '9', '1', '2015-10-25 11:02:00', '2015-10-25 11:02:00');
INSERT INTO `permission` VALUES ('55', '修改工作单位', 'work:edit', '11', '1', '2015-10-25 11:02:00', '2015-10-25 11:02:00');
INSERT INTO `permission` VALUES ('56', '修改信息分类', 'category:edit', '12', '1', '2015-10-25 11:02:00', '2015-10-25 11:02:00');
INSERT INTO `permission` VALUES ('57', '修改文章', 'article:edit', '13', '1', '2015-10-25 11:02:00', '2015-10-25 11:02:00');
INSERT INTO `permission` VALUES ('58', '修改页面', 'page:edit', '14', '1', '2015-10-25 11:02:00', '2015-10-25 11:02:00');
INSERT INTO `permission` VALUES ('59', '回复留言', 'message:reply', '15', '1', '2015-11-09 21:36:00', '2015-12-26 16:08:07');
INSERT INTO `permission` VALUES ('60', '修改通知', 'notice:edit', '16', '1', '2015-10-25 11:00:00', '2015-10-25 11:00:00');
INSERT INTO `permission` VALUES ('64', '修改文件分类', 'fileCatalog:edit', '20', '1', '2015-10-25 11:02:00', '2015-10-25 11:02:00');
INSERT INTO `permission` VALUES ('65', '修改文件', 'file:edit', '21', '1', '2015-10-25 11:02:00', '2015-10-25 11:02:00');
INSERT INTO `permission` VALUES ('66', '修改导航', 'nav:edit', '22', '1', '2015-10-25 11:02:00', '2015-10-25 11:02:00');
INSERT INTO `permission` VALUES ('67', '修改友情链接', 'link:edit', '23', '1', '2015-10-25 11:02:00', '2015-10-25 11:02:00');
INSERT INTO `permission` VALUES ('68', '修改场地', 'place:edit', '24', '1', '2015-10-25 11:02:00', '2015-10-25 11:02:00');
INSERT INTO `permission` VALUES ('69', '增改角色', 'role:edit', '17', '1', '2015-10-25 11:02:00', '2015-10-25 11:02:00');
INSERT INTO `permission` VALUES ('70', '增改资源', 'resource:edit', '18', '1', '2015-10-25 11:02:00', '2015-10-25 11:02:00');
INSERT INTO `permission` VALUES ('71', '增改权限', 'permission:edit', '19', '1', '2015-10-25 11:02:00', '2015-10-25 11:02:00');
INSERT INTO `permission` VALUES ('72', '申请场地', 'apply:list', '28', '1', '2015-10-25 11:02:00', '2015-10-25 11:02:00');
INSERT INTO `permission` VALUES ('109', '审核申请', 'apply:deal', '28', '1', '2015-12-20 11:16:27', '2015-12-20 11:16:27');
INSERT INTO `permission` VALUES ('110', '查看我的留言', 'message:showSelf', '31', '1', '2015-12-22 08:58:20', '2015-12-22 09:07:00');
INSERT INTO `permission` VALUES ('111', '查看我的通知', 'notice:showSelf', '30', '1', '2015-12-22 09:00:07', '2015-12-22 09:07:38');
INSERT INTO `permission` VALUES ('112', '重置密码', 'user:resetPassword', '8', '1', '2015-12-22 09:02:12', '2015-12-22 09:21:45');
INSERT INTO `permission` VALUES ('113', '修改角色', 'user:editRole', '8', '1', '2015-12-22 09:14:24', '2015-12-22 09:14:24');
INSERT INTO `permission` VALUES ('114', '修改我的申请', 'apply:edit', '28', '1', '2015-12-22 10:03:57', '2015-12-22 10:03:57');
INSERT INTO `permission` VALUES ('115', '删除申请', 'apply:delete', '28', '1', '2015-12-22 10:10:01', '2015-12-22 10:10:01');
INSERT INTO `permission` VALUES ('117', '查看系统信息', 'system:list', '50', '1', '2016-01-07 20:21:22', '2016-01-07 20:21:22');
INSERT INTO `permission` VALUES ('118', '修改系统信息', 'system:edit', '50', '1', '2016-01-07 20:22:32', '2016-01-07 20:22:32');
INSERT INTO `permission` VALUES ('119', '添加系统信息', 'system:add', '50', '1', '2016-01-07 20:22:51', '2016-01-07 20:22:51');
INSERT INTO `permission` VALUES ('120', '删除系统信息', 'system:delete', '50', '1', '2016-01-07 20:23:09', '2016-01-07 20:23:09');
INSERT INTO `permission` VALUES ('122', '学生管理', 'student:manager', '53', '1', '2016-01-29 12:52:00', '2017-09-03 20:17:06');
INSERT INTO `permission` VALUES ('123', '查看短信', 'shortMessage:list', '54', '1', '2016-03-05 10:47:45', '2016-03-05 10:48:58');
INSERT INTO `permission` VALUES ('124', '删除短信', 'shortMessage:delete', '54', '1', '2016-03-05 10:48:44', '2016-03-05 10:48:44');
INSERT INTO `permission` VALUES ('125', '增改短信', 'shortMessage:edit', '54', '1', '2016-03-05 10:49:19', '2016-03-05 10:58:02');
INSERT INTO `permission` VALUES ('126', '查看短信详情', 'shortMessage:view', '54', '1', '2016-03-05 10:57:20', '2016-03-05 10:57:20');
INSERT INTO `permission` VALUES ('127', '短信发送', 'shortMessage:send', '54', '1', '2016-03-22 09:55:37', '2016-03-22 09:55:37');
INSERT INTO `permission` VALUES ('129', '查看工资', 'salary:list', '56', '1', '2016-03-29 18:42:21', '2016-03-29 18:42:21');
INSERT INTO `permission` VALUES ('130', '导入工资', 'salary:import', '56', '1', '2016-03-29 18:43:08', '2016-03-29 18:43:08');
INSERT INTO `permission` VALUES ('131', '删除工资', 'salary:delete', '56', '1', '2016-03-29 18:43:28', '2016-03-29 18:43:28');
INSERT INTO `permission` VALUES ('133', '下载分类', 'download:downloadType', '52', '1', '2016-04-23 17:49:10', '2016-04-23 18:29:11');
INSERT INTO `permission` VALUES ('134', '下载列表', 'download:downloadList', '52', '1', '2016-04-23 18:23:25', '2016-04-23 18:23:25');
INSERT INTO `permission` VALUES ('135', '下载文件', 'download:download', '52', '1', '2016-04-23 18:25:28', '2016-04-23 18:25:28');
INSERT INTO `permission` VALUES ('136', '添加教师', 'teacher:add', '57', '1', '2016-08-16 17:22:38', '2016-08-16 17:22:38');
INSERT INTO `permission` VALUES ('137', '修改资料', 'teacher:edit', '57', '0', '2016-08-16 17:24:09', '2016-08-16 17:25:23');
INSERT INTO `permission` VALUES ('138', '修改资料', 'teacher:edit', '57', '1', '2016-08-17 11:56:01', '2016-08-17 11:56:01');
INSERT INTO `permission` VALUES ('139', '测试', 'test', '62', '1', '2017-08-02 10:33:49', '2017-08-02 10:33:49');
INSERT INTO `permission` VALUES ('140', '个人信息修改', 'personmessger:edit', '67', '1', '2017-09-03 19:03:40', '2017-09-03 19:03:40');
INSERT INTO `permission` VALUES ('141', '论文申请', 'thesis:apply', '69', '1', '2017-09-03 19:09:25', '2017-09-03 19:09:25');
INSERT INTO `permission` VALUES ('142', '论文事务管理', 'thesis:manager', '70', '1', '2017-09-03 19:09:49', '2017-09-03 19:09:49');
INSERT INTO `permission` VALUES ('143', '查看选题结果', 'thesis:lookresult', '71', '1', '2017-09-03 19:10:32', '2017-09-07 17:00:57');
INSERT INTO `permission` VALUES ('144', '历年题目管理', 'thesis:former_manager', '72', '1', '2017-09-03 19:29:57', '2017-09-03 19:29:57');
INSERT INTO `permission` VALUES ('145', '题目申报管理', 'thesis:apply_manager', '73', '1', '2017-09-03 19:30:32', '2017-09-03 19:30:32');
INSERT INTO `permission` VALUES ('146', '确定选题学生', 'thesis:confirm_student', '74', '1', '2017-09-03 19:30:56', '2017-09-03 19:30:56');
INSERT INTO `permission` VALUES ('147', '论文任务书', 'thesis:taskbook', '76', '1', '2017-09-03 19:31:26', '2017-09-03 19:31:26');
INSERT INTO `permission` VALUES ('148', '论文中期检查', 'thesis:midcheck', '77', '1', '2017-09-03 19:31:50', '2017-09-03 19:31:50');
INSERT INTO `permission` VALUES ('149', '指导教师自评', 'score:guideteacher', '79', '1', '2017-09-03 19:32:19', '2017-09-03 19:32:19');
INSERT INTO `permission` VALUES ('150', '评阅教师评分', 'socre:viewteacher', '80', '1', '2017-09-03 19:32:43', '2017-09-03 19:32:43');
INSERT INTO `permission` VALUES ('151', '论文上传下载', 'thesis:upload', '81', '1', '2017-09-03 19:33:02', '2017-09-29 22:27:23');
INSERT INTO `permission` VALUES ('152', '争优/延期确认', 'thesis:teacherconf', '83', '1', '2017-09-03 19:33:29', '2017-09-07 17:41:11');
INSERT INTO `permission` VALUES ('153', '查看分组', 'user:lookdefenseGroup', '84', '1', '2017-09-03 19:34:01', '2017-09-03 19:34:01');
INSERT INTO `permission` VALUES ('154', '参与老师管理', 'thesis:enter_teacher', '86', '1', '2017-09-03 19:49:03', '2017-09-03 19:49:03');
INSERT INTO `permission` VALUES ('155', '参与学生管理', 'thesis:enter_student', '87', '1', '2017-09-03 19:49:28', '2017-09-03 19:49:28');
INSERT INTO `permission` VALUES ('156', '论文工作管理', 'thesis:work_manager', '85', '1', '2017-09-03 19:57:39', '2017-09-03 19:57:39');
INSERT INTO `permission` VALUES ('157', '学生选题调整', 'thesis:adjust', '91', '1', '2017-09-03 19:59:46', '2017-09-03 19:59:46');
INSERT INTO `permission` VALUES ('158', '教师出题情况', 'thesis:tea_thesis_result', '89', '1', '2017-09-03 20:00:39', '2017-09-03 20:00:39');
INSERT INTO `permission` VALUES ('159', '论文题目审核', 'thesis:review', '90', '1', '2017-09-03 20:01:40', '2017-09-03 20:03:03');
INSERT INTO `permission` VALUES ('160', '论文选题结果', 'thesis:select_result', '92', '1', '2017-09-03 20:04:21', '2017-09-03 20:04:21');
INSERT INTO `permission` VALUES ('161', '公告管理', 'advice:manager', '93', '1', '2017-09-03 20:04:41', '2017-09-03 20:04:41');
INSERT INTO `permission` VALUES ('162', '申请确认', 'apply:orgconfirm', '88', '1', '2017-09-03 20:06:21', '2017-09-03 20:06:21');
INSERT INTO `permission` VALUES ('163', '答辩任务管理', 'defense:workmanager', '94', '1', '2017-09-03 20:06:59', '2017-09-03 20:06:59');
INSERT INTO `permission` VALUES ('164', '论文方向管理', 'thesis:direction', '96', '1', '2017-09-03 20:15:11', '2017-09-03 20:15:11');
INSERT INTO `permission` VALUES ('165', '论文来源管理', 'thesis:source', '97', '1', '2017-09-03 20:15:38', '2017-09-03 20:15:38');
INSERT INTO `permission` VALUES ('166', '论文属性管理', 'thesis:proper', '98', '1', '2017-09-03 20:16:02', '2017-09-03 20:16:02');
INSERT INTO `permission` VALUES ('167', '管理员管理', 'user:admin', '99', '1', '2017-09-03 20:16:43', '2017-09-03 20:16:43');
INSERT INTO `permission` VALUES ('168', '职称管理', 'title:manager', '102', '1', '2017-09-03 20:32:08', '2017-09-03 20:32:08');
INSERT INTO `permission` VALUES ('169', '机构管理', 'org:manager', '103', '1', '2017-09-03 20:32:29', '2017-09-03 20:32:29');
INSERT INTO `permission` VALUES ('170', '管理员管理公告', 'advice:admin', '100', '1', '2017-09-03 20:33:05', '2017-09-03 20:33:05');
INSERT INTO `permission` VALUES ('171', '公告发布', 'advice:root', '101', '1', '2017-09-03 20:33:33', '2017-09-03 20:33:33');
INSERT INTO `permission` VALUES ('172', 'teachroom', 'room:teach', '105', '1', '2017-09-04 09:07:40', '2017-09-04 09:07:40');
INSERT INTO `permission` VALUES ('173', '学生管理', 'manager:student', '107', '1', '2017-09-06 00:43:55', '2017-09-06 00:43:55');

-- ----------------------------
-- Table structure for pproperty
-- ----------------------------
DROP TABLE IF EXISTS `pproperty`;
CREATE TABLE `pproperty` (
  `id` bigint(10) NOT NULL AUTO_INCREMENT,
  `orgid` bigint(10) DEFAULT NULL COMMENT '所属组织机构',
  `property` varchar(255) DEFAULT '' COMMENT '论文属性',
  `valid` tinyint(1) DEFAULT NULL COMMENT '是否可用（也即是否删除）',
  `cdate` datetime DEFAULT NULL COMMENT '创建时间',
  `mdate` datetime DEFAULT NULL COMMENT '更新时间',
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=7 DEFAULT CHARSET=utf8;

-- ----------------------------
-- Records of pproperty
-- ----------------------------
INSERT INTO `pproperty` VALUES ('1', '2', '毕业论文', '1', '2016-10-11 12:04:23', '2016-10-11 12:04:23');
INSERT INTO `pproperty` VALUES ('2', '1', '基础研究', '1', '2016-10-11 15:11:20', '2016-10-11 15:11:20');
INSERT INTO `pproperty` VALUES ('3', '1', '应用研究', '1', '2016-10-11 15:11:28', '2016-10-11 15:11:28');
INSERT INTO `pproperty` VALUES ('4', '1', '设计性', '1', '2016-10-11 15:11:41', '2016-10-11 15:11:41');
INSERT INTO `pproperty` VALUES ('5', '1', '调查报告', '1', '2016-10-11 15:11:54', '2016-10-11 15:11:54');
INSERT INTO `pproperty` VALUES ('6', '1', '其他', '1', '2016-10-11 15:12:01', '2016-10-11 15:12:01');

-- ----------------------------
-- Table structure for project
-- ----------------------------
DROP TABLE IF EXISTS `project`;
CREATE TABLE `project` (
  `id` bigint(10) NOT NULL AUTO_INCREMENT,
  `orgid` bigint(10) DEFAULT NULL COMMENT '所属组织机构',
  `title` varchar(255) DEFAULT NULL COMMENT '论文工作标题',
  `year` int(10) DEFAULT NULL COMMENT '论文工作年份',
  `startdate` datetime DEFAULT NULL COMMENT '论文工作开始日期',
  `enddate` datetime DEFAULT NULL COMMENT '论文工作结束日期',
  `midcheckdate` datetime DEFAULT NULL COMMENT '论文中期检查日期',
  `submitdate` datetime DEFAULT NULL COMMENT '论文提交日期',
  `defensedate` datetime DEFAULT NULL COMMENT '论文答辩日期',
  `setallowed` tinyint(1) DEFAULT '0' COMMENT '是否允许教师出题',
  `getallowed` tinyint(1) DEFAULT '0' COMMENT '是否允许学生选题',
  `postallowed` tinyint(1) DEFAULT '0' COMMENT '是否允许提交论文',
  `mark1allowed` tinyint(1) DEFAULT '0' COMMENT '是否允许指导教师评分',
  `mark2allowed` tinyint(1) DEFAULT '0' COMMENT '是否允许评阅教师评分',
  `mark3allowed` tinyint(1) DEFAULT '0' COMMENT '是否允许登记答辩分数',
  `gmpercent` int(10) DEFAULT '0' COMMENT '指导教师分数比例',
  `rmpercent` int(10) DEFAULT '0' COMMENT '评阅教师分数比例',
  `ampercent` int(10) DEFAULT '0' COMMENT '答辩分数比例',
  `setmax` int(10) DEFAULT '0' COMMENT '教师最大出题数',
  `setmin` int(10) DEFAULT '0' COMMENT '教师最少出题数',
  `getmax` int(10) DEFAULT '0' COMMENT '学生最大选题数',
  `doctype` varchar(255) DEFAULT NULL COMMENT '上传论文的类型',
  `close` tinyint(1) DEFAULT '0' COMMENT '是否关闭',
  `valid` tinyint(1) DEFAULT NULL COMMENT '是否可用（也即是否删除）',
  `cdate` datetime DEFAULT NULL COMMENT '创建时间',
  `mdate` datetime DEFAULT NULL COMMENT '更新时间',
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=7 DEFAULT CHARSET=utf8;

-- ----------------------------
-- Records of project
-- ----------------------------
INSERT INTO `project` VALUES ('1', '2', '2017年信管专业论文工作', '2017', '2016-10-10 00:00:00', '2017-04-30 00:00:00', '2017-01-02 00:00:00', '2017-03-31 00:00:00', '2017-04-29 00:00:00', '1', '1', '1', '1', '1', '1', '30', '30', '40', '12', '0', '5', 'doc#docx#pdf', '0', '1', '2016-10-09 22:11:14', '2017-09-19 23:02:25');
INSERT INTO `project` VALUES ('2', '2', '2017年工业工程专业论文工作', '2017', '2016-10-10 00:00:00', '2017-04-30 00:00:00', '2017-01-02 00:00:00', '2017-03-31 00:00:00', '2017-04-29 00:00:00', '1', '1', '0', '1', '1', '0', '30', '30', '40', '10', '0', '5', 'doc#docx#pdf', '0', '1', '2016-10-09 22:11:14', '2017-10-07 13:48:35');
INSERT INTO `project` VALUES ('3', '1', '2017届计算机科学与工程系毕业论文', '2017', '2016-10-15 00:00:00', '2017-04-30 00:00:00', '2016-12-31 00:00:00', '2017-05-20 00:00:00', '2017-05-13 00:00:00', '1', '1', '1', '1', '1', '1', '30', '40', '30', '10', '6', '5', 'pdf#zip', '0', '1', '2016-10-11 11:50:39', '2017-09-29 21:23:38');
INSERT INTO `project` VALUES ('4', '2', '建军节', '2017', '2017-08-01 00:00:00', '2017-08-02 00:00:00', '2017-08-02 00:00:00', '2017-08-02 00:00:00', '2017-08-03 00:00:00', '1', '1', '1', '1', '1', '1', '46', '38', '37', '30', '1', '1', 'doc#docx#pdf', '1', '1', '2017-08-01 14:44:05', '2017-09-10 21:24:45');
INSERT INTO `project` VALUES ('5', '3', '秋季金融论文工作', '2017', '2017-08-13 00:00:00', '2017-08-25 00:00:00', '2017-08-16 00:00:00', '2017-08-31 00:00:00', '2017-08-31 00:00:00', '1', '1', '1', '1', '1', '1', '24', '36', '40', '10', '10', '10', 'doc#docx#pdf', '0', '1', '2017-08-13 10:35:38', '2017-08-13 10:37:16');
INSERT INTO `project` VALUES ('6', '2', '11', '2010', '2017-09-13 00:00:00', '2017-09-05 00:00:00', '2017-09-05 00:00:00', '2017-09-23 00:00:00', '2017-09-12 00:00:00', '1', '1', '1', '1', '1', '1', '24', '24', '23', '12', '4', '1', 'doc', '1', '0', '2017-09-10 21:25:45', '2017-09-10 21:25:58');

-- ----------------------------
-- Table structure for project_student
-- ----------------------------
DROP TABLE IF EXISTS `project_student`;
CREATE TABLE `project_student` (
  `projectid` bigint(11) NOT NULL COMMENT '论文工作ID',
  `studentid` bigint(11) NOT NULL COMMENT '学生ID'
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

-- ----------------------------
-- Records of project_student
-- ----------------------------
INSERT INTO `project_student` VALUES ('1', '135');
INSERT INTO `project_student` VALUES ('1', '134');
INSERT INTO `project_student` VALUES ('1', '133');
INSERT INTO `project_student` VALUES ('1', '132');
INSERT INTO `project_student` VALUES ('1', '131');
INSERT INTO `project_student` VALUES ('1', '130');
INSERT INTO `project_student` VALUES ('1', '129');
INSERT INTO `project_student` VALUES ('1', '128');
INSERT INTO `project_student` VALUES ('1', '127');
INSERT INTO `project_student` VALUES ('1', '126');
INSERT INTO `project_student` VALUES ('1', '125');
INSERT INTO `project_student` VALUES ('1', '124');
INSERT INTO `project_student` VALUES ('1', '123');
INSERT INTO `project_student` VALUES ('1', '122');
INSERT INTO `project_student` VALUES ('1', '121');
INSERT INTO `project_student` VALUES ('1', '120');
INSERT INTO `project_student` VALUES ('1', '119');
INSERT INTO `project_student` VALUES ('1', '118');
INSERT INTO `project_student` VALUES ('1', '117');
INSERT INTO `project_student` VALUES ('1', '116');
INSERT INTO `project_student` VALUES ('1', '115');
INSERT INTO `project_student` VALUES ('1', '114');
INSERT INTO `project_student` VALUES ('1', '113');
INSERT INTO `project_student` VALUES ('1', '112');
INSERT INTO `project_student` VALUES ('1', '111');
INSERT INTO `project_student` VALUES ('1', '110');
INSERT INTO `project_student` VALUES ('1', '109');
INSERT INTO `project_student` VALUES ('1', '108');
INSERT INTO `project_student` VALUES ('1', '107');
INSERT INTO `project_student` VALUES ('1', '106');
INSERT INTO `project_student` VALUES ('1', '105');
INSERT INTO `project_student` VALUES ('1', '104');
INSERT INTO `project_student` VALUES ('1', '103');
INSERT INTO `project_student` VALUES ('1', '102');
INSERT INTO `project_student` VALUES ('1', '101');
INSERT INTO `project_student` VALUES ('1', '100');
INSERT INTO `project_student` VALUES ('1', '99');
INSERT INTO `project_student` VALUES ('1', '98');
INSERT INTO `project_student` VALUES ('1', '97');
INSERT INTO `project_student` VALUES ('1', '96');
INSERT INTO `project_student` VALUES ('1', '95');
INSERT INTO `project_student` VALUES ('1', '94');
INSERT INTO `project_student` VALUES ('1', '93');
INSERT INTO `project_student` VALUES ('1', '92');
INSERT INTO `project_student` VALUES ('1', '91');
INSERT INTO `project_student` VALUES ('1', '90');
INSERT INTO `project_student` VALUES ('1', '89');
INSERT INTO `project_student` VALUES ('1', '88');
INSERT INTO `project_student` VALUES ('1', '87');
INSERT INTO `project_student` VALUES ('1', '86');
INSERT INTO `project_student` VALUES ('1', '85');
INSERT INTO `project_student` VALUES ('1', '84');
INSERT INTO `project_student` VALUES ('1', '83');
INSERT INTO `project_student` VALUES ('1', '82');
INSERT INTO `project_student` VALUES ('1', '81');
INSERT INTO `project_student` VALUES ('1', '79');
INSERT INTO `project_student` VALUES ('1', '78');
INSERT INTO `project_student` VALUES ('1', '77');
INSERT INTO `project_student` VALUES ('1', '76');
INSERT INTO `project_student` VALUES ('1', '75');
INSERT INTO `project_student` VALUES ('1', '74');
INSERT INTO `project_student` VALUES ('1', '73');
INSERT INTO `project_student` VALUES ('1', '72');
INSERT INTO `project_student` VALUES ('1', '71');
INSERT INTO `project_student` VALUES ('1', '70');
INSERT INTO `project_student` VALUES ('1', '69');
INSERT INTO `project_student` VALUES ('1', '68');
INSERT INTO `project_student` VALUES ('1', '67');
INSERT INTO `project_student` VALUES ('1', '66');
INSERT INTO `project_student` VALUES ('1', '65');
INSERT INTO `project_student` VALUES ('1', '64');
INSERT INTO `project_student` VALUES ('1', '63');
INSERT INTO `project_student` VALUES ('1', '62');
INSERT INTO `project_student` VALUES ('1', '61');
INSERT INTO `project_student` VALUES ('1', '60');
INSERT INTO `project_student` VALUES ('1', '59');
INSERT INTO `project_student` VALUES ('1', '58');
INSERT INTO `project_student` VALUES ('1', '57');
INSERT INTO `project_student` VALUES ('1', '56');
INSERT INTO `project_student` VALUES ('1', '55');
INSERT INTO `project_student` VALUES ('1', '54');
INSERT INTO `project_student` VALUES ('1', '53');
INSERT INTO `project_student` VALUES ('1', '52');
INSERT INTO `project_student` VALUES ('1', '51');
INSERT INTO `project_student` VALUES ('1', '50');
INSERT INTO `project_student` VALUES ('1', '49');
INSERT INTO `project_student` VALUES ('1', '48');
INSERT INTO `project_student` VALUES ('1', '47');
INSERT INTO `project_student` VALUES ('1', '46');
INSERT INTO `project_student` VALUES ('1', '45');
INSERT INTO `project_student` VALUES ('1', '44');
INSERT INTO `project_student` VALUES ('1', '43');
INSERT INTO `project_student` VALUES ('1', '42');
INSERT INTO `project_student` VALUES ('1', '41');
INSERT INTO `project_student` VALUES ('1', '40');
INSERT INTO `project_student` VALUES ('1', '39');
INSERT INTO `project_student` VALUES ('1', '38');
INSERT INTO `project_student` VALUES ('1', '37');
INSERT INTO `project_student` VALUES ('1', '36');
INSERT INTO `project_student` VALUES ('1', '35');
INSERT INTO `project_student` VALUES ('1', '34');
INSERT INTO `project_student` VALUES ('1', '33');
INSERT INTO `project_student` VALUES ('1', '32');
INSERT INTO `project_student` VALUES ('1', '31');
INSERT INTO `project_student` VALUES ('1', '30');
INSERT INTO `project_student` VALUES ('1', '29');
INSERT INTO `project_student` VALUES ('1', '80');
INSERT INTO `project_student` VALUES ('2', '199');
INSERT INTO `project_student` VALUES ('2', '198');
INSERT INTO `project_student` VALUES ('2', '197');
INSERT INTO `project_student` VALUES ('2', '196');
INSERT INTO `project_student` VALUES ('2', '195');
INSERT INTO `project_student` VALUES ('2', '194');
INSERT INTO `project_student` VALUES ('2', '193');
INSERT INTO `project_student` VALUES ('2', '192');
INSERT INTO `project_student` VALUES ('2', '191');
INSERT INTO `project_student` VALUES ('2', '190');
INSERT INTO `project_student` VALUES ('2', '189');
INSERT INTO `project_student` VALUES ('2', '188');
INSERT INTO `project_student` VALUES ('2', '187');
INSERT INTO `project_student` VALUES ('2', '186');
INSERT INTO `project_student` VALUES ('2', '185');
INSERT INTO `project_student` VALUES ('2', '184');
INSERT INTO `project_student` VALUES ('2', '183');
INSERT INTO `project_student` VALUES ('2', '182');
INSERT INTO `project_student` VALUES ('2', '181');
INSERT INTO `project_student` VALUES ('2', '180');
INSERT INTO `project_student` VALUES ('2', '179');
INSERT INTO `project_student` VALUES ('2', '178');
INSERT INTO `project_student` VALUES ('2', '177');
INSERT INTO `project_student` VALUES ('2', '176');
INSERT INTO `project_student` VALUES ('2', '175');
INSERT INTO `project_student` VALUES ('2', '174');
INSERT INTO `project_student` VALUES ('2', '173');
INSERT INTO `project_student` VALUES ('2', '172');
INSERT INTO `project_student` VALUES ('2', '171');
INSERT INTO `project_student` VALUES ('2', '170');
INSERT INTO `project_student` VALUES ('2', '169');
INSERT INTO `project_student` VALUES ('2', '168');
INSERT INTO `project_student` VALUES ('2', '167');
INSERT INTO `project_student` VALUES ('2', '166');
INSERT INTO `project_student` VALUES ('2', '165');
INSERT INTO `project_student` VALUES ('2', '164');
INSERT INTO `project_student` VALUES ('2', '163');
INSERT INTO `project_student` VALUES ('2', '162');
INSERT INTO `project_student` VALUES ('2', '161');
INSERT INTO `project_student` VALUES ('2', '160');
INSERT INTO `project_student` VALUES ('2', '159');
INSERT INTO `project_student` VALUES ('2', '158');
INSERT INTO `project_student` VALUES ('2', '157');
INSERT INTO `project_student` VALUES ('2', '156');
INSERT INTO `project_student` VALUES ('2', '155');
INSERT INTO `project_student` VALUES ('2', '154');
INSERT INTO `project_student` VALUES ('2', '153');
INSERT INTO `project_student` VALUES ('2', '152');
INSERT INTO `project_student` VALUES ('2', '151');
INSERT INTO `project_student` VALUES ('2', '150');
INSERT INTO `project_student` VALUES ('2', '149');
INSERT INTO `project_student` VALUES ('2', '148');
INSERT INTO `project_student` VALUES ('2', '147');
INSERT INTO `project_student` VALUES ('2', '146');
INSERT INTO `project_student` VALUES ('2', '145');
INSERT INTO `project_student` VALUES ('2', '144');
INSERT INTO `project_student` VALUES ('2', '143');
INSERT INTO `project_student` VALUES ('2', '142');
INSERT INTO `project_student` VALUES ('2', '141');
INSERT INTO `project_student` VALUES ('2', '140');
INSERT INTO `project_student` VALUES ('2', '139');
INSERT INTO `project_student` VALUES ('2', '138');
INSERT INTO `project_student` VALUES ('2', '137');
INSERT INTO `project_student` VALUES ('2', '136');
INSERT INTO `project_student` VALUES ('3', '437');
INSERT INTO `project_student` VALUES ('3', '436');
INSERT INTO `project_student` VALUES ('3', '404');
INSERT INTO `project_student` VALUES ('3', '340');
INSERT INTO `project_student` VALUES ('3', '313');
INSERT INTO `project_student` VALUES ('3', '312');
INSERT INTO `project_student` VALUES ('3', '468');
INSERT INTO `project_student` VALUES ('3', '467');
INSERT INTO `project_student` VALUES ('3', '466');
INSERT INTO `project_student` VALUES ('3', '465');
INSERT INTO `project_student` VALUES ('3', '464');
INSERT INTO `project_student` VALUES ('3', '463');
INSERT INTO `project_student` VALUES ('3', '462');
INSERT INTO `project_student` VALUES ('3', '461');
INSERT INTO `project_student` VALUES ('3', '460');
INSERT INTO `project_student` VALUES ('3', '459');
INSERT INTO `project_student` VALUES ('3', '458');
INSERT INTO `project_student` VALUES ('3', '457');
INSERT INTO `project_student` VALUES ('3', '456');
INSERT INTO `project_student` VALUES ('3', '455');
INSERT INTO `project_student` VALUES ('3', '454');
INSERT INTO `project_student` VALUES ('3', '453');
INSERT INTO `project_student` VALUES ('3', '452');
INSERT INTO `project_student` VALUES ('3', '451');
INSERT INTO `project_student` VALUES ('3', '450');
INSERT INTO `project_student` VALUES ('3', '449');
INSERT INTO `project_student` VALUES ('3', '448');
INSERT INTO `project_student` VALUES ('3', '447');
INSERT INTO `project_student` VALUES ('3', '446');
INSERT INTO `project_student` VALUES ('3', '445');
INSERT INTO `project_student` VALUES ('3', '444');
INSERT INTO `project_student` VALUES ('3', '443');
INSERT INTO `project_student` VALUES ('3', '442');
INSERT INTO `project_student` VALUES ('3', '441');
INSERT INTO `project_student` VALUES ('3', '440');
INSERT INTO `project_student` VALUES ('3', '439');
INSERT INTO `project_student` VALUES ('3', '438');
INSERT INTO `project_student` VALUES ('3', '435');
INSERT INTO `project_student` VALUES ('3', '434');
INSERT INTO `project_student` VALUES ('3', '433');
INSERT INTO `project_student` VALUES ('3', '432');
INSERT INTO `project_student` VALUES ('3', '431');
INSERT INTO `project_student` VALUES ('3', '430');
INSERT INTO `project_student` VALUES ('3', '429');
INSERT INTO `project_student` VALUES ('3', '428');
INSERT INTO `project_student` VALUES ('3', '427');
INSERT INTO `project_student` VALUES ('3', '426');
INSERT INTO `project_student` VALUES ('3', '425');
INSERT INTO `project_student` VALUES ('3', '424');
INSERT INTO `project_student` VALUES ('3', '423');
INSERT INTO `project_student` VALUES ('3', '422');
INSERT INTO `project_student` VALUES ('3', '421');
INSERT INTO `project_student` VALUES ('3', '420');
INSERT INTO `project_student` VALUES ('3', '419');
INSERT INTO `project_student` VALUES ('3', '418');
INSERT INTO `project_student` VALUES ('3', '417');
INSERT INTO `project_student` VALUES ('3', '416');
INSERT INTO `project_student` VALUES ('3', '415');
INSERT INTO `project_student` VALUES ('3', '414');
INSERT INTO `project_student` VALUES ('3', '413');
INSERT INTO `project_student` VALUES ('3', '412');
INSERT INTO `project_student` VALUES ('3', '411');
INSERT INTO `project_student` VALUES ('3', '410');
INSERT INTO `project_student` VALUES ('3', '409');
INSERT INTO `project_student` VALUES ('3', '408');
INSERT INTO `project_student` VALUES ('3', '407');
INSERT INTO `project_student` VALUES ('3', '406');
INSERT INTO `project_student` VALUES ('3', '405');
INSERT INTO `project_student` VALUES ('3', '403');
INSERT INTO `project_student` VALUES ('3', '402');
INSERT INTO `project_student` VALUES ('3', '401');
INSERT INTO `project_student` VALUES ('3', '400');
INSERT INTO `project_student` VALUES ('3', '399');
INSERT INTO `project_student` VALUES ('3', '398');
INSERT INTO `project_student` VALUES ('3', '397');
INSERT INTO `project_student` VALUES ('3', '396');
INSERT INTO `project_student` VALUES ('3', '395');
INSERT INTO `project_student` VALUES ('3', '394');
INSERT INTO `project_student` VALUES ('3', '393');
INSERT INTO `project_student` VALUES ('3', '392');
INSERT INTO `project_student` VALUES ('3', '391');
INSERT INTO `project_student` VALUES ('3', '390');
INSERT INTO `project_student` VALUES ('3', '389');
INSERT INTO `project_student` VALUES ('3', '388');
INSERT INTO `project_student` VALUES ('3', '387');
INSERT INTO `project_student` VALUES ('3', '386');
INSERT INTO `project_student` VALUES ('3', '385');
INSERT INTO `project_student` VALUES ('3', '384');
INSERT INTO `project_student` VALUES ('3', '383');
INSERT INTO `project_student` VALUES ('3', '382');
INSERT INTO `project_student` VALUES ('3', '381');
INSERT INTO `project_student` VALUES ('3', '380');
INSERT INTO `project_student` VALUES ('3', '379');
INSERT INTO `project_student` VALUES ('3', '378');
INSERT INTO `project_student` VALUES ('3', '377');
INSERT INTO `project_student` VALUES ('3', '376');
INSERT INTO `project_student` VALUES ('3', '375');
INSERT INTO `project_student` VALUES ('3', '374');
INSERT INTO `project_student` VALUES ('3', '373');
INSERT INTO `project_student` VALUES ('3', '372');
INSERT INTO `project_student` VALUES ('3', '371');
INSERT INTO `project_student` VALUES ('3', '370');
INSERT INTO `project_student` VALUES ('3', '369');
INSERT INTO `project_student` VALUES ('3', '368');
INSERT INTO `project_student` VALUES ('3', '367');
INSERT INTO `project_student` VALUES ('3', '366');
INSERT INTO `project_student` VALUES ('3', '365');
INSERT INTO `project_student` VALUES ('3', '364');
INSERT INTO `project_student` VALUES ('3', '363');
INSERT INTO `project_student` VALUES ('3', '362');
INSERT INTO `project_student` VALUES ('3', '361');
INSERT INTO `project_student` VALUES ('3', '360');
INSERT INTO `project_student` VALUES ('3', '359');
INSERT INTO `project_student` VALUES ('3', '358');
INSERT INTO `project_student` VALUES ('3', '357');
INSERT INTO `project_student` VALUES ('3', '356');
INSERT INTO `project_student` VALUES ('3', '355');
INSERT INTO `project_student` VALUES ('3', '354');
INSERT INTO `project_student` VALUES ('3', '353');
INSERT INTO `project_student` VALUES ('3', '352');
INSERT INTO `project_student` VALUES ('3', '351');
INSERT INTO `project_student` VALUES ('3', '350');
INSERT INTO `project_student` VALUES ('3', '349');
INSERT INTO `project_student` VALUES ('3', '348');
INSERT INTO `project_student` VALUES ('3', '347');
INSERT INTO `project_student` VALUES ('3', '346');
INSERT INTO `project_student` VALUES ('3', '345');
INSERT INTO `project_student` VALUES ('3', '344');
INSERT INTO `project_student` VALUES ('3', '343');
INSERT INTO `project_student` VALUES ('3', '342');
INSERT INTO `project_student` VALUES ('3', '341');
INSERT INTO `project_student` VALUES ('3', '339');
INSERT INTO `project_student` VALUES ('3', '338');
INSERT INTO `project_student` VALUES ('3', '337');
INSERT INTO `project_student` VALUES ('3', '336');
INSERT INTO `project_student` VALUES ('3', '335');
INSERT INTO `project_student` VALUES ('3', '334');
INSERT INTO `project_student` VALUES ('3', '333');
INSERT INTO `project_student` VALUES ('3', '332');
INSERT INTO `project_student` VALUES ('3', '331');
INSERT INTO `project_student` VALUES ('3', '330');
INSERT INTO `project_student` VALUES ('3', '311');
INSERT INTO `project_student` VALUES ('3', '329');
INSERT INTO `project_student` VALUES ('3', '328');
INSERT INTO `project_student` VALUES ('3', '310');
INSERT INTO `project_student` VALUES ('3', '327');
INSERT INTO `project_student` VALUES ('3', '326');
INSERT INTO `project_student` VALUES ('3', '325');
INSERT INTO `project_student` VALUES ('3', '324');
INSERT INTO `project_student` VALUES ('3', '323');
INSERT INTO `project_student` VALUES ('3', '322');
INSERT INTO `project_student` VALUES ('3', '321');
INSERT INTO `project_student` VALUES ('3', '320');
INSERT INTO `project_student` VALUES ('3', '319');
INSERT INTO `project_student` VALUES ('3', '318');
INSERT INTO `project_student` VALUES ('3', '317');
INSERT INTO `project_student` VALUES ('3', '316');
INSERT INTO `project_student` VALUES ('3', '315');
INSERT INTO `project_student` VALUES ('3', '314');
INSERT INTO `project_student` VALUES ('3', '309');
INSERT INTO `project_student` VALUES ('3', '308');
INSERT INTO `project_student` VALUES ('3', '307');
INSERT INTO `project_student` VALUES ('3', '306');
INSERT INTO `project_student` VALUES ('3', '305');
INSERT INTO `project_student` VALUES ('3', '304');
INSERT INTO `project_student` VALUES ('3', '303');
INSERT INTO `project_student` VALUES ('3', '302');
INSERT INTO `project_student` VALUES ('3', '301');
INSERT INTO `project_student` VALUES ('3', '300');
INSERT INTO `project_student` VALUES ('3', '299');
INSERT INTO `project_student` VALUES ('3', '298');
INSERT INTO `project_student` VALUES ('3', '297');
INSERT INTO `project_student` VALUES ('3', '296');
INSERT INTO `project_student` VALUES ('3', '295');
INSERT INTO `project_student` VALUES ('3', '294');
INSERT INTO `project_student` VALUES ('3', '293');
INSERT INTO `project_student` VALUES ('3', '292');
INSERT INTO `project_student` VALUES ('3', '291');
INSERT INTO `project_student` VALUES ('3', '290');
INSERT INTO `project_student` VALUES ('3', '289');
INSERT INTO `project_student` VALUES ('3', '288');
INSERT INTO `project_student` VALUES ('3', '287');
INSERT INTO `project_student` VALUES ('3', '286');
INSERT INTO `project_student` VALUES ('3', '285');
INSERT INTO `project_student` VALUES ('3', '284');
INSERT INTO `project_student` VALUES ('3', '283');
INSERT INTO `project_student` VALUES ('3', '282');
INSERT INTO `project_student` VALUES ('3', '281');
INSERT INTO `project_student` VALUES ('3', '280');
INSERT INTO `project_student` VALUES ('3', '530');
INSERT INTO `project_student` VALUES ('3', '501');
INSERT INTO `project_student` VALUES ('3', '588');
INSERT INTO `project_student` VALUES ('3', '587');
INSERT INTO `project_student` VALUES ('3', '586');
INSERT INTO `project_student` VALUES ('3', '585');
INSERT INTO `project_student` VALUES ('3', '584');
INSERT INTO `project_student` VALUES ('3', '583');
INSERT INTO `project_student` VALUES ('3', '582');
INSERT INTO `project_student` VALUES ('3', '581');
INSERT INTO `project_student` VALUES ('3', '580');
INSERT INTO `project_student` VALUES ('3', '579');
INSERT INTO `project_student` VALUES ('3', '578');
INSERT INTO `project_student` VALUES ('3', '577');
INSERT INTO `project_student` VALUES ('3', '576');
INSERT INTO `project_student` VALUES ('3', '575');
INSERT INTO `project_student` VALUES ('3', '574');
INSERT INTO `project_student` VALUES ('3', '573');
INSERT INTO `project_student` VALUES ('3', '572');
INSERT INTO `project_student` VALUES ('3', '571');
INSERT INTO `project_student` VALUES ('3', '570');
INSERT INTO `project_student` VALUES ('3', '569');
INSERT INTO `project_student` VALUES ('3', '568');
INSERT INTO `project_student` VALUES ('3', '567');
INSERT INTO `project_student` VALUES ('3', '566');
INSERT INTO `project_student` VALUES ('3', '565');
INSERT INTO `project_student` VALUES ('3', '564');
INSERT INTO `project_student` VALUES ('3', '563');
INSERT INTO `project_student` VALUES ('3', '562');
INSERT INTO `project_student` VALUES ('3', '561');
INSERT INTO `project_student` VALUES ('3', '560');
INSERT INTO `project_student` VALUES ('3', '559');
INSERT INTO `project_student` VALUES ('3', '558');
INSERT INTO `project_student` VALUES ('3', '557');
INSERT INTO `project_student` VALUES ('3', '556');
INSERT INTO `project_student` VALUES ('3', '555');
INSERT INTO `project_student` VALUES ('3', '554');
INSERT INTO `project_student` VALUES ('3', '553');
INSERT INTO `project_student` VALUES ('3', '552');
INSERT INTO `project_student` VALUES ('3', '551');
INSERT INTO `project_student` VALUES ('3', '550');
INSERT INTO `project_student` VALUES ('3', '549');
INSERT INTO `project_student` VALUES ('3', '548');
INSERT INTO `project_student` VALUES ('3', '547');
INSERT INTO `project_student` VALUES ('3', '546');
INSERT INTO `project_student` VALUES ('3', '545');
INSERT INTO `project_student` VALUES ('3', '544');
INSERT INTO `project_student` VALUES ('3', '543');
INSERT INTO `project_student` VALUES ('3', '542');
INSERT INTO `project_student` VALUES ('3', '541');
INSERT INTO `project_student` VALUES ('3', '540');
INSERT INTO `project_student` VALUES ('3', '539');
INSERT INTO `project_student` VALUES ('3', '538');
INSERT INTO `project_student` VALUES ('3', '537');
INSERT INTO `project_student` VALUES ('3', '536');
INSERT INTO `project_student` VALUES ('3', '535');
INSERT INTO `project_student` VALUES ('3', '534');
INSERT INTO `project_student` VALUES ('3', '533');
INSERT INTO `project_student` VALUES ('3', '532');
INSERT INTO `project_student` VALUES ('3', '531');
INSERT INTO `project_student` VALUES ('3', '529');
INSERT INTO `project_student` VALUES ('3', '528');
INSERT INTO `project_student` VALUES ('3', '527');
INSERT INTO `project_student` VALUES ('3', '526');
INSERT INTO `project_student` VALUES ('3', '525');
INSERT INTO `project_student` VALUES ('3', '524');
INSERT INTO `project_student` VALUES ('3', '523');
INSERT INTO `project_student` VALUES ('3', '522');
INSERT INTO `project_student` VALUES ('3', '521');
INSERT INTO `project_student` VALUES ('3', '520');
INSERT INTO `project_student` VALUES ('3', '519');
INSERT INTO `project_student` VALUES ('3', '518');
INSERT INTO `project_student` VALUES ('3', '517');
INSERT INTO `project_student` VALUES ('3', '516');
INSERT INTO `project_student` VALUES ('3', '515');
INSERT INTO `project_student` VALUES ('3', '514');
INSERT INTO `project_student` VALUES ('3', '513');
INSERT INTO `project_student` VALUES ('3', '512');
INSERT INTO `project_student` VALUES ('3', '511');
INSERT INTO `project_student` VALUES ('3', '510');
INSERT INTO `project_student` VALUES ('3', '509');
INSERT INTO `project_student` VALUES ('3', '508');
INSERT INTO `project_student` VALUES ('3', '507');
INSERT INTO `project_student` VALUES ('3', '506');
INSERT INTO `project_student` VALUES ('3', '505');
INSERT INTO `project_student` VALUES ('3', '504');
INSERT INTO `project_student` VALUES ('3', '503');
INSERT INTO `project_student` VALUES ('3', '502');
INSERT INTO `project_student` VALUES ('3', '500');
INSERT INTO `project_student` VALUES ('3', '499');
INSERT INTO `project_student` VALUES ('3', '498');
INSERT INTO `project_student` VALUES ('3', '497');
INSERT INTO `project_student` VALUES ('3', '496');
INSERT INTO `project_student` VALUES ('3', '495');
INSERT INTO `project_student` VALUES ('3', '494');
INSERT INTO `project_student` VALUES ('3', '493');
INSERT INTO `project_student` VALUES ('3', '492');
INSERT INTO `project_student` VALUES ('3', '491');
INSERT INTO `project_student` VALUES ('3', '490');
INSERT INTO `project_student` VALUES ('3', '489');
INSERT INTO `project_student` VALUES ('3', '488');
INSERT INTO `project_student` VALUES ('3', '487');
INSERT INTO `project_student` VALUES ('3', '486');
INSERT INTO `project_student` VALUES ('3', '485');
INSERT INTO `project_student` VALUES ('3', '484');
INSERT INTO `project_student` VALUES ('3', '483');
INSERT INTO `project_student` VALUES ('3', '482');
INSERT INTO `project_student` VALUES ('3', '481');
INSERT INTO `project_student` VALUES ('3', '480');
INSERT INTO `project_student` VALUES ('3', '479');
INSERT INTO `project_student` VALUES ('3', '478');
INSERT INTO `project_student` VALUES ('3', '477');
INSERT INTO `project_student` VALUES ('3', '476');
INSERT INTO `project_student` VALUES ('3', '475');
INSERT INTO `project_student` VALUES ('3', '474');
INSERT INTO `project_student` VALUES ('3', '473');
INSERT INTO `project_student` VALUES ('3', '472');
INSERT INTO `project_student` VALUES ('3', '471');
INSERT INTO `project_student` VALUES ('3', '670');
INSERT INTO `project_student` VALUES ('3', '669');
INSERT INTO `project_student` VALUES ('3', '668');
INSERT INTO `project_student` VALUES ('3', '667');
INSERT INTO `project_student` VALUES ('3', '666');
INSERT INTO `project_student` VALUES ('3', '665');
INSERT INTO `project_student` VALUES ('3', '664');
INSERT INTO `project_student` VALUES ('3', '663');
INSERT INTO `project_student` VALUES ('3', '662');
INSERT INTO `project_student` VALUES ('3', '661');
INSERT INTO `project_student` VALUES ('3', '660');
INSERT INTO `project_student` VALUES ('3', '659');
INSERT INTO `project_student` VALUES ('3', '658');
INSERT INTO `project_student` VALUES ('3', '657');
INSERT INTO `project_student` VALUES ('3', '656');
INSERT INTO `project_student` VALUES ('3', '655');
INSERT INTO `project_student` VALUES ('3', '654');
INSERT INTO `project_student` VALUES ('3', '653');
INSERT INTO `project_student` VALUES ('3', '652');
INSERT INTO `project_student` VALUES ('3', '651');
INSERT INTO `project_student` VALUES ('3', '650');
INSERT INTO `project_student` VALUES ('3', '649');
INSERT INTO `project_student` VALUES ('3', '648');
INSERT INTO `project_student` VALUES ('3', '647');
INSERT INTO `project_student` VALUES ('3', '646');
INSERT INTO `project_student` VALUES ('3', '645');
INSERT INTO `project_student` VALUES ('3', '644');
INSERT INTO `project_student` VALUES ('3', '643');
INSERT INTO `project_student` VALUES ('3', '642');
INSERT INTO `project_student` VALUES ('3', '641');
INSERT INTO `project_student` VALUES ('3', '640');
INSERT INTO `project_student` VALUES ('3', '639');
INSERT INTO `project_student` VALUES ('3', '638');
INSERT INTO `project_student` VALUES ('3', '637');
INSERT INTO `project_student` VALUES ('3', '636');
INSERT INTO `project_student` VALUES ('3', '635');
INSERT INTO `project_student` VALUES ('3', '634');
INSERT INTO `project_student` VALUES ('3', '633');
INSERT INTO `project_student` VALUES ('3', '632');
INSERT INTO `project_student` VALUES ('3', '631');
INSERT INTO `project_student` VALUES ('3', '630');
INSERT INTO `project_student` VALUES ('3', '629');
INSERT INTO `project_student` VALUES ('3', '628');
INSERT INTO `project_student` VALUES ('3', '627');
INSERT INTO `project_student` VALUES ('3', '626');
INSERT INTO `project_student` VALUES ('3', '625');
INSERT INTO `project_student` VALUES ('3', '624');
INSERT INTO `project_student` VALUES ('3', '623');
INSERT INTO `project_student` VALUES ('3', '622');
INSERT INTO `project_student` VALUES ('3', '621');
INSERT INTO `project_student` VALUES ('3', '620');
INSERT INTO `project_student` VALUES ('3', '619');
INSERT INTO `project_student` VALUES ('3', '618');
INSERT INTO `project_student` VALUES ('3', '617');
INSERT INTO `project_student` VALUES ('3', '616');
INSERT INTO `project_student` VALUES ('3', '615');
INSERT INTO `project_student` VALUES ('3', '614');
INSERT INTO `project_student` VALUES ('3', '613');
INSERT INTO `project_student` VALUES ('3', '612');
INSERT INTO `project_student` VALUES ('3', '611');
INSERT INTO `project_student` VALUES ('3', '610');
INSERT INTO `project_student` VALUES ('3', '609');
INSERT INTO `project_student` VALUES ('3', '608');
INSERT INTO `project_student` VALUES ('3', '607');
INSERT INTO `project_student` VALUES ('3', '606');
INSERT INTO `project_student` VALUES ('3', '605');
INSERT INTO `project_student` VALUES ('3', '604');
INSERT INTO `project_student` VALUES ('3', '603');
INSERT INTO `project_student` VALUES ('3', '602');
INSERT INTO `project_student` VALUES ('3', '601');
INSERT INTO `project_student` VALUES ('3', '600');
INSERT INTO `project_student` VALUES ('3', '599');
INSERT INTO `project_student` VALUES ('3', '598');
INSERT INTO `project_student` VALUES ('3', '597');
INSERT INTO `project_student` VALUES ('3', '596');
INSERT INTO `project_student` VALUES ('3', '595');
INSERT INTO `project_student` VALUES ('3', '594');
INSERT INTO `project_student` VALUES ('3', '593');
INSERT INTO `project_student` VALUES ('3', '592');
INSERT INTO `project_student` VALUES ('3', '591');
INSERT INTO `project_student` VALUES ('3', '590');
INSERT INTO `project_student` VALUES ('3', '705');
INSERT INTO `project_student` VALUES ('3', '861');
INSERT INTO `project_student` VALUES ('3', '860');
INSERT INTO `project_student` VALUES ('3', '859');
INSERT INTO `project_student` VALUES ('3', '858');
INSERT INTO `project_student` VALUES ('3', '857');
INSERT INTO `project_student` VALUES ('3', '856');
INSERT INTO `project_student` VALUES ('3', '855');
INSERT INTO `project_student` VALUES ('3', '854');
INSERT INTO `project_student` VALUES ('3', '853');
INSERT INTO `project_student` VALUES ('3', '852');
INSERT INTO `project_student` VALUES ('3', '851');
INSERT INTO `project_student` VALUES ('3', '850');
INSERT INTO `project_student` VALUES ('3', '849');
INSERT INTO `project_student` VALUES ('3', '848');
INSERT INTO `project_student` VALUES ('3', '847');
INSERT INTO `project_student` VALUES ('3', '846');
INSERT INTO `project_student` VALUES ('3', '845');
INSERT INTO `project_student` VALUES ('3', '844');
INSERT INTO `project_student` VALUES ('3', '843');
INSERT INTO `project_student` VALUES ('3', '842');
INSERT INTO `project_student` VALUES ('3', '841');
INSERT INTO `project_student` VALUES ('3', '840');
INSERT INTO `project_student` VALUES ('3', '839');
INSERT INTO `project_student` VALUES ('3', '838');
INSERT INTO `project_student` VALUES ('3', '837');
INSERT INTO `project_student` VALUES ('3', '836');
INSERT INTO `project_student` VALUES ('3', '835');
INSERT INTO `project_student` VALUES ('3', '834');
INSERT INTO `project_student` VALUES ('3', '833');
INSERT INTO `project_student` VALUES ('3', '832');
INSERT INTO `project_student` VALUES ('3', '831');
INSERT INTO `project_student` VALUES ('3', '830');
INSERT INTO `project_student` VALUES ('3', '829');
INSERT INTO `project_student` VALUES ('3', '828');
INSERT INTO `project_student` VALUES ('3', '827');
INSERT INTO `project_student` VALUES ('3', '826');
INSERT INTO `project_student` VALUES ('3', '825');
INSERT INTO `project_student` VALUES ('3', '824');
INSERT INTO `project_student` VALUES ('3', '823');
INSERT INTO `project_student` VALUES ('3', '822');
INSERT INTO `project_student` VALUES ('3', '821');
INSERT INTO `project_student` VALUES ('3', '820');
INSERT INTO `project_student` VALUES ('3', '819');
INSERT INTO `project_student` VALUES ('3', '818');
INSERT INTO `project_student` VALUES ('3', '817');
INSERT INTO `project_student` VALUES ('3', '816');
INSERT INTO `project_student` VALUES ('3', '815');
INSERT INTO `project_student` VALUES ('3', '814');
INSERT INTO `project_student` VALUES ('3', '813');
INSERT INTO `project_student` VALUES ('3', '812');
INSERT INTO `project_student` VALUES ('3', '811');
INSERT INTO `project_student` VALUES ('3', '810');
INSERT INTO `project_student` VALUES ('3', '809');
INSERT INTO `project_student` VALUES ('3', '808');
INSERT INTO `project_student` VALUES ('3', '807');
INSERT INTO `project_student` VALUES ('3', '806');
INSERT INTO `project_student` VALUES ('3', '805');
INSERT INTO `project_student` VALUES ('3', '804');
INSERT INTO `project_student` VALUES ('3', '803');
INSERT INTO `project_student` VALUES ('3', '802');
INSERT INTO `project_student` VALUES ('3', '801');
INSERT INTO `project_student` VALUES ('3', '800');
INSERT INTO `project_student` VALUES ('3', '799');
INSERT INTO `project_student` VALUES ('3', '798');
INSERT INTO `project_student` VALUES ('3', '797');
INSERT INTO `project_student` VALUES ('3', '796');
INSERT INTO `project_student` VALUES ('3', '795');
INSERT INTO `project_student` VALUES ('3', '794');
INSERT INTO `project_student` VALUES ('3', '793');
INSERT INTO `project_student` VALUES ('3', '792');
INSERT INTO `project_student` VALUES ('3', '791');
INSERT INTO `project_student` VALUES ('3', '790');
INSERT INTO `project_student` VALUES ('3', '789');
INSERT INTO `project_student` VALUES ('3', '788');
INSERT INTO `project_student` VALUES ('3', '787');
INSERT INTO `project_student` VALUES ('3', '786');
INSERT INTO `project_student` VALUES ('3', '785');
INSERT INTO `project_student` VALUES ('3', '784');
INSERT INTO `project_student` VALUES ('3', '783');
INSERT INTO `project_student` VALUES ('3', '782');
INSERT INTO `project_student` VALUES ('3', '781');
INSERT INTO `project_student` VALUES ('3', '780');
INSERT INTO `project_student` VALUES ('3', '779');
INSERT INTO `project_student` VALUES ('3', '778');
INSERT INTO `project_student` VALUES ('3', '777');
INSERT INTO `project_student` VALUES ('3', '776');
INSERT INTO `project_student` VALUES ('3', '775');
INSERT INTO `project_student` VALUES ('3', '774');
INSERT INTO `project_student` VALUES ('3', '773');
INSERT INTO `project_student` VALUES ('3', '772');
INSERT INTO `project_student` VALUES ('3', '771');
INSERT INTO `project_student` VALUES ('3', '770');
INSERT INTO `project_student` VALUES ('3', '769');
INSERT INTO `project_student` VALUES ('3', '768');
INSERT INTO `project_student` VALUES ('3', '767');
INSERT INTO `project_student` VALUES ('3', '766');
INSERT INTO `project_student` VALUES ('3', '765');
INSERT INTO `project_student` VALUES ('3', '764');
INSERT INTO `project_student` VALUES ('3', '763');
INSERT INTO `project_student` VALUES ('3', '762');
INSERT INTO `project_student` VALUES ('3', '761');
INSERT INTO `project_student` VALUES ('3', '760');
INSERT INTO `project_student` VALUES ('3', '759');
INSERT INTO `project_student` VALUES ('3', '758');
INSERT INTO `project_student` VALUES ('3', '757');
INSERT INTO `project_student` VALUES ('3', '756');
INSERT INTO `project_student` VALUES ('3', '755');
INSERT INTO `project_student` VALUES ('3', '754');
INSERT INTO `project_student` VALUES ('3', '753');
INSERT INTO `project_student` VALUES ('3', '752');
INSERT INTO `project_student` VALUES ('3', '751');
INSERT INTO `project_student` VALUES ('3', '750');
INSERT INTO `project_student` VALUES ('3', '749');
INSERT INTO `project_student` VALUES ('3', '748');
INSERT INTO `project_student` VALUES ('3', '747');
INSERT INTO `project_student` VALUES ('3', '746');
INSERT INTO `project_student` VALUES ('3', '745');
INSERT INTO `project_student` VALUES ('3', '744');
INSERT INTO `project_student` VALUES ('3', '743');
INSERT INTO `project_student` VALUES ('3', '742');
INSERT INTO `project_student` VALUES ('3', '741');
INSERT INTO `project_student` VALUES ('3', '740');
INSERT INTO `project_student` VALUES ('3', '739');
INSERT INTO `project_student` VALUES ('3', '738');
INSERT INTO `project_student` VALUES ('3', '737');
INSERT INTO `project_student` VALUES ('3', '736');
INSERT INTO `project_student` VALUES ('3', '735');
INSERT INTO `project_student` VALUES ('3', '734');
INSERT INTO `project_student` VALUES ('3', '733');
INSERT INTO `project_student` VALUES ('3', '732');
INSERT INTO `project_student` VALUES ('3', '731');
INSERT INTO `project_student` VALUES ('3', '730');
INSERT INTO `project_student` VALUES ('3', '729');
INSERT INTO `project_student` VALUES ('3', '728');
INSERT INTO `project_student` VALUES ('3', '727');
INSERT INTO `project_student` VALUES ('3', '726');
INSERT INTO `project_student` VALUES ('3', '725');
INSERT INTO `project_student` VALUES ('3', '724');
INSERT INTO `project_student` VALUES ('3', '723');
INSERT INTO `project_student` VALUES ('3', '722');
INSERT INTO `project_student` VALUES ('3', '721');
INSERT INTO `project_student` VALUES ('3', '720');
INSERT INTO `project_student` VALUES ('3', '719');
INSERT INTO `project_student` VALUES ('3', '718');
INSERT INTO `project_student` VALUES ('3', '717');
INSERT INTO `project_student` VALUES ('3', '716');
INSERT INTO `project_student` VALUES ('3', '715');
INSERT INTO `project_student` VALUES ('3', '714');
INSERT INTO `project_student` VALUES ('3', '713');
INSERT INTO `project_student` VALUES ('3', '712');
INSERT INTO `project_student` VALUES ('3', '711');
INSERT INTO `project_student` VALUES ('3', '710');
INSERT INTO `project_student` VALUES ('3', '709');
INSERT INTO `project_student` VALUES ('3', '708');
INSERT INTO `project_student` VALUES ('3', '707');
INSERT INTO `project_student` VALUES ('3', '706');
INSERT INTO `project_student` VALUES ('3', '704');
INSERT INTO `project_student` VALUES ('3', '703');
INSERT INTO `project_student` VALUES ('3', '702');
INSERT INTO `project_student` VALUES ('3', '701');
INSERT INTO `project_student` VALUES ('3', '700');
INSERT INTO `project_student` VALUES ('3', '699');
INSERT INTO `project_student` VALUES ('3', '698');
INSERT INTO `project_student` VALUES ('3', '697');
INSERT INTO `project_student` VALUES ('3', '696');
INSERT INTO `project_student` VALUES ('3', '695');
INSERT INTO `project_student` VALUES ('3', '694');
INSERT INTO `project_student` VALUES ('3', '693');
INSERT INTO `project_student` VALUES ('3', '692');
INSERT INTO `project_student` VALUES ('3', '691');
INSERT INTO `project_student` VALUES ('3', '690');
INSERT INTO `project_student` VALUES ('3', '689');
INSERT INTO `project_student` VALUES ('3', '688');
INSERT INTO `project_student` VALUES ('3', '687');
INSERT INTO `project_student` VALUES ('3', '686');
INSERT INTO `project_student` VALUES ('3', '685');
INSERT INTO `project_student` VALUES ('3', '684');
INSERT INTO `project_student` VALUES ('3', '683');
INSERT INTO `project_student` VALUES ('3', '682');
INSERT INTO `project_student` VALUES ('3', '681');
INSERT INTO `project_student` VALUES ('3', '680');
INSERT INTO `project_student` VALUES ('3', '679');
INSERT INTO `project_student` VALUES ('3', '678');
INSERT INTO `project_student` VALUES ('3', '677');
INSERT INTO `project_student` VALUES ('3', '676');
INSERT INTO `project_student` VALUES ('3', '675');
INSERT INTO `project_student` VALUES ('3', '674');
INSERT INTO `project_student` VALUES ('3', '673');
INSERT INTO `project_student` VALUES ('3', '672');
INSERT INTO `project_student` VALUES ('3', '671');
INSERT INTO `project_student` VALUES ('3', '863');
INSERT INTO `project_student` VALUES ('3', '865');
INSERT INTO `project_student` VALUES ('3', '866');
INSERT INTO `project_student` VALUES ('3', '867');
INSERT INTO `project_student` VALUES ('4', '29');

-- ----------------------------
-- Table structure for project_teacher
-- ----------------------------
DROP TABLE IF EXISTS `project_teacher`;
CREATE TABLE `project_teacher` (
  `projectid` bigint(11) NOT NULL COMMENT '论文工作ID',
  `teacherid` bigint(11) NOT NULL COMMENT '教师ID'
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

-- ----------------------------
-- Records of project_teacher
-- ----------------------------
INSERT INTO `project_teacher` VALUES ('1', '19');
INSERT INTO `project_teacher` VALUES ('1', '18');
INSERT INTO `project_teacher` VALUES ('1', '17');
INSERT INTO `project_teacher` VALUES ('1', '15');
INSERT INTO `project_teacher` VALUES ('1', '16');
INSERT INTO `project_teacher` VALUES ('1', '6');
INSERT INTO `project_teacher` VALUES ('1', '14');
INSERT INTO `project_teacher` VALUES ('1', '13');
INSERT INTO `project_teacher` VALUES ('1', '12');
INSERT INTO `project_teacher` VALUES ('1', '22');
INSERT INTO `project_teacher` VALUES ('1', '4');
INSERT INTO `project_teacher` VALUES ('1', '28');
INSERT INTO `project_teacher` VALUES ('1', '23');
INSERT INTO `project_teacher` VALUES ('1', '21');
INSERT INTO `project_teacher` VALUES ('1', '20');
INSERT INTO `project_teacher` VALUES ('1', '7');
INSERT INTO `project_teacher` VALUES ('1', '10');
INSERT INTO `project_teacher` VALUES ('1', '27');
INSERT INTO `project_teacher` VALUES ('1', '11');
INSERT INTO `project_teacher` VALUES ('1', '25');
INSERT INTO `project_teacher` VALUES ('1', '26');
INSERT INTO `project_teacher` VALUES ('1', '9');
INSERT INTO `project_teacher` VALUES ('1', '8');
INSERT INTO `project_teacher` VALUES ('1', '5');
INSERT INTO `project_teacher` VALUES ('1', '24');
INSERT INTO `project_teacher` VALUES ('2', '19');
INSERT INTO `project_teacher` VALUES ('2', '18');
INSERT INTO `project_teacher` VALUES ('2', '17');
INSERT INTO `project_teacher` VALUES ('2', '15');
INSERT INTO `project_teacher` VALUES ('2', '16');
INSERT INTO `project_teacher` VALUES ('2', '6');
INSERT INTO `project_teacher` VALUES ('2', '14');
INSERT INTO `project_teacher` VALUES ('2', '13');
INSERT INTO `project_teacher` VALUES ('2', '12');
INSERT INTO `project_teacher` VALUES ('2', '22');
INSERT INTO `project_teacher` VALUES ('2', '4');
INSERT INTO `project_teacher` VALUES ('2', '28');
INSERT INTO `project_teacher` VALUES ('2', '23');
INSERT INTO `project_teacher` VALUES ('2', '21');
INSERT INTO `project_teacher` VALUES ('2', '20');
INSERT INTO `project_teacher` VALUES ('2', '7');
INSERT INTO `project_teacher` VALUES ('2', '10');
INSERT INTO `project_teacher` VALUES ('2', '27');
INSERT INTO `project_teacher` VALUES ('2', '11');
INSERT INTO `project_teacher` VALUES ('2', '25');
INSERT INTO `project_teacher` VALUES ('2', '9');
INSERT INTO `project_teacher` VALUES ('2', '8');
INSERT INTO `project_teacher` VALUES ('2', '5');
INSERT INTO `project_teacher` VALUES ('2', '24');
INSERT INTO `project_teacher` VALUES ('3', '277');
INSERT INTO `project_teacher` VALUES ('3', '276');
INSERT INTO `project_teacher` VALUES ('3', '275');
INSERT INTO `project_teacher` VALUES ('3', '274');
INSERT INTO `project_teacher` VALUES ('3', '273');
INSERT INTO `project_teacher` VALUES ('3', '272');
INSERT INTO `project_teacher` VALUES ('3', '271');
INSERT INTO `project_teacher` VALUES ('3', '270');
INSERT INTO `project_teacher` VALUES ('3', '269');
INSERT INTO `project_teacher` VALUES ('3', '268');
INSERT INTO `project_teacher` VALUES ('3', '267');
INSERT INTO `project_teacher` VALUES ('3', '266');
INSERT INTO `project_teacher` VALUES ('3', '265');
INSERT INTO `project_teacher` VALUES ('3', '264');
INSERT INTO `project_teacher` VALUES ('3', '263');
INSERT INTO `project_teacher` VALUES ('3', '262');
INSERT INTO `project_teacher` VALUES ('3', '261');
INSERT INTO `project_teacher` VALUES ('3', '260');
INSERT INTO `project_teacher` VALUES ('3', '259');
INSERT INTO `project_teacher` VALUES ('3', '258');
INSERT INTO `project_teacher` VALUES ('3', '257');
INSERT INTO `project_teacher` VALUES ('3', '256');
INSERT INTO `project_teacher` VALUES ('3', '255');
INSERT INTO `project_teacher` VALUES ('3', '254');
INSERT INTO `project_teacher` VALUES ('3', '253');
INSERT INTO `project_teacher` VALUES ('3', '252');
INSERT INTO `project_teacher` VALUES ('3', '251');
INSERT INTO `project_teacher` VALUES ('3', '250');
INSERT INTO `project_teacher` VALUES ('3', '249');
INSERT INTO `project_teacher` VALUES ('3', '248');
INSERT INTO `project_teacher` VALUES ('3', '247');
INSERT INTO `project_teacher` VALUES ('3', '246');
INSERT INTO `project_teacher` VALUES ('3', '245');
INSERT INTO `project_teacher` VALUES ('3', '244');
INSERT INTO `project_teacher` VALUES ('3', '243');
INSERT INTO `project_teacher` VALUES ('3', '242');
INSERT INTO `project_teacher` VALUES ('3', '241');
INSERT INTO `project_teacher` VALUES ('3', '240');
INSERT INTO `project_teacher` VALUES ('3', '239');
INSERT INTO `project_teacher` VALUES ('3', '238');
INSERT INTO `project_teacher` VALUES ('3', '237');
INSERT INTO `project_teacher` VALUES ('3', '236');
INSERT INTO `project_teacher` VALUES ('3', '234');
INSERT INTO `project_teacher` VALUES ('3', '233');
INSERT INTO `project_teacher` VALUES ('3', '232');
INSERT INTO `project_teacher` VALUES ('3', '231');
INSERT INTO `project_teacher` VALUES ('3', '230');
INSERT INTO `project_teacher` VALUES ('3', '229');
INSERT INTO `project_teacher` VALUES ('3', '228');
INSERT INTO `project_teacher` VALUES ('3', '227');
INSERT INTO `project_teacher` VALUES ('3', '226');
INSERT INTO `project_teacher` VALUES ('3', '225');
INSERT INTO `project_teacher` VALUES ('3', '224');
INSERT INTO `project_teacher` VALUES ('3', '223');
INSERT INTO `project_teacher` VALUES ('3', '222');
INSERT INTO `project_teacher` VALUES ('3', '221');
INSERT INTO `project_teacher` VALUES ('3', '220');
INSERT INTO `project_teacher` VALUES ('3', '219');
INSERT INTO `project_teacher` VALUES ('3', '218');
INSERT INTO `project_teacher` VALUES ('3', '217');
INSERT INTO `project_teacher` VALUES ('3', '216');
INSERT INTO `project_teacher` VALUES ('3', '215');
INSERT INTO `project_teacher` VALUES ('3', '214');
INSERT INTO `project_teacher` VALUES ('3', '213');
INSERT INTO `project_teacher` VALUES ('3', '212');
INSERT INTO `project_teacher` VALUES ('3', '211');
INSERT INTO `project_teacher` VALUES ('3', '210');
INSERT INTO `project_teacher` VALUES ('3', '209');
INSERT INTO `project_teacher` VALUES ('3', '208');
INSERT INTO `project_teacher` VALUES ('3', '207');
INSERT INTO `project_teacher` VALUES ('3', '206');
INSERT INTO `project_teacher` VALUES ('3', '205');
INSERT INTO `project_teacher` VALUES ('3', '204');
INSERT INTO `project_teacher` VALUES ('3', '203');
INSERT INTO `project_teacher` VALUES ('3', '202');
INSERT INTO `project_teacher` VALUES ('3', '278');
INSERT INTO `project_teacher` VALUES ('3', '279');
INSERT INTO `project_teacher` VALUES ('3', '862');
INSERT INTO `project_teacher` VALUES ('3', '864');
INSERT INTO `project_teacher` VALUES ('4', '6');
INSERT INTO `project_teacher` VALUES ('4', '19');
INSERT INTO `project_teacher` VALUES ('4', '18');
INSERT INTO `project_teacher` VALUES ('4', '17');
INSERT INTO `project_teacher` VALUES ('4', '15');
INSERT INTO `project_teacher` VALUES ('4', '16');
INSERT INTO `project_teacher` VALUES ('4', '14');
INSERT INTO `project_teacher` VALUES ('4', '13');
INSERT INTO `project_teacher` VALUES ('4', '12');
INSERT INTO `project_teacher` VALUES ('4', '22');
INSERT INTO `project_teacher` VALUES ('4', '4');
INSERT INTO `project_teacher` VALUES ('4', '28');
INSERT INTO `project_teacher` VALUES ('4', '23');
INSERT INTO `project_teacher` VALUES ('4', '21');
INSERT INTO `project_teacher` VALUES ('4', '20');
INSERT INTO `project_teacher` VALUES ('4', '7');
INSERT INTO `project_teacher` VALUES ('4', '10');
INSERT INTO `project_teacher` VALUES ('4', '27');
INSERT INTO `project_teacher` VALUES ('4', '11');
INSERT INTO `project_teacher` VALUES ('4', '25');
INSERT INTO `project_teacher` VALUES ('4', '26');

-- ----------------------------
-- Table structure for psource
-- ----------------------------
DROP TABLE IF EXISTS `psource`;
CREATE TABLE `psource` (
  `id` bigint(10) NOT NULL AUTO_INCREMENT,
  `orgid` bigint(10) DEFAULT NULL COMMENT '所属组织机构',
  `source` varchar(255) DEFAULT '' COMMENT '论文来源',
  `valid` tinyint(1) DEFAULT NULL COMMENT '是否可用（也即是否删除）',
  `cdate` datetime DEFAULT NULL COMMENT '创建时间',
  `mdate` datetime DEFAULT NULL COMMENT '更新时间',
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=10 DEFAULT CHARSET=utf8;

-- ----------------------------
-- Records of psource
-- ----------------------------
INSERT INTO `psource` VALUES ('1', '2', '导师课题', '1', '2016-10-11 11:54:48', '2016-10-11 11:54:48');
INSERT INTO `psource` VALUES ('2', '2', '学生创新项目', '1', '2016-10-11 11:55:02', '2016-10-11 12:02:56');
INSERT INTO `psource` VALUES ('3', '2', '导师出题', '1', '2016-10-11 11:57:10', '2016-10-11 12:03:10');
INSERT INTO `psource` VALUES ('4', '2', '学生定题', '1', '2016-10-11 11:57:17', '2016-10-11 12:03:23');
INSERT INTO `psource` VALUES ('5', '2', '其他', '1', '2016-10-11 12:03:30', '2016-10-11 12:03:30');
INSERT INTO `psource` VALUES ('6', '1', '科研项目', '1', '2016-10-11 15:10:25', '2016-10-11 15:10:25');
INSERT INTO `psource` VALUES ('7', '1', '生产实践', '1', '2016-10-11 15:10:36', '2016-10-11 15:10:36');
INSERT INTO `psource` VALUES ('8', '1', '教学改革项目', '1', '2016-10-11 15:10:55', '2016-10-11 15:10:55');
INSERT INTO `psource` VALUES ('9', '1', '其他', '1', '2016-10-11 15:11:06', '2016-10-11 15:11:06');

-- ----------------------------
-- Table structure for resource
-- ----------------------------
DROP TABLE IF EXISTS `resource`;
CREATE TABLE `resource` (
  `id` bigint(10) NOT NULL AUTO_INCREMENT COMMENT '主键，自动递增',
  `name` varchar(255) NOT NULL COMMENT '资源的中文名称',
  `num` bigint(10) NOT NULL COMMENT '资源排列顺序(值越小，越靠前。)',
  `pid` bigint(10) DEFAULT NULL COMMENT '父资源的id',
  `url` varchar(255) NOT NULL COMMENT '相对的访问路径',
  `valid` tinyint(1) NOT NULL DEFAULT '1' COMMENT '当前元组是否有效，1（true）表示有效；0（false）表示无效【无效时不能操作该元组】',
  `cdate` datetime NOT NULL COMMENT '当前元组的生成时间',
  `mdate` datetime NOT NULL COMMENT '当前元组信息发生变化的时间',
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=108 DEFAULT CHARSET=utf8;

-- ----------------------------
-- Records of resource
-- ----------------------------
INSERT INTO `resource` VALUES ('1', 'root', '1', null, '', '1', '2015-10-25 11:00:00', '2015-10-25 11:00:00');
INSERT INTO `resource` VALUES ('2', '用户管理', '2', '1', '', '1', '2015-10-25 11:02:00', '2015-12-22 08:53:52');
INSERT INTO `resource` VALUES ('3', '信息管理', '3', '1', '', '1', '2015-10-25 11:02:00', '2015-12-22 08:54:06');
INSERT INTO `resource` VALUES ('4', '权限系统', '7', '1', '', '1', '2015-10-25 11:02:00', '2015-12-22 08:54:50');
INSERT INTO `resource` VALUES ('5', '文件管理', '4', '1', '', '1', '2015-10-25 11:02:00', '2015-12-22 08:54:15');
INSERT INTO `resource` VALUES ('6', '系统设置', '5', '1', '', '1', '2015-10-25 11:02:00', '2015-12-22 08:54:29');
INSERT INTO `resource` VALUES ('7', '附加功能', '6', '1', '', '1', '2015-10-25 11:02:00', '2015-12-22 08:54:41');
INSERT INTO `resource` VALUES ('8', '人员管理', '2', '2', '/console/user/list', '1', '2015-10-25 11:02:00', '2017-09-07 20:12:26');
INSERT INTO `resource` VALUES ('9', '班级管理', '3', '2', 'console/clazz/list', '1', '2015-10-25 11:02:00', '2016-01-29 12:50:59');
INSERT INTO `resource` VALUES ('10', '组织机构管理', '5', '2', 'console/org/list', '0', '2015-10-25 11:02:00', '2016-08-16 14:21:21');
INSERT INTO `resource` VALUES ('11', '工作单位管理', '4', '2', 'console/work/list', '1', '2015-10-25 11:02:00', '2015-10-25 11:02:00');
INSERT INTO `resource` VALUES ('12', '分类管理', '1', '3', 'console/category/list', '1', '2015-10-25 11:02:00', '2015-10-25 11:02:00');
INSERT INTO `resource` VALUES ('13', '文章管理', '2', '3', 'console/article/list', '1', '2015-10-25 11:02:00', '2015-10-25 11:02:00');
INSERT INTO `resource` VALUES ('14', '页面管理', '3', '3', 'console/page/list', '1', '2015-10-25 11:02:00', '2015-10-25 11:02:00');
INSERT INTO `resource` VALUES ('15', '留言管理', '4', '3', 'console/message/list', '1', '2015-10-25 11:02:00', '2015-10-25 11:02:00');
INSERT INTO `resource` VALUES ('16', '通知管理', '5', '3', 'console/notice/list', '1', '2015-10-25 11:02:00', '2015-10-25 11:02:00');
INSERT INTO `resource` VALUES ('17', '角色管理', '1', '4', '/console/role/list', '1', '2015-10-25 11:02:00', '2017-09-04 09:08:37');
INSERT INTO `resource` VALUES ('18', '资源管理', '3', '4', '/console/resource/list', '1', '2015-10-25 11:02:00', '2017-09-03 20:30:56');
INSERT INTO `resource` VALUES ('19', '权限管理', '2', '4', '/console/perm/list', '1', '2015-10-25 11:02:00', '2017-09-03 20:31:05');
INSERT INTO `resource` VALUES ('20', '分类管理', '1', '5', 'console/fileCatalog/list', '1', '2015-10-25 11:02:00', '2015-10-25 11:02:00');
INSERT INTO `resource` VALUES ('21', '文件管理', '2', '5', 'console/file/list', '1', '2015-10-25 11:02:00', '2015-10-25 11:02:00');
INSERT INTO `resource` VALUES ('22', '导航菜单管理', '1', '6', 'console/nav/list', '1', '2015-10-25 11:02:00', '2015-10-25 11:02:00');
INSERT INTO `resource` VALUES ('23', '友情链接管理', '2', '6', 'console/link/list', '1', '2015-10-25 11:02:00', '2015-10-25 11:02:00');
INSERT INTO `resource` VALUES ('24', '场地管理', '1', '7', 'console/place/list', '1', '2015-10-25 11:02:00', '2015-10-25 11:02:00');
INSERT INTO `resource` VALUES ('28', '场地申请', '2', '7', 'console/apply/list', '1', '2015-12-10 17:12:44', '2015-12-10 17:14:01');
INSERT INTO `resource` VALUES ('29', '个人中心', '1', '1', '', '1', '2015-12-22 08:49:29', '2015-12-22 08:49:29');
INSERT INTO `resource` VALUES ('30', '我的通知', '6', '29', 'console/notice/mynotice', '1', '2015-12-22 08:52:57', '2017-09-03 19:02:53');
INSERT INTO `resource` VALUES ('31', '我的留言', '2', '29', 'console/message/mymsg', '1', '2015-12-22 08:53:31', '2016-08-15 18:05:34');
INSERT INTO `resource` VALUES ('32', '个人资料', '3', '29', 'console/user/userInfoEdit', '0', '2015-12-26 09:47:09', '2016-08-16 14:21:21');
INSERT INTO `resource` VALUES ('50', '系统信息管理', '3', '6', 'console/keyword/list', '1', '2016-01-07 20:18:09', '2016-01-27 09:50:08');
INSERT INTO `resource` VALUES ('51', 'aa', '0', null, '', '0', '2016-01-11 17:46:51', '2016-01-11 17:47:30');
INSERT INTO `resource` VALUES ('52', '下载中心', '5', '29', 'downcenter.html', '1', '2016-01-11 17:51:24', '2016-08-15 16:10:50');
INSERT INTO `resource` VALUES ('54', '短信通知', '3', '7', 'console/shortMessage/list', '1', '2016-03-05 10:20:48', '2016-03-14 17:10:39');
INSERT INTO `resource` VALUES ('55', '我的工资', '4', '29', 'console/salary/showSelf', '0', '2016-03-29 18:40:50', '2016-08-16 14:19:06');
INSERT INTO `resource` VALUES ('56', '工资管理', '4', '7', 'console/salary/list', '1', '2016-03-29 18:41:31', '2016-03-29 18:45:53');
INSERT INTO `resource` VALUES ('57', '教师管理', '0', '2', '/console/arch/list-teacher', '1', '2016-08-15 16:53:40', '2017-09-03 20:13:10');
INSERT INTO `resource` VALUES ('62', 'test', '9', '29', '#', '1', '2017-08-02 10:27:23', '2017-08-02 10:27:23');
INSERT INTO `resource` VALUES ('67', '编辑个人资料', '1', '29', '/console/info/edit', '1', '2017-09-03 19:02:39', '2017-09-03 19:02:39');
INSERT INTO `resource` VALUES ('68', '论文中心', '2', '1', '', '1', '2017-09-03 19:07:09', '2017-09-03 19:07:09');
INSERT INTO `resource` VALUES ('69', '论文题目申请', '1', '68', '/console/tapply/list', '1', '2017-09-03 19:07:43', '2017-09-03 19:07:43');
INSERT INTO `resource` VALUES ('70', '论文事务管理', '2', '68', '/console/twork/index', '1', '2017-09-03 19:08:13', '2017-09-03 19:08:13');
INSERT INTO `resource` VALUES ('71', '查看选题结果', '3', '68', '/console/tapply/result', '1', '2017-09-03 19:08:56', '2017-09-03 19:08:56');
INSERT INTO `resource` VALUES ('72', '历年题目管理', '1', '68', '/console/thesis/listAll', '1', '2017-09-03 19:21:10', '2017-09-03 19:21:10');
INSERT INTO `resource` VALUES ('73', '题目申报管理', '2', '68', '/console/thesis/list', '1', '2017-09-03 19:21:51', '2017-09-03 19:21:51');
INSERT INTO `resource` VALUES ('74', '确定选题学生', '3', '68', '/console/treply/list', '1', '2017-09-03 19:22:17', '2017-09-03 19:22:17');
INSERT INTO `resource` VALUES ('75', '任务与检查', '3', '1', '', '1', '2017-09-03 19:23:21', '2017-09-03 19:23:21');
INSERT INTO `resource` VALUES ('76', '论文任务书', '1', '75', '/console/ttask/list', '1', '2017-09-03 19:23:45', '2017-09-03 19:23:45');
INSERT INTO `resource` VALUES ('77', '论文中期检查', '2', '75', '/console/tmidcheck/list', '1', '2017-09-03 19:24:10', '2017-09-03 19:24:10');
INSERT INTO `resource` VALUES ('78', '论文评分上传', '4', '1', '', '1', '2017-09-03 19:25:37', '2017-09-03 19:25:37');
INSERT INTO `resource` VALUES ('79', '指导教师自评', '1', '78', '/console/tscore/list1', '1', '2017-09-03 19:26:13', '2017-09-03 19:26:13');
INSERT INTO `resource` VALUES ('80', '评阅教师评分', '2', '78', '/console/tscore/list2', '1', '2017-09-03 19:26:36', '2017-09-03 19:26:36');
INSERT INTO `resource` VALUES ('81', '论文上传下载', '3', '78', '/console/tupload/list/', '1', '2017-09-03 19:27:03', '2017-09-30 13:09:18');
INSERT INTO `resource` VALUES ('82', '答辩事务', '4', '1', '', '1', '2017-09-03 19:27:25', '2017-09-03 19:27:25');
INSERT INTO `resource` VALUES ('83', '争优/延期确认', '1', '82', '/console/gooddelay/teacher', '1', '2017-09-03 19:27:46', '2017-09-03 19:27:46');
INSERT INTO `resource` VALUES ('84', '查看分组', '2', '82', '/console/thesis/defense/group/teacherview', '1', '2017-09-03 19:28:16', '2017-09-03 19:28:16');
INSERT INTO `resource` VALUES ('85', '论文工作管理', '1', '68', '/console/project/list', '1', '2017-09-03 19:41:14', '2017-09-03 19:41:14');
INSERT INTO `resource` VALUES ('86', '参与老师管理', '1', '2', '/console/project/teachers', '1', '2017-09-03 19:42:35', '2017-09-03 19:42:35');
INSERT INTO `resource` VALUES ('87', '参与学生管理', '2', '2', '/console/project/students', '1', '2017-09-03 19:42:53', '2017-09-03 19:42:53');
INSERT INTO `resource` VALUES ('88', '申请确认', '1', '82', '/console/gooddelay/org', '1', '2017-09-03 19:44:37', '2017-09-03 19:44:37');
INSERT INTO `resource` VALUES ('89', '教师出题情况', '1', '3', '/console/tcount/list', '1', '2017-09-03 19:45:12', '2017-09-03 19:45:12');
INSERT INTO `resource` VALUES ('90', '论文题目审核', '2', '68', '/console/tcheck/list', '1', '2017-09-03 19:46:14', '2017-10-13 11:14:21');
INSERT INTO `resource` VALUES ('91', '学生选题调整', '3', '68', '/console/tadjust/list', '1', '2017-09-03 19:46:42', '2017-09-03 19:46:42');
INSERT INTO `resource` VALUES ('92', '论文选题结果', '3', '3', '/console/tresult/list', '1', '2017-09-03 19:47:04', '2017-09-03 19:47:04');
INSERT INTO `resource` VALUES ('93', '公告管理', '4', '3', '/console/advice/admin-list', '1', '2017-09-03 19:47:28', '2017-09-03 19:47:28');
INSERT INTO `resource` VALUES ('94', '答辩任务管理', '3', '82', '/console/thesis/defense/task/list', '1', '2017-09-03 19:47:52', '2017-09-03 19:47:52');
INSERT INTO `resource` VALUES ('95', '基础数据管理', '5', '1', '', '1', '2017-09-03 20:10:33', '2017-09-03 20:10:33');
INSERT INTO `resource` VALUES ('96', '论文方向管理', '1', '95', '/console/attr/list-direction', '1', '2017-09-03 20:10:59', '2017-09-03 20:10:59');
INSERT INTO `resource` VALUES ('97', '论文来源管理', '2', '95', '/console/attr/list-source', '1', '2017-09-03 20:11:21', '2017-09-03 20:11:21');
INSERT INTO `resource` VALUES ('98', '论文属性管理', '3', '95', '/console/attr/list-property', '1', '2017-09-03 20:11:43', '2017-09-03 20:11:43');
INSERT INTO `resource` VALUES ('99', '管理员管理', '1', '2', '/console/arch/list-admin', '1', '2017-09-03 20:12:20', '2017-09-03 20:12:20');
INSERT INTO `resource` VALUES ('100', '管理公告', '5', '3', '/console/advice/super-list', '1', '2017-09-03 20:23:13', '2017-09-07 19:38:55');
INSERT INTO `resource` VALUES ('101', '公告发布', '5', '3', '/console/advice/super-list', '1', '2017-09-03 20:24:02', '2017-09-03 20:24:02');
INSERT INTO `resource` VALUES ('102', '职称管理', '4', '3', '/console/title/list', '1', '2017-09-03 20:25:09', '2017-09-03 20:25:09');
INSERT INTO `resource` VALUES ('103', '机构管理', '4', '3', '/console/org/list', '1', '2017-09-03 20:25:30', '2017-09-03 20:25:30');
INSERT INTO `resource` VALUES ('104', '系统用户管理', '5', '2', '/console/user/list', '1', '2017-09-03 20:26:51', '2017-09-03 20:26:51');
INSERT INTO `resource` VALUES ('105', '教室管理', '1', '24', '#', '1', '2017-09-04 09:06:39', '2017-09-04 09:06:39');
INSERT INTO `resource` VALUES ('106', '查看成績單', '2', '29', '/console/tscore/view?id=${socre.id}', '1', '2017-09-05 10:33:10', '2017-09-05 10:33:10');
INSERT INTO `resource` VALUES ('107', '学生管理', '3', '2', '/console/arch/list-student', '1', '2017-09-06 00:43:21', '2017-09-06 00:43:21');

-- ----------------------------
-- Table structure for role
-- ----------------------------
DROP TABLE IF EXISTS `role`;
CREATE TABLE `role` (
  `id` bigint(10) NOT NULL AUTO_INCREMENT COMMENT '主键，自动递增',
  `name` varchar(255) NOT NULL COMMENT '角色名称',
  `code` varchar(255) DEFAULT '' COMMENT '角色编码',
  `valid` tinyint(1) DEFAULT '1' COMMENT '当前元组是否有效，1（true）表示有效；0（false）表示无效【无效时不能操作该元组】',
  `cdate` datetime NOT NULL COMMENT '当前元组的生成时间',
  `mdate` datetime NOT NULL COMMENT '当前元组信息发生变化的时间',
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=23 DEFAULT CHARSET=utf8;

-- ----------------------------
-- Records of role
-- ----------------------------
INSERT INTO `role` VALUES ('1', '超级管理员', 'super', '1', '2015-11-09 21:47:11', '2016-04-23 18:27:55');
INSERT INTO `role` VALUES ('20', '普通管理员', 'admin', '1', '2016-08-18 16:42:44', '2016-08-18 16:42:44');
INSERT INTO `role` VALUES ('21', '教师', 'teacher', '1', '2016-08-18 16:44:46', '2016-08-18 16:44:46');
INSERT INTO `role` VALUES ('22', '学生', 'student', '1', '2016-08-18 16:44:55', '2016-08-18 16:44:55');

-- ----------------------------
-- Table structure for role_permission
-- ----------------------------
DROP TABLE IF EXISTS `role_permission`;
CREATE TABLE `role_permission` (
  `rid` bigint(10) NOT NULL COMMENT '代表一个角色',
  `pid` bigint(10) NOT NULL COMMENT '代表一个资源权限对'
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

-- ----------------------------
-- Records of role_permission
-- ----------------------------
INSERT INTO `role_permission` VALUES ('21', '140');
INSERT INTO `role_permission` VALUES ('21', '145');
INSERT INTO `role_permission` VALUES ('21', '146');
INSERT INTO `role_permission` VALUES ('21', '144');
INSERT INTO `role_permission` VALUES ('21', '147');
INSERT INTO `role_permission` VALUES ('21', '148');
INSERT INTO `role_permission` VALUES ('21', '149');
INSERT INTO `role_permission` VALUES ('21', '150');
INSERT INTO `role_permission` VALUES ('21', '151');
INSERT INTO `role_permission` VALUES ('21', '152');
INSERT INTO `role_permission` VALUES ('21', '153');
INSERT INTO `role_permission` VALUES ('22', '140');
INSERT INTO `role_permission` VALUES ('22', '141');
INSERT INTO `role_permission` VALUES ('22', '142');
INSERT INTO `role_permission` VALUES ('22', '143');
INSERT INTO `role_permission` VALUES ('1', '168');
INSERT INTO `role_permission` VALUES ('1', '169');
INSERT INTO `role_permission` VALUES ('1', '10');
INSERT INTO `role_permission` VALUES ('1', '44');
INSERT INTO `role_permission` VALUES ('1', '69');
INSERT INTO `role_permission` VALUES ('1', '12');
INSERT INTO `role_permission` VALUES ('1', '46');
INSERT INTO `role_permission` VALUES ('1', '71');
INSERT INTO `role_permission` VALUES ('1', '11');
INSERT INTO `role_permission` VALUES ('1', '45');
INSERT INTO `role_permission` VALUES ('1', '70');
INSERT INTO `role_permission` VALUES ('1', '164');
INSERT INTO `role_permission` VALUES ('1', '165');
INSERT INTO `role_permission` VALUES ('1', '166');
INSERT INTO `role_permission` VALUES ('1', '1');
INSERT INTO `role_permission` VALUES ('1', '18');
INSERT INTO `role_permission` VALUES ('1', '35');
INSERT INTO `role_permission` VALUES ('1', '52');
INSERT INTO `role_permission` VALUES ('1', '112');
INSERT INTO `role_permission` VALUES ('1', '113');
INSERT INTO `role_permission` VALUES ('1', '167');
INSERT INTO `role_permission` VALUES ('1', '140');
INSERT INTO `role_permission` VALUES ('1', '173');
INSERT INTO `role_permission` VALUES ('1', '170');
INSERT INTO `role_permission` VALUES ('1', '136');
INSERT INTO `role_permission` VALUES ('1', '138');
INSERT INTO `role_permission` VALUES ('20', '136');
INSERT INTO `role_permission` VALUES ('20', '138');
INSERT INTO `role_permission` VALUES ('20', '155');
INSERT INTO `role_permission` VALUES ('20', '167');
INSERT INTO `role_permission` VALUES ('20', '154');
INSERT INTO `role_permission` VALUES ('20', '173');
INSERT INTO `role_permission` VALUES ('20', '160');
INSERT INTO `role_permission` VALUES ('20', '159');
INSERT INTO `role_permission` VALUES ('20', '158');
INSERT INTO `role_permission` VALUES ('20', '161');
INSERT INTO `role_permission` VALUES ('20', '162');
INSERT INTO `role_permission` VALUES ('20', '163');
INSERT INTO `role_permission` VALUES ('20', '164');
INSERT INTO `role_permission` VALUES ('20', '165');
INSERT INTO `role_permission` VALUES ('20', '166');
INSERT INTO `role_permission` VALUES ('20', '156');
INSERT INTO `role_permission` VALUES ('20', '147');
INSERT INTO `role_permission` VALUES ('20', '148');
INSERT INTO `role_permission` VALUES ('20', '140');
INSERT INTO `role_permission` VALUES ('20', '157');

-- ----------------------------
-- Table structure for score
-- ----------------------------
DROP TABLE IF EXISTS `score`;
CREATE TABLE `score` (
  `id` bigint(10) NOT NULL AUTO_INCREMENT,
  `thesisid` bigint(10) DEFAULT NULL COMMENT '论文题目ID',
  `mark1` double(10,2) DEFAULT NULL COMMENT '指导老师成绩',
  `comment1` varchar(1000) DEFAULT NULL COMMENT '指导老师评语',
  `mark1date` datetime DEFAULT NULL COMMENT '自评日期',
  `mark2` double(10,2) DEFAULT NULL COMMENT '评阅老师成绩',
  `comment2` varchar(1000) DEFAULT NULL COMMENT '评阅老师评语',
  `mark2date` datetime DEFAULT NULL COMMENT '评阅日期',
  `mark3` double(10,2) DEFAULT NULL COMMENT '答辩成绩',
  `comment3` varchar(1000) DEFAULT NULL COMMENT '答辩小组评语',
  `mark3date` datetime DEFAULT NULL COMMENT '答辩日期',
  `valid` tinyint(1) DEFAULT NULL COMMENT '是否可用（也即是否删除）',
  `cdate` datetime DEFAULT NULL COMMENT '创建时间',
  `mdate` datetime DEFAULT NULL COMMENT '更新时间',
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=22 DEFAULT CHARSET=utf8;

-- ----------------------------
-- Records of score
-- ----------------------------
INSERT INTO `score` VALUES ('1', '866', '36.00', '梵蒂冈woshiyiwoshier44444444', '2017-08-31 00:00:00', '18.00', '8888嘎嘎嘎', '2017-08-28 00:00:00', '3.00', null, '2017-08-17 00:00:00', '1', '2017-08-16 10:51:13', '2017-09-05 20:17:27');
INSERT INTO `score` VALUES ('4', '21', '55.00', null, null, null, null, null, '59.99', null, '2017-08-28 00:00:00', '1', '2017-08-18 15:30:05', '2017-08-20 20:00:26');
INSERT INTO `score` VALUES ('5', null, null, null, null, null, null, null, '45.00', null, '2017-08-30 00:00:00', '1', '2017-08-18 21:35:50', '2017-08-18 21:35:50');
INSERT INTO `score` VALUES ('6', '74', '20.00', '555', null, '30.00', '555', null, '18.00', null, '2017-08-23 00:00:00', '1', '2017-08-18 21:36:58', '2017-08-30 21:52:04');
INSERT INTO `score` VALUES ('7', null, null, null, null, null, null, null, '3.00', null, '2017-08-08 00:00:00', '1', '2017-08-18 21:43:34', '2017-08-18 21:43:34');
INSERT INTO `score` VALUES ('8', null, null, null, null, null, null, null, '27.00', null, '2017-08-30 00:00:00', '1', '2017-08-30 21:55:30', '2017-08-30 21:55:30');
INSERT INTO `score` VALUES ('9', '7', '77.00', '哈哈交换机', '2017-08-29 00:00:00', '69.00', '师范大\r\n地方撒s', '2017-09-20 00:00:00', null, null, null, '1', '2017-09-06 11:19:19', '2017-09-29 13:58:51');
INSERT INTO `score` VALUES ('10', '187', '88.00', '5555', '2017-09-13 00:00:00', null, null, null, null, null, null, '1', '2017-09-19 23:02:43', '2017-09-19 23:02:43');
INSERT INTO `score` VALUES ('14', '3', '78.00', 'rff\r\nlkl;', '2017-09-05 00:00:00', null, null, null, '84.00', null, '2017-09-07 00:00:00', '1', '2017-09-20 22:19:25', '2017-09-29 13:58:33');
INSERT INTO `score` VALUES ('15', '4', null, null, null, null, null, null, '51.00', null, '2017-09-15 00:00:00', '1', '2017-09-20 22:28:25', '2017-09-20 22:28:25');
INSERT INTO `score` VALUES ('16', '1', null, null, null, null, null, null, '33.00', null, '2017-09-07 00:00:00', '1', '2017-09-20 23:17:40', '2017-09-20 23:17:40');
INSERT INTO `score` VALUES ('17', '75', null, null, null, null, null, null, '95.00', null, '2017-09-13 00:00:00', '1', '2017-09-20 23:31:54', '2017-09-20 23:31:54');
INSERT INTO `score` VALUES ('18', '6', null, null, null, null, null, null, '100.00', null, '2017-09-06 00:00:00', '1', '2017-09-29 14:01:08', '2017-09-29 14:01:08');
INSERT INTO `score` VALUES ('19', '23', null, null, null, null, null, null, '100.00', null, '2017-09-13 00:00:00', '1', '2017-09-29 14:04:18', '2017-09-29 14:04:18');
INSERT INTO `score` VALUES ('20', '371', '89.00', '1我是说的点点滴滴多多多多多', '2017-09-04 00:00:00', '100.00', '9999999999\r\n哦哦哦哦哦哦哦\r\n来来来', '2017-09-08 00:00:00', null, null, null, '1', '2017-09-29 20:46:03', '2017-09-29 20:57:16');
INSERT INTO `score` VALUES ('21', '302', null, null, null, null, null, null, '100.00', null, '2017-09-06 00:00:00', '1', '2017-09-29 21:24:08', '2017-09-29 21:24:08');

-- ----------------------------
-- Table structure for taskbook
-- ----------------------------
DROP TABLE IF EXISTS `taskbook`;
CREATE TABLE `taskbook` (
  `id` bigint(10) NOT NULL AUTO_INCREMENT,
  `thesisid` bigint(10) DEFAULT NULL COMMENT '论文题目ID',
  `task` varchar(1000) DEFAULT '' COMMENT '目标与任务',
  `content` varchar(1000) DEFAULT '' COMMENT '内容要求，包括技术路线',
  `schedule` varchar(1000) DEFAULT '' COMMENT '进度安排',
  `reference` varchar(1000) DEFAULT '' COMMENT '参考文献',
  `tconfirm` tinyint(1) DEFAULT '0' COMMENT '指导老师确认',
  `sconfirm` tinyint(1) DEFAULT NULL COMMENT '学生确认',
  `valid` tinyint(1) DEFAULT NULL COMMENT '是否可用（也即是否删除）',
  `cdate` datetime DEFAULT NULL COMMENT '创建时间',
  `mdate` datetime DEFAULT NULL COMMENT '更新时间',
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=15 DEFAULT CHARSET=utf8;

-- ----------------------------
-- Records of taskbook
-- ----------------------------
INSERT INTO `taskbook` VALUES ('1', '569', '设计并实现一个基于web技术的在线书籍购买系统。\r\n该系统操作方便，易于维护。', '基本实现了网上书籍购买系统应有的主要功能模块,包括：管理员的登录，管理；用户注册、登录，个人信息的查询、修改；商品分类，管理，购物车管理，订单管理等等。该系统通过使用MyEclipse软件，采用java语言，运用MySQL数据库等完成。', '10月19到10月31：准备开始写毕业论文\r\n   11月1号到11月7号：设计总体方案\r\n   11月8号到2月28号：基本完成整个系统的开发与设计\r\n   3月1号到3月31号：进行优化与测试\r\n   4月初：向指导老师提交定稿论文（印刷版）。', '暂无', '1', null, '1', '2016-10-19 00:00:00', '2016-10-19 14:38:53');
INSERT INTO `taskbook` VALUES ('2', '742', '主要功能：1、管理房屋信息；2、管理租赁信息；', '不限', '自行安排', '自行查阅相关资料，建议：\r\n我们学校主页、图书馆、知网', '1', '1', '1', '2016-10-19 00:00:00', '2016-11-01 18:03:05');
INSERT INTO `taskbook` VALUES ('3', '744', '1、根据客户的调查要求，生成调查表：单项、多项选择等；\r\n2、做相关统计分析（直接数据和图形）', '不限', '自定', '自行查阅相关资料，建议：\r\n我们学校主页、图书馆、知网', '1', null, '1', '2016-10-19 00:00:00', '2016-10-19 15:47:30');
INSERT INTO `taskbook` VALUES ('4', '748', '了解用户访问习惯，推测和统计用户的行为，并给出推荐。', '不限。', '自行安排。', '自行查阅相关资料，建议：\r\n我们学校主页、图书馆、知网', '1', null, '1', '2016-10-19 00:00:00', '2016-10-19 15:48:59');
INSERT INTO `taskbook` VALUES ('5', '750', '能根据一些通用模板自动生成个人网站；\r\n通用模板的编辑和生成；', '不限', '自行安排', '自行查阅相关资料，建议：\r\n我们学校主页、图书馆、知网', '1', null, '1', '2016-10-19 00:00:00', '2016-10-19 15:49:51');
INSERT INTO `taskbook` VALUES ('6', '758', '一个作业管理网站：\r\n学生提交作业；\r\n老师批改作业并且给分数；', '不限', '自定。', '自行查阅相关资料，建议：\r\n我们学校主页、图书馆、知网', '1', null, '1', '2016-10-19 00:00:00', '2016-10-19 15:52:45');
INSERT INTO `taskbook` VALUES ('7', '746', '一个旅游管理系统；\r\n重点是做路线管理，希望考虑多种因素，生成最优路线；', '不限。', '自行安排', '自行查阅资料。\r\n建议：学校图书馆lib.scau.edu.cn，知网', '1', null, '1', '2016-10-19 00:00:00', '2016-10-19 15:59:14');
INSERT INTO `taskbook` VALUES ('8', '745', '杂志社（编辑部）的流程管理系统；\r\n流程包括：接收作者投稿（初稿），决定退回还是留下，留下：请审稿专家审稿，审稿结论发回给作者，作者修改再发杂志社，可能杂志社拒绝或者可能需要第二次审稿，结果可能拒绝或者安排在什么期发表，收取版面费。', '不限', '自行安排', '自行查阅；\r\n建议：lib.scau.edu.cn的“知网”', '1', null, '1', '2016-10-19 00:00:00', '2016-10-19 17:00:23');
INSERT INTO `taskbook` VALUES ('9', '763', '一份试卷有若干题型：单选、多选、填空、简述、看程序写结果、编程题等，题型可以维护；\r\n录入题目；\r\n一份试卷可以选定某些题型，随机且自动选择该题型下的若干题目，也可以人工挑选生成，并且要满足分值分配；\r\n打印试卷', '不限。', '暂时自定。', '自行阅读资料；\r\n建议： lib.scau.edu.cn  知网', '1', null, '1', '2016-10-19 00:00:00', '2016-10-19 18:39:49');
INSERT INTO `taskbook` VALUES ('10', '100', '是梵蒂冈', '发光时代电饭锅是v初步5555555', '都是法国', '啊搜地发', '1', null, '1', '2017-08-11 00:00:00', '2017-08-01 09:56:44');
INSERT INTO `taskbook` VALUES ('11', '866', '啦啦啦啦\r\n111111111', '哈哈哈哈', '呵呵呵呵', '毛概', '1', '1', '1', '2017-08-01 00:00:00', '2017-08-17 15:29:10');
INSERT INTO `taskbook` VALUES ('12', '108', '4', '4', '4', '4', '1', '1', '1', '2017-08-12 00:00:00', '2017-08-12 22:39:18');
INSERT INTO `taskbook` VALUES ('13', '117', '5', '5', '5', '5', '1', '1', '1', '2017-08-12 00:00:00', '2017-08-12 23:17:47');
INSERT INTO `taskbook` VALUES ('14', '187', '4', '4', '4', '4', '1', '1', '1', '2017-09-05 00:00:00', '2017-09-19 23:00:13');

-- ----------------------------
-- Table structure for thesis
-- ----------------------------
DROP TABLE IF EXISTS `thesis`;
CREATE TABLE `thesis` (
  `id` bigint(10) NOT NULL AUTO_INCREMENT,
  `orgid` bigint(10) DEFAULT NULL COMMENT '所属组织机构',
  `projid` bigint(10) DEFAULT NULL COMMENT '论文工作ID',
  `topic` varchar(512) DEFAULT '' COMMENT '论文题目',
  `direction` varchar(255) DEFAULT '' COMMENT '研究方向',
  `source` varchar(255) DEFAULT '' COMMENT '论文来源',
  `property` varchar(255) DEFAULT '' COMMENT '论文性质',
  `profile` longtext COMMENT '论文简介',
  `checked` tinyint(1) DEFAULT '0' COMMENT '审核状态，0-未审核/1-已审核',
  `teacherid` bigint(10) DEFAULT NULL COMMENT '出题教师ID',
  `studentid` bigint(10) DEFAULT NULL COMMENT '确认学生ID',
  `viewerid` bigint(10) DEFAULT NULL COMMENT '评阅教师ID',
  `uploadtime` datetime DEFAULT NULL COMMENT '论文最后上传时间',
  `defensestatus` int(4) DEFAULT NULL COMMENT '答辩状态，0-正常答辩/2-争优答辩/4-延期答辩',
  `valid` tinyint(1) DEFAULT NULL COMMENT '是否可用（也即是否删除）',
  `cdate` datetime DEFAULT NULL COMMENT '创建时间',
  `mdate` datetime DEFAULT NULL COMMENT '更新时间',
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=874 DEFAULT CHARSET=utf8;

-- ----------------------------
-- Records of thesis
-- ----------------------------
INSERT INTO `thesis` VALUES ('1', '2', '2', '基于企业视角的珠三角地区工业工程专业能力需求分析', '论文类', '导师出题', '毕业论文', '<p>根据专业工程认证的要求，通过利用工业工程师联盟等组织对企业要求工业工程专业的能力进行调研和分析，撰写调研报告，为教育部的专业评估提供依据，为我们专业人才培养方案修订提供</p>', '1', '4', '29', null, '2016-10-11 00:00:00', '0', '1', '2016-10-11 13:52:40', '2016-10-11 14:02:29');
INSERT INTO `thesis` VALUES ('2', '2', '2', '基于毕业生视角的珠三角地区工业工程专业能力需求分析', '论文类', '导师出题', '毕业论文', '<p>从工业工程专业毕业的学生的视角调研珠三角地区对工业工程专业能力的要求，重点调研华农以外的工业工程毕业学生的意见，要求12月要完成，为修定本专业人才培养方案提供</p>', '1', '4', null, null, '2016-10-11 00:00:00', '0', '1', '2016-10-11 13:55:44', '2016-10-11 13:55:44');
INSERT INTO `thesis` VALUES ('3', '2', '2', '电子企业物流配送绩效评价研究', '论文类', '学生创新项目', '毕业论文', '', '1', '4', '180', null, '2016-10-11 00:00:00', '0', '1', '2016-10-11 13:58:37', '2017-09-30 11:44:48');
INSERT INTO `thesis` VALUES ('4', '2', '2', '电子企业物流配送流程分析与优化', '论文类', '学生创新项目', '毕业论文', '', '1', '4', '177', null, '2016-10-11 00:00:00', '0', '1', '2016-10-11 14:00:12', '2016-10-11 14:00:12');
INSERT INTO `thesis` VALUES ('5', '2', '2', '电子企业物流管理系统现场实施与改进', '论文类', '学生创新项目', '毕业论文', '', '1', '4', '179', null, '2016-10-11 00:00:00', '0', '1', '2016-10-11 14:01:54', '2016-10-11 14:01:54');
INSERT INTO `thesis` VALUES ('6', '2', '2', '电子村务手机端APP开发', '论文类', '学生创新项目', '毕业论文', '', '1', '4', '181', null, '2016-10-11 00:00:00', '0', '1', '2016-10-11 14:04:32', '2016-10-11 17:18:46');
INSERT INTO `thesis` VALUES ('7', '2', '2', '基于移动技术的店子村屋结构化研究', '论文类', '学生创新项目', '毕业论文', '', '1', '4', '176', '19', '2016-10-11 00:00:00', '0', '1', '2016-10-11 14:08:05', '2017-09-29 13:58:51');
INSERT INTO `thesis` VALUES ('8', '2', '1', '农产品生鲜电商的冷链物流载具产品特性与市场研究', '论文类', '学生创新项目', '毕业论文', '<p>对目前国内外从事农产品生鲜电商采用的冷链运输方式和载具的工作原理、技术特性进行调查，对目前生鲜冷链物流</p>', '0', '4', '29', null, '2016-10-11 00:00:00', '0', '1', '2016-10-11 14:14:54', '2017-08-01 11:07:18');
INSERT INTO `thesis` VALUES ('9', '2', '1', '基于无线传输的冷链物流信息采集与显示手机系统设计', '论文类', '学生创新项目', '毕业论文', '<p>主要在已经设计的冷藏箱信息采集系统的基础上开发一个与手机交互信息的APP</p>', '1', '4', null, null, '2016-10-11 00:00:00', '0', '1', '2016-10-11 14:17:28', '2016-10-11 14:23:32');
INSERT INTO `thesis` VALUES ('10', '2', '1', '冷链运输载具中温湿度场及CO2浓度场的测度与仿真', '论文类', '学生创新项目', '毕业论文', '<p>在实验室搭建的模拟实验环境下，运用温度、湿度、CO2</p>', '1', '4', '74', null, '2016-10-11 00:00:00', '0', '1', '2016-10-11 14:22:37', '2016-10-11 14:22:37');
INSERT INTO `thesis` VALUES ('11', '2', '1', '基于农户信息行为分析的农产品质量安全监管信息服务策略', '论文类', '导师出题', '毕业论文', '<p>调研，研究论文</p>', '1', '10', '121', null, '2016-10-11 00:00:00', '0', '1', '2016-10-11 14:39:40', '2016-10-11 14:39:40');
INSERT INTO `thesis` VALUES ('12', '2', '1', '供给侧改革视角下农产品质量安全监管信息服务多元化模式', '论文类', '导师出题', '毕业论文', '<p>调研，研究论文</p>', '1', '10', '132', null, '2016-10-11 00:00:00', '0', '1', '2016-10-11 14:42:13', '2016-10-11 15:24:49');
INSERT INTO `thesis` VALUES ('13', '2', '1', '蔬菜安全监管规制对农户生产行为的影响', '论文类', '导师出题', '毕业论文', '<p>调研，研究论文</p>', '1', '10', '111', null, '2016-10-11 00:00:00', '0', '1', '2016-10-11 15:01:56', '2016-10-11 15:01:56');
INSERT INTO `thesis` VALUES ('14', '2', '1', '农户信息行为对生产技术采纳的影响', '论文类', '导师出题', '毕业论文', '<p>调研，研究论文</p>', '1', '10', '130', null, '2016-10-11 00:00:00', '0', '1', '2016-10-11 15:07:01', '2016-10-11 15:07:01');
INSERT INTO `thesis` VALUES ('15', '2', '1', '高水平大学发展策略及其评价方法研究', '论文类', '导师出题', '毕业论文', '<p>调研，研究论文</p>', '1', '10', '116', null, '2016-10-11 00:00:00', '0', '1', '2016-10-11 15:27:30', '2016-10-11 15:27:30');
INSERT INTO `thesis` VALUES ('16', '2', '1', '教研活动管理系统', '设计类', '导师出题', '毕业论文', '<p>动态网站系统的设计与实现</p>', '1', '10', '113', null, '2016-10-11 00:00:00', '0', '1', '2016-10-11 15:30:46', '2016-10-11 15:30:46');
INSERT INTO `thesis` VALUES ('17', '2', '1', '留学资讯服务系统', '设计类', '导师出题', '毕业论文', '<p>动态网站系统的设计与实现</p>', '1', '10', '78', null, '2016-10-11 00:00:00', '0', '1', '2016-10-11 15:34:14', '2016-10-11 15:34:14');
INSERT INTO `thesis` VALUES ('18', '2', '1', '班主任工作管理系统', '设计类', '导师出题', '毕业论文', '<p>动态网站系统的设计与实现</p>', '1', '10', '75', null, '2016-10-11 00:00:00', '0', '1', '2016-10-11 15:37:23', '2016-10-11 15:37:23');
INSERT INTO `thesis` VALUES ('19', '2', '1', '同行听课活动管理系统', '设计类', '导师出题', '毕业论文', '<p>动态网站系统的设计与实现</p>', '1', '10', '35', null, '2016-10-11 00:00:00', '0', '1', '2016-10-11 15:38:35', '2016-10-11 15:38:35');
INSERT INTO `thesis` VALUES ('20', '2', '1', '课程材料归档管理系统', '设计类', '导师出题', '毕业论文', '<p>动态网站系统的设计与实现</p>', '1', '10', null, null, '2016-10-11 00:00:00', '0', '1', '2016-10-11 15:39:26', '2016-10-13 21:40:05');
INSERT INTO `thesis` VALUES ('21', '2', '2', '生产作业空间的人因分析与改善', '论文类', '导师出题', '毕业论文', '', '1', '26', '149', null, '2016-10-11 00:00:00', '0', '1', '2016-10-11 18:52:23', '2016-10-11 18:52:23');
INSERT INTO `thesis` VALUES ('22', '2', '2', '学生宿舍空间设计的人因分析与改善', '论文类', '导师出题', '毕业论文', '', '1', '26', '142', null, '2016-10-11 00:00:00', '0', '1', '2016-10-11 18:54:50', '2016-10-11 18:54:50');
INSERT INTO `thesis` VALUES ('23', '2', '2', '人机系统的分析与改善', '论文类', '导师出题', '毕业论文', '', '1', '26', '197', null, '2016-10-11 00:00:00', '0', '1', '2016-10-11 18:56:17', '2016-10-11 18:56:17');
INSERT INTO `thesis` VALUES ('24', '2', '2', '生产企业工人肌肉骨骼失调分析及预防', '论文类', '导师出题', '毕业论文', '', '1', '26', '193', null, '2016-10-11 00:00:00', '0', '1', '2016-10-11 18:58:45', '2016-10-11 18:58:45');
INSERT INTO `thesis` VALUES ('25', '2', '2', '基于人因学的数字化人机界面分析与改善', '论文类', '导师出题', '毕业论文', '', '1', '26', '161', null, '2016-10-11 00:00:00', '0', '1', '2016-10-11 19:01:08', '2016-10-11 19:05:20');
INSERT INTO `thesis` VALUES ('26', '2', '1', '猪肉批发价格的组合预测研究', '论文类', '导师课题', '毕业论文', '', '1', '22', '41', null, '2016-10-12 00:00:00', '0', '1', '2016-10-12 08:34:20', '2016-10-12 08:34:20');
INSERT INTO `thesis` VALUES ('27', '2', '1', '广东省”四化“协调发展研究', '论文类', '导师课题', '毕业论文', '', '1', '22', '42', null, '2016-10-12 00:00:00', '0', '1', '2016-10-12 08:37:24', '2016-10-12 08:37:24');
INSERT INTO `thesis` VALUES ('28', '2', '1', '基于Cite Space的扶贫政策绩效研究', '论文类', '导师课题', '毕业论文', '', '1', '22', '95', null, '2016-10-12 00:00:00', '0', '1', '2016-10-12 08:40:41', '2016-10-12 08:40:41');
INSERT INTO `thesis` VALUES ('29', '2', '2', '基于DEA的广东省工业效率评价研究', '论文类', '导师出题', '毕业论文', '', '1', '22', '162', null, '2016-10-12 00:00:00', '0', '1', '2016-10-12 09:32:33', '2016-10-12 09:32:33');
INSERT INTO `thesis` VALUES ('30', '2', '2', '移动直播市场的数据分析与预测研究', '论文类', '学生定题', '毕业论文', '', '1', '22', '175', null, '2016-10-12 00:00:00', '0', '1', '2016-10-12 09:36:13', '2016-10-12 09:36:13');
INSERT INTO `thesis` VALUES ('31', '2', '1', '基于tensorflow的蔬菜害虫分类识别研究', '论文类', '导师出题', '毕业论文', '<p><strong>研究内容</strong>：1）理解tensorflow运行机制；2）图像预处理的基本技巧与实现；3）搭建图像识别系统并实现分类；4）编码实现以上系统。<strong>研究目标</strong>：1）为2、3提供技术支撑开发一个基于tf的图像分类识别系统。<strong>选题要求</strong>：1）熟练使用python；2）对图像分类识别有基本了解；3）具有矩阵、统计与优化相关知识</p>', '1', '17', null, null, '2017-05-20 00:00:00', '0', '1', '2016-10-12 12:29:37', '2016-10-12 12:29:37');
INSERT INTO `thesis` VALUES ('32', '2', '1', '基于弱监督的蔬菜害虫定位与识别研究', '论文类', '导师出题', '毕业论文', '<p><strong>研究内容</strong>：1）采用tf装载深度学习模型进行特征抽取；2）采用selective search方法进行图像块标注；3）采用标注图像块训练深度网络进行目标定位；4）编码实现以上系统。<strong>研究目标</strong>：1）理解如何在tf下装载模型；2）开发一个基于tf的弱监督定位与识别系统。<strong>选题要求</strong>：1）熟练使用python；2）对图像分类识别有基本了解；3）具有矩阵、统计与优化相关知识</p>', '1', '17', null, null, '2017-05-20 00:00:00', '0', '1', '2016-10-12 12:33:54', '2016-10-12 12:33:54');
INSERT INTO `thesis` VALUES ('33', '2', '1', '基于强化学习的蔬菜害虫定位与识别研究', '论文类', '导师出题', '毕业论文', '<p><strong>研究内容</strong>：1）理解强化学习的运行机制；2）实现基于tf的强化学习模型；3）协助搭建一个用于害虫定位与识别的强化学习系统；4）编码实现以上系统。<strong>研究目标</strong>：1）理解强化学习运行机制；2）开发一个基于tf的强化学习定位与识别系统。<strong>选题要求</strong>：1）熟练使用python；2）对图像分类识别有基本了解；3）具有矩阵、统计与优化相关知识</p>', '1', '17', null, null, '2017-05-20 00:00:00', '0', '1', '2016-10-12 12:36:32', '2016-10-12 12:41:18');
INSERT INTO `thesis` VALUES ('34', '2', '1', 'Yahoo!财经专栏的分析与思考', '论文类', '导师出题', '毕业论文', '<p><strong>研究内容</strong>：1）全面分析整理Yahoo!财经专栏相关资料、理解其意义；2）梳理各子模块之间的关系、各模块信息如何收集与整理；3）基于以上信息，对金融市场预测可展开哪些研究进行深入分析思考。<strong>研究目标</strong>：1）对Yahoo!财经的透彻理解；2）财经新闻与市场波动的深入洞察与见解。<strong>选题要求</strong>：1）对财经信息具有较强兴趣；2）善于梳理、分析资料；3）熟练使用python，尤其是pandas模块；4）具有矩阵、统计与优化相关知识。</p>', '1', '17', null, null, '2017-05-20 00:00:00', '0', '1', '2016-10-12 12:38:50', '2016-10-12 12:41:32');
INSERT INTO `thesis` VALUES ('35', '2', '1', '财经新闻与市场波动关系建模与探讨', '论文类', '导师出题', '毕业论文', '<p><strong>研究内容</strong>：1）掌握如何将一篇文本用向量进行表示；2）掌握采用python获取金融市场信息并进行简单处理，并为6提供技术支持；3）掌握采用tf的RNNs模块进行预测建模；4）编码实现以上系统。<strong>研究目标</strong>：1）为6提供技术支持；2）开发基于tf-rnn模块的市场预测系统。<strong>选题要求</strong>：1）对自然语言处理有所了解；2）熟练使用python，尤其是pandas模块；3）具有矩阵、统计与优化相关知识</p>', '1', '17', null, null, '2017-05-20 00:00:00', '0', '1', '2016-10-12 12:40:42', '2016-10-12 12:40:42');
INSERT INTO `thesis` VALUES ('36', '2', '1', '基于Fisher Vector的财经文本建模与研究', '论文类', '导师出题', '毕业论文', '<p><strong>研究内容</strong>：1）掌握如何计算句子的向量表示；2）理解Fisher Vector运行机制并采用其对一天内发生的财经文本进行建模；3）采用前馈神经网络进行市场预测建模；4）编码实现以上系统。<strong>研究目标</strong>：1）对每天发生的财经新闻进行建模；2）开发基于tf-nn模块的市场预测系统。<strong>选题要求</strong>：1）对自然语言处理有所了解；2）熟练使用python，尤其是pandas模块；3）具有矩阵、统计与优化相关知识</p>', '1', '17', null, null, '2017-05-20 00:00:00', '0', '1', '2016-10-12 12:42:39', '2016-10-12 12:42:39');
INSERT INTO `thesis` VALUES ('37', '2', '1', '农作物害虫图像数据集的构建与分类', '论文类', '导师出题', '毕业论文', '<p><strong>研究内容</strong>：1）收集100类农作物害虫图像照片，每类300~500张；2）开发相应的图像标注软件，对害虫进行标注；3）对收集图像进行统计分析，并构建分了识别系统；4）编码实现以上系统。<strong>研究目标</strong>：1）掌握简单的数据统计分析能力；2）开发一个简单的图像分类识别系统。<strong>选题要求</strong>：1）熟悉软件界面开发；2）具有矩阵、统计与优化相关知识；3）熟练使用python；4）具备极强的团队协作能力</p>', '1', '17', null, null, '2017-05-20 00:00:00', '0', '1', '2016-10-12 12:44:04', '2016-10-12 12:44:04');
INSERT INTO `thesis` VALUES ('38', '2', '1', '农作物害虫语义数据集的构建与分类', '论文类', '导师出题', '毕业论文', '<p><strong>研究内容</strong>：1）收集100类农作物害虫文本描述数据（英文）；2）抽取文本特征并进行分类识别；3）编码实现以上系统。<strong>研究目标</strong>：1）掌握简单的文本处理技术；2）开发一个简单的文本分类系统。<strong>选题要求</strong>：1）英语6级以上，具备较强的英文写作与阅读能力；2）<strong>具备极强的团队协作、组织能力</strong>；3）对自然语言处理有所了解</p>', '1', '17', null, null, '2017-05-20 00:00:00', '0', '1', '2016-10-12 12:45:24', '2016-10-12 12:45:24');
INSERT INTO `thesis` VALUES ('39', '1', '3', '基于Android的视频采集APP', '应用软件开发', '科研项目', '应用研究', '<p>开发基于Android的APP，使用手机摄像头获取视频（不使用手机自带的相机程序），实现周期性的视频录制，视频参数（如分辨率、视频格式）可调。</p>\r\n\r\n<p>&nbsp;</p>', '1', '252', null, null, '2017-04-10 00:00:00', '0', '1', '2016-10-12 15:18:21', '2016-10-12 15:18:21');
INSERT INTO `thesis` VALUES ('40', '1', '3', '基于Solr的互联网信息检索系统', '应用软件开发', '其他', '应用研究', '<p>Solr是一个独立的企业级搜索应用服务器，它对外提供类似于Web-service的API接口。用户可以通过http请求，向搜索引擎服务器提交一定格式的XML文件，生成索引；也可以通过Http Get操作提出查找请求，并得到XML格式的返回结果。</p>\r\n\r\n<p>通过Solr，我们可以创建文件集的索引，进而形成一个互联网信息检索系统。</p>', '1', '278', '567', null, '2017-03-01 00:00:00', '0', '1', '2016-10-12 15:18:35', '2016-10-12 15:18:35');
INSERT INTO `thesis` VALUES ('41', '1', '3', '基于Android与WIFI的图像获取APP', '网络技术与应用', '科研项目', '应用研究', '<p>开发Android手机app，使用手机摄像头实现周期性和实时性的图像采集，然后通过手机wifi将拍摄图像传输至计算机端进行保存。</p>', '1', '252', '372', null, '2017-04-10 00:00:00', '0', '1', '2016-10-12 15:21:21', '2016-10-12 15:33:34');
INSERT INTO `thesis` VALUES ('42', '1', '3', '基于Nutch的互联网信息抓取系统', '应用软件开发', '其他', '应用研究', '<p>Nutch 是一个开源Java 实现的搜索引擎。它提供了我们运行自己的搜索引擎所需的全部工具(包括全文搜索和Web爬虫)。当然我们也可以将nutch和solr配合起来使用，nutch实现爬虫并且将数据索引添加到solr的数据库中，由solr负责查询工作。</p>\r\n\r\n<p>Crawler的工作原理主要是：首先Crawler根据WebDB生成一个待抓取网页的URL集合叫做Fetchlist，接着下载线程Fetcher开始根据Fetchlist将网页抓取回来，如果下载线程有很多个，那么就生成很多个Fetchlist，也就是一个Fetcher对应一个Fetchlist。然后Crawler根据抓取回来的网页WebDB进行更新，根据更新后的WebDB生成新的Fetchlist，里面是未抓取的或者新发现的URLs，然后下一轮抓取循环重新开始。这个循环过程可以叫做“产生/抓取/更新”循环。</p>\r\n\r\n<p>指向同一个主机上Web资源的URLs通常被分配到同一个Fetchlist中，这样的话防止过多的Fetchers对一个主机同时进行抓取造成主机负担过重。另外Nutch遵守Robots Exclusion Protocol，网站可以通过自定义Robots.txt控制Crawler的抓取。</p>\r\n\r\n<p>在Nutch中，Crawler操作的实现是通过一系列子操作的实现来完成的。这些子操作Nutch都提供了子命令行可以单独进行调用。</p>\r\n\r\n<p> </p>\r\n\r\n<p>通过Nutch构建爬虫程序框架，可以了解互联网搜索的基本原理理论，并根据这些理论基础和Nutch提供的基础服务构建一个完整的爬虫系统，用于收集各种互联网信息，以备科研或行业应用使用。</p>', '1', '278', null, null, '2017-03-01 00:00:00', '0', '1', '2016-10-12 15:21:35', '2016-10-12 15:21:48');
INSERT INTO `thesis` VALUES ('43', '1', '3', '基于Android与WIFI的音频获取APP', '网络技术与应用', '科研项目', '基础研究', '<p>开发Android手机app，使用手机麦克风实现周期性和实时性的音频采集，然后通过手机wifi将音频文件传输至计算机端进行保存。</p>', '1', '252', null, null, '2017-04-10 00:00:00', '0', '1', '2016-10-12 15:24:57', '2016-10-12 15:33:19');
INSERT INTO `thesis` VALUES ('44', '1', '3', '新闻自动分类算法实现与对比', '应用软件开发', '其他', '应用研究', '<p>新闻自动分类算法的设计与实现是对数据挖掘分类算法的经典应用实现。</p>\r\n\r\n<p>通过对新闻自动分类算法的实践学习，可以系统掌握常见的分类方法，并熟悉其优缺点和优化方式。</p>', '1', '278', null, null, '2017-03-01 00:00:00', '0', '1', '2016-10-12 15:26:39', '2016-10-12 15:26:39');
INSERT INTO `thesis` VALUES ('45', '1', '3', '多业务农情信息云平台', '应用软件开发', '科研项目', '基础研究', '<p>开发B/S结构的基于文本、音频、图像及视频数据的农情信息管理平台，对农情信息实现实时预览、动态展示以及数据分析功能。使用Java或.NET开发环境，结合MySQL或SQL Server数据库实现数据存储管理。</p>', '1', '252', null, null, '2017-04-10 00:00:00', '0', '1', '2016-10-12 15:29:55', '2016-10-12 15:32:40');
INSERT INTO `thesis` VALUES ('46', '1', '3', '基于近邻用户的商品推荐系统实现', '应用软件开发', '其他', '应用研究', '<p>基于近邻用户的推荐研究是推荐技术中协同过滤的经典方式，具有高效简单易行的特点。</p>\r\n\r\n<p>通过实现基于近邻用户的商品推荐系统实现，可以熟悉推荐技术关键技术，掌握推荐技术经典方法，并熟悉相关的程序设计和软件开发操作。</p>', '1', '278', '639', null, '2017-03-01 00:00:00', '0', '1', '2016-10-12 15:30:57', '2016-10-12 15:30:57');
INSERT INTO `thesis` VALUES ('47', '1', '3', '互联网新闻信息自动聚类方法实现与对比', '应用软件开发', '其他', '应用研究', '<p>聚类是无监督学习的一种重要算法，互联网新闻聚类对于解决互联网信息过载具有重要意义。</p>\r\n\r\n<p>通过对互联网新闻信息自动聚类方法的实现与对比，可以熟练掌握文本处理基本知识，熟练掌握经典聚类方法原理、实现方式及其优缺点。</p>', '1', '278', null, null, '2017-03-01 00:00:00', '0', '1', '2016-10-12 15:34:11', '2016-10-12 15:34:11');
INSERT INTO `thesis` VALUES ('48', '2', '1', '基于知识图谱的我国农业物联网研究现状与展望', '论文类', '导师出题', '毕业论文', '<p>掌握知识图谱概念、方法，结合文献调查法，梳理我国农业物联网研究现状、进展情况等。</p>', '1', '27', '123', null, '2016-10-12 00:00:00', '0', '1', '2016-10-12 15:37:47', '2016-10-12 15:37:47');
INSERT INTO `thesis` VALUES ('49', '1', '3', '科研项目管理系统', '应用软件开发', '生产实践', '应用研究', '<p>开发B/S结构的科研项目管理系统，实现项目申报、项目入库、项目进度检查、项目结题验收等管理功能。可以使用Java或.NET环境，数据库可以使用MYSQL或SQL Server等。</p>', '1', '252', null, null, '2017-04-10 00:00:00', '0', '1', '2016-10-12 15:38:14', '2016-10-12 15:38:14');
INSERT INTO `thesis` VALUES ('50', '1', '3', '集约化项目经费额度控制系统', '应用软件开发', '生产实践', '应用研究', '<p>开发B/S结构的项目经费管理系统，根据项目经费预算及经费条目，结合报销和请款等实际业务，实现项目经费的额度控制、明细显示及预警等。使用Java或.NET开发环境，数据库可以使用MYSQL或SQL Server等。</p>', '1', '252', '596', null, '2017-04-10 00:00:00', '0', '1', '2016-10-12 15:44:22', '2016-10-12 15:44:22');
INSERT INTO `thesis` VALUES ('51', '2', '2', '基于人因特性的软件界面优化设计--以智能农业机器人为例', '论文类', '导师出题', '毕业论文', '<p>“以用户为中心”的程序开发理念不断深入人心，但是工业类软件，尤其是机器人控制类软件，界面设计不合理，操作生硬，提示晦涩难懂。拟通过人因工程，重新设计机器人类控制软件操作界面，达到突出关键因素，控制非关键因素，并通过用户感性的心理测量（主管感性评价）和生理测量实验，并结合人因工程有关原理方法，利用实验数据求优化原则。</p>\r\n\r\n<p>本课题要求对人因工程有一定的了解，能吃苦耐劳，保证做课题的时间，有事情提前跟导师说明。</p>', '1', '15', '190', null, '2017-03-31 00:00:00', '0', '1', '2016-10-12 15:48:15', '2016-10-17 16:35:15');
INSERT INTO `thesis` VALUES ('52', '2', '1', '基于云计算的网络安全研究', '论文类', '导师出题', '毕业论文', '<p>随着云计算的蓬勃发展,越来越多的企业和个人将他们的存储和计算需求付诸于云端.然而云计算的安全仍不容忽视,是当前的一个研究热点.论文需要对近年来云计算安全相关的研究成果进行总结,主要集中于数据安全,身份认证以及访问控制策略方面. 最后提出一套解决方案。</p>', '1', '27', '125', null, '2016-10-12 00:00:00', '0', '1', '2016-10-12 15:49:42', '2016-10-12 15:49:42');
INSERT INTO `thesis` VALUES ('53', '1', '3', '招标采购信息自动抓取软件开发与实现', '应用软件开发', '其他', '应用研究', '<p>垂直领域的互联网数据抓取与搜索是目前信息检索应用的重要方向。</p>\r\n\r\n<p>&nbsp;</p>\r\n\r\n<p>通过对招标采购信息的自动抓取，可以了解该垂直领域抓取的基本知识，掌握垂直信息抓取爬虫的设计和编程实现。</p>\r\n\r\n<p>需要学习的细节可能有：对信息检索开源项目的了解，对招标采购网站和相关行业信息的了解，对抓取查重和网页更新自动检测的技术掌握，对无模板网页信息抓取的学习和研究。</p>', '1', '278', '612', null, '2017-03-01 00:00:00', '0', '1', '2016-10-12 15:50:31', '2016-10-12 15:50:31');
INSERT INTO `thesis` VALUES ('54', '1', '3', '农业供求新闻信息自动抓取软件开发与实现', '应用软件开发', '其他', '应用研究', '<p>垂直领域的互联网数据抓取与搜索是目前信息检索应用的重要方向。</p>\r\n\r\n<p>&nbsp;</p>\r\n\r\n<p>通过对农业供求新闻信息的自动抓取，可以了解该垂直领域抓取的基本知识，掌握垂直信息抓取爬虫的设计和编程实现。</p>\r\n\r\n<p>需要学习的细节可能有：对信息检索开源项目的了解，对新闻和农业相关行业信息的了解，对抓取查重和网页更新自动检测的技术掌握，对无模板网页信息抓取的学习和研究。</p>\r\n\r\n<p>&nbsp;</p>\r\n\r\n<p>该选题需要实现农业供求新闻的自动抓取和整理。</p>', '1', '278', null, null, '2017-03-01 00:00:00', '0', '1', '2016-10-12 15:52:17', '2016-10-12 15:56:33');
INSERT INTO `thesis` VALUES ('55', '1', '3', '农产品价格预测研究和软件实现', '应用软件开发', '其他', '应用研究', '<p>农产品价格具有一定的波动性和规律性，</p>\r\n\r\n<p>对农产品价格的波动的预测具有客观的经济效应和社会效应。</p>\r\n\r\n<p>该项目需要对主流农产品进行价格信息整理、预测和分析，并生成相关图表。</p>', '1', '278', null, null, '2017-03-01 00:00:00', '0', '1', '2016-10-12 15:55:12', '2016-10-12 15:55:12');
INSERT INTO `thesis` VALUES ('56', '2', '1', '基于WEB的汽车租赁管理信息系统', '设计类', '导师出题', '毕业论文', '<p>熟悉Java等开发语言、数据库设计</p>', '1', '27', '96', null, '2016-10-12 00:00:00', '0', '1', '2016-10-12 15:55:50', '2016-10-12 16:32:17');
INSERT INTO `thesis` VALUES ('57', '2', '1', '基于客户细分的B2B模式下客户服务研究', '论文类', '导师出题', '毕业论文', '', '1', '25', '134', null, '2016-10-12 00:00:00', '0', '1', '2016-10-12 16:05:04', '2016-10-12 16:05:04');
INSERT INTO `thesis` VALUES ('58', '2', '1', '基于社区的生态农产品O2O营销策略研究', '论文类', '导师出题', '毕业论文', '', '1', '25', '93', null, '2016-10-12 00:00:00', '0', '1', '2016-10-12 16:09:56', '2016-10-12 16:09:56');
INSERT INTO `thesis` VALUES ('59', '2', '1', '泛在环境下图书馆信息服务研究---以华农图书馆为例', '论文类', '导师出题', '毕业论文', '', '1', '25', '131', null, '2016-10-12 00:00:00', '0', '1', '2016-10-12 16:12:02', '2016-10-12 16:12:02');
INSERT INTO `thesis` VALUES ('60', '2', '1', '基于社区的生态农产品O2O模式下的供应链模式研究', '论文类', '导师出题', '毕业论文', '', '1', '25', '72', null, '2016-10-12 00:00:00', '0', '1', '2016-10-12 16:14:00', '2016-10-12 16:14:00');
INSERT INTO `thesis` VALUES ('61', '2', '1', '基于社区的生态农产品O2O盈利模式研究', '论文类', '导师出题', '毕业论文', '', '1', '25', '126', null, '2016-10-12 00:00:00', '0', '1', '2016-10-12 16:15:19', '2016-10-12 16:15:19');
INSERT INTO `thesis` VALUES ('62', '2', '1', '图书馆数字资源网站用户界面优化设计', '设计类', '导师出题', '毕业论文', '', '1', '25', '56', null, '2016-10-12 00:00:00', '0', '1', '2016-10-12 16:20:31', '2016-10-12 16:20:31');
INSERT INTO `thesis` VALUES ('63', '2', '1', '基于O2O的健康消费品的市场定位与营销策略研究----以沃土工坊为例', '论文类', '导师出题', '毕业论文', '', '1', '25', '76', null, '2016-10-12 00:00:00', '0', '1', '2016-10-12 16:23:00', '2016-10-12 16:23:00');
INSERT INTO `thesis` VALUES ('65', '2', '1', '基于O2O的旅游产品设计与营销推广策略研究', '论文类', '导师出题', '毕业论文', '', '1', '25', '109', null, '2016-10-12 00:00:00', '0', '1', '2016-10-12 16:24:33', '2016-10-12 16:24:33');
INSERT INTO `thesis` VALUES ('67', '2', '1', '基于云计算的实验室管理信息系统设计', '设计类', '导师出题', '毕业论文', '<p>熟悉云计算技术，实现云计算平台架构设计和平台搭建。并在此基础上,完成基于云计算平台实验室管理信息系统的系统结构设计、功能模块设计及数据库设计。</p>', '1', '27', '99', null, '2016-10-12 00:00:00', '0', '1', '2016-10-12 16:36:32', '2016-10-12 16:36:32');
INSERT INTO `thesis` VALUES ('68', '2', '1', '白条禽替代活禽交易的消费者行为分析', '论文类', '导师课题', '毕业论文', '', '1', '7', '61', null, '2017-04-10 00:00:00', '0', '1', '2016-10-12 16:47:27', '2016-10-12 16:47:27');
INSERT INTO `thesis` VALUES ('69', '2', '2', '基于人因工程的广州市小学生课桌椅使用现状分析', '论文类', '导师出题', '毕业论文', '', '1', '7', '158', null, '2017-04-10 00:00:00', '0', '1', '2016-10-12 16:49:17', '2016-10-12 16:49:17');
INSERT INTO `thesis` VALUES ('70', '2', '1', '农业物联网的发展及关键技术应用研究', '论文类', '导师出题', '毕业论文', '<p>了解并熟悉农业物联网的架构模型、农业物联网关键技术,以及农业物联网信息感知技术、农业物联网信息传输技术、农业物联网信息处理技术等应用进展方面进行综述,并对农业物联网的前景进行分析和展望。</p>', '1', '27', '127', null, '2016-10-12 00:00:00', '0', '1', '2016-10-12 16:49:55', '2016-10-13 16:32:04');
INSERT INTO `thesis` VALUES ('72', '2', '2', '某有限公司精益生产研究', '论文类', '导师课题', '毕业论文', '<p>必须与企业实际相结合，提供相关的图片及数据。</p>', '1', '28', '198', null, '2017-04-03 00:00:00', '0', '1', '2016-10-12 16:52:35', '2016-10-12 16:52:35');
INSERT INTO `thesis` VALUES ('73', '2', '2', '基于人因工程的广州市中学生课桌椅使用现状分析', '论文类', '导师课题', '毕业论文', '', '1', '7', '140', null, '2017-04-10 00:00:00', '0', '1', '2016-10-12 16:52:40', '2017-10-01 17:18:39');
INSERT INTO `thesis` VALUES ('74', '2', '2', '柑橘黄龙病苗木远红外热处理温度场分布影响试验研究', '论文类', '导师课题', '毕业论文', '', '1', '7', '152', null, '2017-04-10 00:00:00', '0', '1', '2016-10-12 16:53:41', '2017-09-30 12:00:50');
INSERT INTO `thesis` VALUES ('75', '2', '2', '柑橘黄龙病热处理温度场数值模拟', '论文类', '导师课题', '毕业论文', '', '1', '7', '137', null, '2017-04-10 00:00:00', '0', '1', '2016-10-12 16:54:22', '2017-09-29 23:41:19');
INSERT INTO `thesis` VALUES ('76', '2', '2', '柑橘树干黄龙病热处理温度场分布影响试验研究', '论文类', '导师课题', '毕业论文', '', '1', '7', '147', null, '2017-04-10 00:00:00', '0', '1', '2016-10-12 16:55:04', '2016-10-12 16:55:04');
INSERT INTO `thesis` VALUES ('77', '2', '2', '基于生产线平衡的某生产线的优化', '论文类', '导师课题', '毕业论文', '<p>必须与企业实际相结合，提供相关的图片及数据。</p>', '1', '28', '168', null, '2017-04-03 00:00:00', '0', '1', '2016-10-12 16:55:19', '2017-10-13 09:50:47');
INSERT INTO `thesis` VALUES ('78', '2', '2', '柑橘黄龙病苗木微波热处理温度场分布影响试验研究', '论文类', '导师课题', '毕业论文', '', '1', '7', '151', null, '2017-04-10 00:00:00', '0', '1', '2016-10-12 16:55:30', '2016-10-12 16:55:30');
INSERT INTO `thesis` VALUES ('79', '2', '2', '柠檬桉精油微孔超声雾化效果研究', '论文类', '导师课题', '毕业论文', '', '1', '7', '163', null, '2017-04-10 00:00:00', '0', '1', '2016-10-12 16:56:06', '2016-10-12 16:56:06');
INSERT INTO `thesis` VALUES ('80', '2', '2', '基于SLP方法的某公司布置优化', '论文类', '导师课题', '毕业论文', '<p>必须与企业实际相结合，提供相关的图片及数据。</p>', '1', '28', '165', null, '2017-04-03 00:00:00', '0', '1', '2016-10-12 16:56:26', '2016-10-12 16:56:26');
INSERT INTO `thesis` VALUES ('81', '2', '2', '基于MATLAB的生猪行为识别软件', '设计类', '导师课题', '毕业论文', '<table style=\"height:19px; width:792px\">\r\n	<tbody>\r\n		<tr>\r\n			<td style=\"width: 792px; height: 19px;\">生猪进食、排泄、睡眠等行为的机器识别；图像处理技术、机器学习；软件</td>\r\n		</tr>\r\n	</tbody>\r\n</table>\r\n\r\n<p>&nbsp;</p>', '1', '12', '141', null, '2016-10-12 00:00:00', '0', '1', '2016-10-12 16:56:38', '2017-10-01 17:20:08');
INSERT INTO `thesis` VALUES ('82', '2', '2', '规模化养殖禽流感空气消毒剂超声雾化流场数值模拟', '论文类', '导师课题', '毕业论文', '', '1', '7', '146', null, '2017-04-10 00:00:00', '0', '1', '2016-10-12 16:56:50', '2016-10-12 16:56:50');
INSERT INTO `thesis` VALUES ('83', '2', '2', '工业工程在某医院中的应用', '论文类', '导师课题', '毕业论文', '<p>必须与企业实际相结合，提供相关的图片及数据。</p>', '1', '28', '184', null, '2017-04-03 00:00:00', '0', '1', '2016-10-12 16:57:30', '2016-10-12 16:57:30');
INSERT INTO `thesis` VALUES ('84', '2', '2', '禽流感空气消毒剂超声雾化效果研究', '论文类', '导师课题', '毕业论文', '', '1', '7', '166', null, '2017-04-10 00:00:00', '0', '1', '2016-10-12 16:57:32', '2016-10-12 16:57:32');
INSERT INTO `thesis` VALUES ('85', '2', '2', '基于机器视觉的自然环境下绿色荔枝的识别研究', '设计类', '导师课题', '毕业论文', '<table style=\"height:78px; width:792px\">\r\n	<tbody>\r\n		<tr>\r\n			<td style=\"width: 792px; height: 78px;\">在自然环境下利用各颜色空间以及荔枝的纹理特征，将树枝、叶子、天空和土地区别开来，准确地识别出绿色荔枝果实。</td>\r\n		</tr>\r\n	</tbody>\r\n</table>\r\n\r\n<p>&nbsp;</p>', '1', '12', '150', null, '2016-10-12 00:00:00', '0', '1', '2016-10-12 16:57:36', '2017-09-30 12:42:29');
INSERT INTO `thesis` VALUES ('86', '2', '2', '自然环境下水果的夜间识别与采摘点的确定', '设计类', '导师课题', '毕业论文', '<table style=\"height:48px; width:792px\">\r\n	<tbody>\r\n		<tr>\r\n			<td style=\"width: 792px; height: 48px;\">利用机器视觉实现自然环境下一种水果的识别与采摘点的确定，使用matlab进行图像处理，成果展示形式为论文</td>\r\n		</tr>\r\n	</tbody>\r\n</table>\r\n\r\n<p>&nbsp;</p>', '1', '12', '148', null, '2016-10-12 00:00:00', '0', '1', '2016-10-12 16:58:28', '2016-10-12 16:58:28');
INSERT INTO `thesis` VALUES ('87', '2', '2', '工业工程在某车站的应用', '论文类', '导师课题', '毕业论文', '<p>必须与企业实际相结合，提供相关的图片及数据。</p>', '1', '28', '186', null, '2017-04-03 00:00:00', '0', '1', '2016-10-12 16:58:55', '2016-10-12 16:58:55');
INSERT INTO `thesis` VALUES ('88', '2', '2', '基于计算机视觉的葡萄品质检测技术的研究', '设计类', '导师课题', '毕业论文', '<table style=\"height:19px; width:792px\">\r\n	<tbody>\r\n		<tr>\r\n			<td style=\"width: 792px; height: 19px;\">主要研究的是葡萄的识别与葡萄品质检测技术的研究，要求的技术图像识别算法，运用到了matlab工具。成果是做出一个GUI的系统出来，能在界面中点击后就展现结果。</td>\r\n		</tr>\r\n	</tbody>\r\n</table>\r\n\r\n<p>&nbsp;</p>', '1', '12', '187', null, '2016-10-12 00:00:00', '0', '1', '2016-10-12 16:59:13', '2016-10-12 16:59:13');
INSERT INTO `thesis` VALUES ('89', '2', '2', '基于机器视觉的皇帝柑品质检测技术研究', '设计类', '导师课题', '毕业论文', '<p>利用图像处理技术对皇帝柑外部品质的实时检查。得到正常的，微</p>', '1', '12', '169', null, '2016-10-12 00:00:00', '0', '1', '2016-10-12 17:00:48', '2016-10-12 17:00:48');
INSERT INTO `thesis` VALUES ('90', '2', '2', '基于SLP方法的某公司某车间设施布局研究', '论文类', '导师课题', '毕业论文', '<p>必须与企业实际相结合，提供相关的图片及数据。</p>', '1', '28', '185', null, '2017-04-03 00:00:00', '0', '1', '2016-10-12 17:00:49', '2016-10-12 17:00:49');
INSERT INTO `thesis` VALUES ('91', '2', '2', '基于视觉的马铃薯品质的实时检测技术研究', '设计类', '导师课题', '毕业论文', '<p>利用图像处理技术对皇帝柑外部品质的实时检查。得到正常的，微损失的和腐烂的皇帝柑的图像特征，通过视觉实时检测出来</p>', '1', '12', '191', null, '2016-10-12 00:00:00', '0', '1', '2016-10-12 17:01:23', '2016-10-12 17:01:23');
INSERT INTO `thesis` VALUES ('92', '2', '2', '人因工程在某图书馆的应用', '论文类', '导师课题', '毕业论文', '<p>必须与企业实际相结合，提供相关的图片及数据。</p>', '1', '28', '136', null, '2017-04-03 00:00:00', '0', '1', '2016-10-12 17:02:14', '2017-09-29 23:28:00');
INSERT INTO `thesis` VALUES ('93', '2', '2', '人因工程在某超市的应用', '论文类', '导师课题', '毕业论文', '<p>必须与企业实际相结合，提供相关的图片及数据。</p>', '1', '28', '167', null, '2017-04-03 00:00:00', '0', '1', '2016-10-12 17:02:56', '2016-10-12 17:02:56');
INSERT INTO `thesis` VALUES ('94', '2', '2', '基于视觉的木材工件缺陷检测技术研究', '设计类', '导师课题', '毕业论文', '<table style=\"height:19px; width:792px\">\r\n	<tbody>\r\n		<tr>\r\n			<td style=\"width: 792px; height: 19px;\">主要研究的是木材的外部缺陷检测，要求的技术图像识别算法，进行家具木材加工中的缺陷，比如活结，虫眼等实时检运用到了matlab工具。成果是做出一个GUI的系统出来，</td>\r\n		</tr>\r\n	</tbody>\r\n</table>', '1', '12', '164', null, '2016-10-12 00:00:00', '0', '1', '2016-10-12 17:03:03', '2016-10-12 17:03:03');
INSERT INTO `thesis` VALUES ('95', '2', '1', '校园失物招领网站的设计与实现', '设计类', '学生定题', '毕业论文', '<p> </p>\r\n\r\n<table style=\"height:84px; width:792px\">\r\n	<tbody>\r\n		<tr>\r\n			<td style=\"width: 792px; height: 84px;\">校园师生提供一个便利、有效扩散失物招领信息的平台；<br />\r\n			基于Bootstrap实现响应式布局，集成SpringMVC +Spring+ Hiernate框架，使用freemarker作为模板引擎实现静态页面与数据的结合；SEO 搜索引擎优化。</td>\r\n		</tr>\r\n	</tbody>\r\n</table>', '1', '12', '82', null, '2016-10-12 00:00:00', '0', '1', '2016-10-12 17:05:27', '2016-10-12 17:10:56');
INSERT INTO `thesis` VALUES ('96', '2', '1', '基于web的个人规划与记录应用', '设计类', '学生定题', '毕业论文', '<table style=\"height:19px; width:792px\">\r\n	<tbody>\r\n		<tr>\r\n			<td style=\"width: 792px; height: 19px;\">web应用的开发，开发出一款基于web的应用系统，用于个人记录与规划任务</td>\r\n		</tr>\r\n	</tbody>\r\n</table>', '1', '12', '81', null, '2016-10-13 00:00:00', '0', '1', '2016-10-12 17:07:06', '2016-10-12 17:10:45');
INSERT INTO `thesis` VALUES ('97', '2', '1', '华农大社团组织活动宣传展示网', '设计类', '学生定题', '毕业论文', '<table style=\"height:104px; width:792px\">\r\n	<tbody>\r\n		<tr>\r\n			<td style=\"width: 792px; height: 104px;\">主要内容：对各个社团和组织的活动进行统一管理，使得活动发布渠道不再杂乱无章，便于大众快速查找、了解和参与，并且快速交流。<br />\r\n			技术：开发语言：Java、js；框架：springMVC+hibernate；前端：easyui、css、html；数据库：mysql；服务器：tomcat等<br />\r\n			成果展示：网站形式</td>\r\n		</tr>\r\n	</tbody>\r\n</table>', '1', '12', '83', null, '2016-10-12 00:00:00', '0', '1', '2016-10-12 17:07:53', '2016-10-12 17:10:28');
INSERT INTO `thesis` VALUES ('99', '2', '1', '高校二手交易平台的设计与实现', '设计类', '导师出题', '毕业论文', '<p>熟悉Java等开发语言、数据库设计</p>', '1', '27', '94', null, '2016-10-12 00:00:00', '0', '1', '2016-10-12 17:13:35', '2016-10-17 15:53:23');
INSERT INTO `thesis` VALUES ('100', '2', '1', '集成预测方法及其在农产品期货市场预测中的应用', '论文类', '导师课题', '毕业论文', '', '1', '6', '112', null, '2017-04-15 00:00:00', '0', '1', '2016-10-12 17:35:09', '2016-10-14 22:38:32');
INSERT INTO `thesis` VALUES ('101', '2', '1', '基于微信平台的教务管理及服务系统', '论文类', '其他', '毕业论文', '<p>基于微信平台的教务管理及服务系统</p>', '1', '16', '79', null, '2017-05-01 00:00:00', '0', '1', '2016-10-12 17:47:57', '2016-10-12 17:47:57');
INSERT INTO `thesis` VALUES ('102', '2', '1', '蔬菜价格预警预测', '论文类', '导师课题', '毕业论文', '', '1', '21', '114', null, '2016-10-31 00:00:00', '0', '1', '2016-10-12 17:49:46', '2016-10-12 17:49:46');
INSERT INTO `thesis` VALUES ('103', '2', '1', '基于SSH+JQuery框架的电影票售票系统', '论文类', '其他', '毕业论文', '<p>基于SSH+JQuery框架的电影票售票系统</p>', '1', '16', '100', null, '2017-05-01 00:00:00', '0', '1', '2016-10-12 17:50:28', '2016-10-12 17:50:28');
INSERT INTO `thesis` VALUES ('104', '2', '1', '广州市住宅价格主要影响因素分析及其发展趋势预测', '论文类', '其他', '毕业论文', '<p>广州市住宅价格主要影响因素分析及其发展趋势预测</p>', '1', '16', '90', null, '2017-05-01 00:00:00', '0', '1', '2016-10-12 17:51:10', '2016-10-12 17:52:24');
INSERT INTO `thesis` VALUES ('105', '2', '1', '基于J2EE的酒店订房管理系统设计与实现', '论文类', '其他', '毕业论文', '<p>基于J2EE的酒店订房管理系统设计与实现</p>', '1', '16', '104', null, '2017-05-01 00:00:00', '0', '1', '2016-10-12 17:51:49', '2016-10-12 17:51:49');
INSERT INTO `thesis` VALUES ('106', '2', '1', '基于数据挖掘的蔬菜农药残留预警研究', '论文类', '导师课题', '毕业论文', '', '1', '21', '135', null, '2016-10-31 00:00:00', '0', '1', '2016-10-12 17:54:04', '2016-10-12 17:54:04');
INSERT INTO `thesis` VALUES ('107', '2', '1', '农产品期货价格预测', '论文类', '导师课题', '毕业论文', '', '1', '21', '124', null, '2016-10-31 00:00:00', '0', '1', '2016-10-12 17:55:29', '2016-10-12 17:55:29');
INSERT INTO `thesis` VALUES ('108', '2', '1', '物联网环境下的农产品流通质量安全风险评估与预警方法', '论文类', '导师课题', '毕业论文', '', '1', '6', '43', null, '2017-04-15 00:00:00', '0', '1', '2016-10-12 20:02:04', '2017-08-12 22:19:12');
INSERT INTO `thesis` VALUES ('110', '2', '1', '基于微信平台的农产品电商推荐系统', '设计类', '导师课题', '毕业论文', '', '1', '6', '37', null, '2017-04-15 00:00:00', '0', '1', '2016-10-12 20:33:40', '2016-10-14 22:37:57');
INSERT INTO `thesis` VALUES ('111', '2', '1', '面向质量安全可追溯的农产品流通有效信息传递机制分析', '论文类', '导师课题', '毕业论文', '', '1', '6', '120', null, '2017-04-15 00:00:00', '0', '1', '2016-10-12 20:34:43', '2016-10-14 22:37:31');
INSERT INTO `thesis` VALUES ('112', '2', '1', '基于web的数据自动获取方法及其在农产品价格预测中的应用', '论文类', '导师课题', '毕业论文', '', '1', '6', '115', null, '2017-04-15 00:00:00', '0', '1', '2016-10-12 20:35:29', '2016-10-14 22:36:19');
INSERT INTO `thesis` VALUES ('113', '2', '1', '基于开源软件的农产品质量安全追溯云计算平台构建', '论文类', '导师课题', '毕业论文', '', '1', '6', '52', null, '2017-04-15 00:00:00', '0', '1', '2016-10-12 20:36:22', '2016-10-14 22:34:46');
INSERT INTO `thesis` VALUES ('114', '2', '1', '物联网多源信息融合技术及其在农产品质量安全追溯系统中的应用', '论文类', '导师课题', '毕业论文', '', '1', '6', '102', null, '2017-04-15 00:00:00', '0', '1', '2016-10-12 20:37:01', '2016-10-14 22:35:47');
INSERT INTO `thesis` VALUES ('115', '2', '1', '中国农业政策实施成效的评价方法', '论文类', '导师课题', '毕业论文', '<p><a class=\"easyui-linkbutton l-btn l-btn-small l-btn-focus\" href=\"javascript:void(0)\" id=\"\" onclick=\"thesisForm.submitForm()\">保存 </a></p>', '1', '6', '69', null, '2017-04-15 00:00:00', '0', '1', '2016-10-12 20:38:12', '2016-10-14 22:33:35');
INSERT INTO `thesis` VALUES ('116', '2', '1', '中国农产品价格波动特征及影响因素分析', '论文类', '导师课题', '毕业论文', '', '1', '6', '98', null, '2017-04-15 00:00:00', '0', '1', '2016-10-12 20:38:47', '2016-10-14 22:32:51');
INSERT INTO `thesis` VALUES ('117', '2', '1', '基于SSH+EasyUI分销管理系统', '设计类', '导师出题', '毕业论文', '<p>企业分销管理平台，实现分销商管理，分销订单管理，返点与提成核算等基本功能。</p>', '1', '20', '48', '19', '2016-10-12 00:00:00', '0', '1', '2016-10-12 20:59:59', '2016-10-12 20:59:59');
INSERT INTO `thesis` VALUES ('118', '2', '1', '基于爬虫技术个人求职信息助手设计', '设计类', '学生定题', '毕业论文', '<p>利用爬虫技术收集面向应届大学生的招聘信息，实现宣讲面试行程管理功能，并能记录求职相关信息。</p>', '1', '20', '54', null, '2016-10-13 00:00:00', '0', '1', '2016-10-12 21:02:18', '2016-10-12 21:02:18');
INSERT INTO `thesis` VALUES ('119', '2', '1', '高校学生资源共享与交易平台', '设计类', '学生定题', '毕业论文', '<p>面向大学生分析其需求，利用网络爬虫收集信息资源分享，闲置商品交易等信息，利用文本分析方法结构化信息</p>', '1', '20', '64', null, '2016-10-12 00:00:00', '0', '1', '2016-10-12 21:05:14', '2016-10-14 14:22:18');
INSERT INTO `thesis` VALUES ('121', '2', '1', '基于用户体验广告投放管理系统交互设计', '论文类', '学生定题', '毕业论文', '<p>根据广告行业需求，设计广告系统的交互，达到良好用户体验</p>', '1', '20', '67', null, '2016-10-12 00:00:00', '0', '1', '2016-10-12 21:11:48', '2016-10-12 21:11:48');
INSERT INTO `thesis` VALUES ('122', '1', '3', '远红外图像行人分割研究', '数字图像处理', '其他', '应用研究', '<p>有别于传统的可见光摄像头，远红外摄像头通过场景的温差成像，从而使得特别适合进行夜间的行人检测。远红行人分割是远红行人检测中至关重要的阶段。本题目拟研究远红行人分割方法。具体地，将利用场景先验知识，辅助实现远红行人的分割，从而提出一种改进的远红外行人分割方法。</p>', '1', '862', null, null, '2017-04-23 00:00:00', '0', '1', '2016-10-12 21:14:15', '2016-10-12 21:52:12');
INSERT INTO `thesis` VALUES ('123', '2', '1', '校园宿舍及网络报修系统开发与应用', '论文类', '其他', '毕业论文', '<p>校园宿舍及网络报修系统开发与应用</p>', '1', '16', null, null, '2017-05-01 00:00:00', '0', '1', '2016-10-12 21:16:33', '2017-08-01 11:07:18');
INSERT INTO `thesis` VALUES ('124', '2', '1', '房地产销售管理信息系统设计与实现', '论文类', '其他', '毕业论文', '<p>房地产销售管理信息系统设计与实现</p>', '1', '16', '36', null, '2017-05-01 00:00:00', '0', '1', '2016-10-12 21:17:35', '2016-10-12 21:17:35');
INSERT INTO `thesis` VALUES ('125', '1', '3', '远红外行人特征提取方法研究', '数字图像处理', '其他', '应用研究', '<p>行人的描述特征，是影响行人分类的重要因素。本题目拟研究表征能力强、实时性较好的远红外行人描述特征，从而提升分类的准确率。具体地，将研究特征融合、改进目前先进的行人描述特征，从而提出新的远红外行人描述特征。并通过实验验证，所设计的特征的有效性。</p>', '1', '862', null, null, '2017-04-23 00:00:00', '0', '1', '2016-10-12 21:18:48', '2016-10-12 21:18:48');
INSERT INTO `thesis` VALUES ('126', '2', '1', '基于快速候选区域卷积神经网络的目标识别方法研究', '论文类', '其他', '毕业论文', '<p>基于快速候选区域卷积神经网络的目标识别方法研究</p>', '1', '16', '57', null, '2017-05-01 00:00:00', '0', '1', '2016-10-12 21:20:51', '2016-10-12 21:20:51');
INSERT INTO `thesis` VALUES ('127', '1', '3', '远红外行人标注系统研究', '应用软件开发', '其他', '设计性', '<p>对行人检测方法进行评估时，需要事先对评估视频的行人进行人工标注。然而，人工标注是一个枯燥、费时费力的工作。所以，本题目拟研究高效率的行人标注方法，从而减少人工开销。具体地，拟利用视频中行人的连续性，利用所标注的关键帧，自动估计其余帧的行人标注信息，从而极大地提升标注的效率。最终，将设计出一套行人标注系统。</p>', '1', '862', null, null, '2017-04-23 00:00:00', '0', '1', '2016-10-12 21:25:26', '2016-10-12 21:25:26');
INSERT INTO `thesis` VALUES ('128', '2', '2', '生产线优化研究', '论文类', '导师课题', '毕业论文', '', '1', '21', '199', null, '2016-10-31 00:00:00', '0', '1', '2016-10-12 21:30:03', '2017-09-30 11:50:51');
INSERT INTO `thesis` VALUES ('129', '2', '2', '第三方逆向物流供应商选择', '论文类', '导师课题', '毕业论文', '', '1', '21', '143', null, '2016-10-31 00:00:00', '0', '1', '2016-10-12 21:31:18', '2016-10-12 21:31:18');
INSERT INTO `thesis` VALUES ('130', '2', '2', '生产过程质量控制研究', '论文类', '导师课题', '毕业论文', '', '1', '21', '195', null, '2016-10-31 00:00:00', '0', '1', '2016-10-12 21:32:16', '2016-10-12 21:32:16');
INSERT INTO `thesis` VALUES ('131', '2', '1', '基于SSH+EasyUI公司账务管理系统', '设计类', '导师出题', '毕业论文', '<p>企业基本账务管理，包括收入、支出、资产、负债等基本功能记录，实现简单的利润分析和成本核算功能。</p>', '1', '20', '107', null, '2016-10-12 00:00:00', '0', '1', '2016-10-12 21:37:11', '2016-10-12 21:37:11');
INSERT INTO `thesis` VALUES ('132', '1', '3', '远红行人分类方法研究', '人工智能', '其他', '应用研究', '<p>在进行行人检测时，分类器设计，是影响行人分类至关重要的步骤。该题目拟分析基于目前流行的远红外行人描述特征，不同的单分类（支持向量机、Adaboost、人工神经网络等）的分类效果。从而通过分类准确率、分类效率指标，评估出在特定的训练样本和特征的前提下，最优的分类器。进一步，拟研究分类器的最佳结合方式，从而提出效果更佳的远红外行人分类器。</p>', '1', '862', null, null, '2017-04-23 00:00:00', '0', '1', '2016-10-12 21:38:26', '2016-10-12 21:38:26');
INSERT INTO `thesis` VALUES ('133', '2', '2', '供应链环境下的库存管理研究', '论文类', '导师课题', '毕业论文', '', '1', '21', '160', null, '2016-10-31 00:00:00', '0', '1', '2016-10-12 21:38:40', '2016-10-12 21:38:40');
INSERT INTO `thesis` VALUES ('134', '2', '1', '基于微信公众号O2O西服定制交易平台', '设计类', '导师出题', '毕业论文', '<p>基于微信公众号O2O平台，提供定制服务的O2O功能。</p>', '1', '20', '108', null, '2016-10-12 00:00:00', '0', '1', '2016-10-12 21:40:44', '2016-10-12 21:40:44');
INSERT INTO `thesis` VALUES ('135', '2', '1', '基于微信公众号三级分销平台设计', '设计类', '导师课题', '毕业论文', '<p>基于微信公众号的网上商店，支持三级分销功能。</p>', '1', '20', '110', null, '2016-10-12 00:00:00', '0', '1', '2016-10-12 21:44:07', '2016-10-12 21:44:07');
INSERT INTO `thesis` VALUES ('136', '2', '2', '某餐饮企业外卖配送的优化研究', '论文类', '导师课题', '毕业论文', '', '1', '21', '156', null, '2016-10-31 00:00:00', '0', '1', '2016-10-12 21:44:25', '2016-10-17 10:31:36');
INSERT INTO `thesis` VALUES ('137', '1', '3', '远红行人跟踪方法研究', '人工智能', '其他', '应用研究', '<p>行人跟踪是行人行为预测的重要基础。目前，远红外图像日益流行，所以研究鲁棒的远红外行人跟踪方法具有重要意义。无论在车载辅助驾驶、视频监控、智能机器人领域，均具有广泛的应用。改课题，拟针对远红外行人的特性，基于卡尔曼滤波或粒子滤波跟踪方法，提出改进的远红外行人跟踪方法，并通过实验验证方法的可行性。</p>', '1', '862', null, null, '2017-04-23 00:00:00', '0', '1', '2016-10-12 21:51:19', '2016-10-12 21:51:19');
INSERT INTO `thesis` VALUES ('138', '2', '1', '基于微信公众号个人助理服务平台', '设计类', '学生定题', '毕业论文', '<p>基于微信公众号，实现个人诸如商品价格监控等多项活助理功能，如价格监控等。</p>', '1', '20', '128', null, '2016-10-12 00:00:00', '0', '1', '2016-10-12 21:53:37', '2016-10-12 21:53:37');
INSERT INTO `thesis` VALUES ('139', '2', '1', '基于Vue.js的课程信息资源分享系统的设计与实现', '论文类', '其他', '毕业论文', '<p>基于Vue.js的课程信息资源分享系统的设计与实现</p>', '1', '16', '63', null, '2017-05-01 00:00:00', '0', '1', '2016-10-12 22:35:01', '2016-10-12 22:35:01');
INSERT INTO `thesis` VALUES ('140', '2', '2', '经济新常态背景下企业创新型人才需求分析——以佛山中格威电子有限公司为例', '论文类', '导师出题', '毕业论文', '<p>中格威电子有限公司作为我系挂牌校企协同培养创新型人才单位，拟通过实地调研，调查问卷等，基于协同创新理论以及全面创新管理等理论，通过学生毕业找工作视角、社会大环境视角等若干方面,系统地提炼出如何根据企业要求进行培养创新型人才，以及可能出现的问题及对策。</p>\r\n\r\n<p> </p>\r\n\r\n<p>要求:工业工程学生，吃苦耐劳，能搜集资料，实地调研，有事情需提前跟导师说明。</p>', '1', '15', null, null, '2017-03-31 00:00:00', '0', '1', '2016-10-13 00:53:48', '2016-10-15 22:44:25');
INSERT INTO `thesis` VALUES ('142', '2', '2', '基于机器视觉的AGV导航算法研究', '论文类', '导师出题', '毕业论文', '<p>AGV运行过程中，自主导航有各种各样的方法。拟通过计算机视觉的方式，实时获取图像，计算导航路线，并计算实际偏差。</p>\r\n\r\n<p>要求:吃苦耐劳，能搜集资料，对算法有兴趣，有事情需提前跟导师说明。</p>', '1', '15', '194', null, '2017-03-31 00:00:00', '0', '1', '2016-10-13 01:09:14', '2016-10-13 01:09:14');
INSERT INTO `thesis` VALUES ('143', '2', '2', '基于多传感器信息融合的AGV避障算法研究', '论文类', '导师出题', '毕业论文', '<p>AGV运行过程中，不可避免的遇到障碍物，如何对障碍物分类，分类后的障碍物如何绕过，路径如何规划，在AGV发生迷失的情况下如何会到正确的导航线，需要做进一步的研究。</p>\r\n\r\n<p>要求:吃苦耐劳，能搜集资料，对算法有兴趣，有事情需提前跟导师说明。</p>', '1', '15', null, null, '2017-03-31 00:00:00', '0', '1', '2016-10-13 01:13:00', '2016-10-13 01:13:00');
INSERT INTO `thesis` VALUES ('144', '2', '2', '物联网应用中网关NAT穿透技术研究', '论文类', '导师出题', '毕业论文', '<p>物联网环境下,点对点通信系统由于网络地址转换(NAT)环境，受到阻碍而无法正常建立连接，导致通信过程失败，有必要进一步研究并实现NAT穿透。</p>\r\n\r\n<p>&nbsp;</p>\r\n\r\n<p>要求:吃苦耐劳，能搜集资料，了解网络及VPN技术，有事情需提前跟导师说明。</p>', '1', '15', null, null, '2017-03-31 00:00:00', '0', '1', '2016-10-13 01:21:54', '2016-10-13 01:21:54');
INSERT INTO `thesis` VALUES ('145', '2', '2', '支持内网连接的VPN穿透技术研究', '论文类', '导师出题', '毕业论文', '<p>传统VPN因为存在网关的原因，不能用于内网两台主机直接连接，拟寻找一种方法，实现通过VPN技术来连接两台计算机，达到资源共享的目的，同时为两台异地计算机虚拟加入同一局域网做准备。</p>\r\n\r\n<p>要求:吃苦耐劳，能搜集资料，对网络、VPN及加速器等原理有兴趣，有事情需提前跟导师说明。</p>', '1', '15', '173', null, '2017-03-31 00:00:00', '0', '1', '2016-10-13 01:29:34', '2016-10-13 01:29:34');
INSERT INTO `thesis` VALUES ('146', '2', '2', '剪枝机器人机械手设计研究', '论文类', '导师出题', '毕业论文', '<p>设计剪枝机器人机械手，能实现剪枝功能，有一定的通用性，且不出现运动干涉。</p>\r\n\r\n<p>要求:吃苦耐劳，能搜集资料，会使用AutoCAD等二维、SolidWorks等三维设计软件，有事情需提前跟导师说明。</p>', '1', '15', null, null, '2017-03-31 00:00:00', '0', '1', '2016-10-13 01:33:59', '2016-10-13 01:33:59');
INSERT INTO `thesis` VALUES ('147', '2', '1', '经济新常态背景下企业创新型人才需求分析——以志高空调集团为例', '论文类', '导师出题', '毕业论文', '<p>志高空调集团作为我系挂牌校企协同培养创新型人才单位，拟通过实地调研，调查问卷等，基于协同创新理论以及全面创新管理等理论，通过学生毕业找工作视角、社会大环境视角等若干方面,系统地提炼出如何根据企业要求进行培养创新型人才，以及可能出现的问题及对策。</p>\r\n\r\n<p>要求:信管专业学生，吃苦耐劳，能搜集资料，实地调研，有事情需提前跟导师说明。</p>', '1', '15', null, null, '2017-03-31 00:00:00', '0', '1', '2016-10-13 01:42:11', '2016-10-18 13:17:25');
INSERT INTO `thesis` VALUES ('148', '2', '1', '支持内网连接的VPN穿透技术研究', '论文类', '导师出题', '毕业论文', '<p>传统VPN因为存在网关的原因，不能用于内网两台主机直接连接，拟寻找一种方法，实现通过VPN技术来连接两台计算机，达到资源共享的目的，同时为两台异地计算机虚拟加入同一局域网做准备。</p>\r\n\r\n<p>要求:吃苦耐劳，能搜集资料，对网络、VPN及加速器等原理有兴趣，有事情需提前跟导师说明。</p>', '1', '15', null, null, '2017-03-31 00:00:00', '0', '1', '2016-10-13 01:42:54', '2016-10-13 01:42:54');
INSERT INTO `thesis` VALUES ('149', '2', '1', '物联网应用中网关NAT穿透技术研究', '论文类', '导师出题', '毕业论文', '<p>物联网环境下,点对点通信系统由于网络地址转换(NAT)环境，受到阻碍而无法正常建立连接，导致通信过程失败，有必要进一步研究并实现NAT穿透。</p>\r\n\r\n<p>&nbsp;</p>\r\n\r\n<p>要求:吃苦耐劳，能搜集资料，了解网络及VPN技术，有事情需提前跟导师说明。</p>', '1', '15', null, null, '2017-03-31 00:00:00', '0', '1', '2016-10-13 01:44:04', '2016-10-13 01:44:04');
INSERT INTO `thesis` VALUES ('150', '2', '1', '基于机器视觉的AGV导航算法研究', '论文类', '导师出题', '毕业论文', '<p>AGV运行过程中，自主导航有各种各样的方法。拟通过计算机视觉的方式，实时获取图像，计算导航路线，并计算实际偏差。</p>\r\n\r\n<p>要求:吃苦耐劳，能搜集资料，对算法有兴趣，有事情需提前跟导师说明。</p>', '1', '15', null, null, '2017-03-31 00:00:00', '0', '1', '2016-10-13 01:45:02', '2016-10-13 01:45:02');
INSERT INTO `thesis` VALUES ('154', '1', '3', '基于教室视频数据的人数统计系统研究', '应用软件开发', '生产实践', '应用研究', '', '1', '225', '680', null, '2017-03-31 00:00:00', '0', '1', '2016-10-13 08:49:55', '2016-10-13 08:49:55');
INSERT INTO `thesis` VALUES ('155', '1', '3', '卷烟网上订货系统', '应用软件开发', '生产实践', '应用研究', '', '1', '225', '681', null, '2017-03-31 00:00:00', '0', '1', '2016-10-13 08:51:24', '2016-10-13 08:51:24');
INSERT INTO `thesis` VALUES ('156', '1', '3', '迷宫小球', '应用软件开发', '生产实践', '应用研究', '', '1', '225', '682', null, '2017-03-31 00:00:00', '0', '1', '2016-10-13 08:53:00', '2016-10-13 08:53:00');
INSERT INTO `thesis` VALUES ('157', '1', '3', '各地美食攻略与原创食谱分享网站', '应用软件开发', '生产实践', '应用研究', '', '1', '225', '696', null, '2017-03-31 00:00:00', '0', '1', '2016-10-13 08:54:49', '2016-10-13 08:54:49');
INSERT INTO `thesis` VALUES ('158', '1', '3', '网上拍卖系统', '应用软件开发', '生产实践', '应用研究', '', '1', '225', '697', null, '2017-03-31 00:00:00', '0', '1', '2016-10-13 08:56:24', '2016-10-13 08:56:24');
INSERT INTO `thesis` VALUES ('159', '1', '3', '基于遗传算法的制衣布匹最优化裁剪算法研究与实现', '应用软件开发', '生产实践', '应用研究', '', '1', '225', '338', null, '2017-03-31 00:00:00', '0', '1', '2016-10-13 08:57:24', '2016-10-17 10:04:00');
INSERT INTO `thesis` VALUES ('160', '1', '3', '基于SpringMVC的企业采购管理子系统的实现', '应用软件开发', '生产实践', '应用研究', '', '1', '225', '711', null, '2017-03-31 00:00:00', '0', '1', '2016-10-13 08:58:57', '2016-10-13 08:58:57');
INSERT INTO `thesis` VALUES ('161', '1', '3', '基于网络爬虫的新闻资讯采集服务的设计与实现', '应用软件开发', '生产实践', '应用研究', '', '1', '225', '712', null, '2017-03-31 00:00:00', '0', '1', '2016-10-13 09:00:06', '2016-10-13 09:00:06');
INSERT INTO `thesis` VALUES ('162', '1', '3', '停车场自动计费门禁系统的设计与实现', '应用软件开发', '生产实践', '应用研究', '', '1', '225', '713', null, '2017-03-31 00:00:00', '0', '1', '2016-10-13 09:01:11', '2016-10-13 09:01:11');
INSERT INTO `thesis` VALUES ('163', '1', '3', '基于UNITY3D游戏引擎制作的PC端格斗游戏《武侠争霸》', '应用软件开发', '生产实践', '应用研究', '', '1', '225', '726', null, '2017-03-31 00:00:00', '0', '1', '2016-10-13 09:02:46', '2016-10-13 09:02:46');
INSERT INTO `thesis` VALUES ('164', '1', '3', '基于集成学习的O2O电商平台用户优惠券使用预测', '应用软件开发', '生产实践', '应用研究', '', '1', '225', '294', null, '2017-03-31 00:00:00', '0', '1', '2016-10-13 09:03:40', '2016-10-13 16:11:39');
INSERT INTO `thesis` VALUES ('165', '1', '3', '基于arduino的智能避障小车', '应用软件开发', '生产实践', '应用研究', '', '1', '225', '581', null, '2017-03-31 00:00:00', '0', '1', '2016-10-13 09:04:41', '2016-10-13 15:47:57');
INSERT INTO `thesis` VALUES ('166', '1', '3', '文档在线预览的研究与实现', '应用软件开发', '生产实践', '应用研究', '<p>文档在线预览的研究与实现</p>', '1', '217', '514', null, '2017-05-20 00:00:00', '0', '1', '2016-10-13 09:24:19', '2017-06-13 18:08:25');
INSERT INTO `thesis` VALUES ('167', '1', '3', '精品课程网站发布系统的设计与实现', '应用软件开发', '生产实践', '设计性', '', '1', '217', '504', null, '2017-05-20 00:00:00', '0', '1', '2016-10-13 09:26:03', '2016-10-13 16:13:15');
INSERT INTO `thesis` VALUES ('168', '1', '3', '基于共享经济下的车位调度系统', '应用软件开发', '生产实践', '设计性', '', '1', '206', '671', null, '2017-05-10 00:00:00', '0', '1', '2016-10-13 11:20:03', '2016-10-13 11:20:03');
INSERT INTO `thesis` VALUES ('170', '1', '3', '物流信息系统的项目外包及成本管理子系统的实现', '应用软件开发', '生产实践', '设计性', '', '1', '206', '744', null, '2017-05-10 00:00:00', '0', '1', '2016-10-13 11:22:10', '2016-10-14 09:46:12');
INSERT INTO `thesis` VALUES ('171', '1', '3', '基于商务智能的网站服装营销分析', '应用软件开发', '生产实践', '设计性', '', '1', '206', '673', null, '2017-05-10 00:00:00', '0', '1', '2016-10-13 11:24:47', '2016-10-13 11:24:47');
INSERT INTO `thesis` VALUES ('172', '1', '3', '门急诊划价收费子系统', '应用软件开发', '生产实践', '设计性', '', '1', '206', '689', null, '2017-05-10 00:00:00', '0', '1', '2016-10-13 11:26:42', '2016-10-13 11:26:42');
INSERT INTO `thesis` VALUES ('173', '1', '3', '基于play framework框架开发的个人图库展示与管理', '应用软件开发', '生产实践', '设计性', '', '1', '206', '690', null, '2017-05-10 00:00:00', '0', '1', '2016-10-13 11:29:10', '2016-10-13 11:29:10');
INSERT INTO `thesis` VALUES ('174', '1', '3', '毕业设计选题系统', '应用软件开发', '生产实践', '设计性', '', '1', '206', '691', null, '2017-05-10 00:00:00', '0', '1', '2016-10-13 11:31:44', '2016-10-13 11:31:44');
INSERT INTO `thesis` VALUES ('175', '1', '3', '基于SpringMVC技术曲江文旅门户系统业务服务管理的构建', '应用软件开发', '生产实践', '设计性', '', '1', '206', '745', null, '2017-05-10 00:00:00', '0', '1', '2016-10-13 11:33:34', '2016-10-14 09:47:11');
INSERT INTO `thesis` VALUES ('176', '1', '3', '基于秘密共享的分布式存储以及检索系统', '应用软件开发', '生产实践', '设计性', '', '1', '206', '703', null, '2017-05-10 00:00:00', '0', '1', '2016-10-13 11:35:09', '2016-10-13 11:35:09');
INSERT INTO `thesis` VALUES ('177', '1', '3', '正则表达式引擎', '应用软件开发', '生产实践', '设计性', '', '1', '206', '704', null, '2017-05-10 00:00:00', '0', '1', '2016-10-13 11:44:12', '2016-10-13 11:44:12');
INSERT INTO `thesis` VALUES ('178', '1', '3', '基于SpringMVC和Spring学生综合考评系统应用', '应用软件开发', '生产实践', '设计性', '', '1', '206', '714', null, '2017-05-10 00:00:00', '0', '1', '2016-10-13 11:45:27', '2016-10-13 11:45:27');
INSERT INTO `thesis` VALUES ('179', '1', '3', '基于SpringMVC和Mybatis的酒类采购管理子系统应用', '应用软件开发', '生产实践', '设计性', '', '1', '206', '715', null, '2017-05-10 00:00:00', '0', '1', '2016-10-13 11:46:52', '2016-10-17 11:21:22');
INSERT INTO `thesis` VALUES ('180', '1', '3', '基于SSI社区金融便民服务平台恵家新闻管理的设计与实现', '应用软件开发', '生产实践', '设计性', '', '1', '206', '865', null, '2017-05-10 00:00:00', '0', '1', '2016-10-13 11:49:33', '2016-10-13 11:49:33');
INSERT INTO `thesis` VALUES ('183', '1', '3', '基于Android安卓的森林火灾物联网管理系统设计与实现', '应用软件开发', '科研项目', '应用研究', '<p>随着物联网的兴起，用传感节点感知森林火灾比人力巡逻要有效且高效得多。在树木上部署传感节点，传感节点可将感知到的温度、湿度等重要环境参数传递给智能采集节点。这些传感数据最终保存到服务平台上去。本课题研究的是在Android安卓手机平台上设计与实现一套森林火灾物联网管理系统，可以实时查看当前森林的温度、湿度等参数，还可以收到火灾初发的预警信息并汇报火灾出现的精确位置。</p>', '1', '864', null, null, '2017-03-10 00:00:00', '0', '1', '2016-10-13 13:55:37', '2016-10-13 13:55:37');
INSERT INTO `thesis` VALUES ('185', '2', '1', '基于Web农业新闻文本的关键词抽取方法', '设计类', '导师出题', '毕业论文', '<p>用户希望每天花少量的时间从海量新闻中找到自己感兴趣的新闻进行阅读，关键词提取主要是为了从长篇新闻中抽取出能够指示新闻主题的词语，并将这些词语展示给用户，用户根据这组关键词可以快速找到感兴趣的新闻从而选择性的深入阅读。</p>', '1', '18', '71', null, '2017-05-20 00:00:00', '0', '1', '2016-10-13 14:45:01', '2016-10-13 14:45:01');
INSERT INTO `thesis` VALUES ('186', '2', '1', '基于微信公众平台的师生信息服务系统的开发与实现', '设计类', '导师出题', '毕业论文', '<p>主要搭建为信息工程系师生服务的微信公众平台，为师生之间的进一步相互了解提供交流和沟通的平台，同时为家长、学生提供了解院系信息的便捷渠道，并起到宣传院系专业文化特色的作用。</p>', '1', '18', null, null, '2017-05-20 00:00:00', '0', '1', '2016-10-13 14:45:59', '2016-10-13 14:45:59');
INSERT INTO `thesis` VALUES ('187', '2', '1', '校园二手交易系统的设计与实现', '设计类', '学生定题', '毕业论文', '<p>采用通用B/S架构实现，通过该系统可以有效实现交易网站除支付以外的各项基本功能，能满足校园二手交易线上订货、线下交易的需求。</p>', '1', '18', '38', null, '2017-05-20 00:00:00', '0', '1', '2016-10-13 14:47:45', '2016-10-13 14:47:45');
INSERT INTO `thesis` VALUES ('188', '2', '2', '基于网络流模型的快递公司运输网络优化研究', '论文类', '导师出题', '毕业论文', '<p>       随着我国经济，尤其是以网购为代表的新兴经济形式的快速发展,快递业也得到了快速的发展。在我国的快递格局已经变成了外资企业、国有企业、民营企业三足鼎立的情况。不断扩大的快递业务需求,给各种不同类型的快递企业带来了发展机遇的同时也带来了巨大的竞争压力。快递公司如果想在激烈的竞争中不被淘汰，就必须跟上市场的脚步，快速发展。这就要求快递公司不仅要保证快递产品的时效性,做到在承诺时间前准时送达，同时为了保证企业的盈利性,需要有效地控制成本。而保证时效，降低成本的重点在于构建一张快捷高效的运输网络。</p>\r\n\r\n<p>        试利用网络流等运筹学模型，通过对快递公司业务流和运输网络的抽象和计算，最终帮助快递公司在保证产品时效的情况下，最大化的降低运营成本，从而增加盈利。 </p>', '1', '19', '182', null, '2017-05-20 00:00:00', '0', '1', '2016-10-13 15:00:13', '2016-10-15 07:16:05');
INSERT INTO `thesis` VALUES ('189', '2', '1', '贫困农户的技术接受行为研究', '论文类', '导师出题', '毕业论文', '', '1', '22', '87', null, '2016-10-13 00:00:00', '0', '1', '2016-10-13 15:20:23', '2016-10-13 15:20:23');
INSERT INTO `thesis` VALUES ('190', '2', '2', '工业三废排放与工业经济增长的关系研究', '论文类', '导师课题', '毕业论文', '', '1', '22', '188', null, '2016-10-13 00:00:00', '0', '1', '2016-10-13 15:21:38', '2016-10-13 15:21:38');
INSERT INTO `thesis` VALUES ('191', '2', '2', '某工厂的设施规划研究', '论文类', '学生定题', '毕业论文', '', '1', '22', '139', null, '2016-10-13 00:00:00', '0', '1', '2016-10-13 15:22:41', '2017-10-01 17:10:14');
INSERT INTO `thesis` VALUES ('192', '2', '1', '基于微信平台的高校二手交易系统开发', '设计类', '导师出题', '毕业论文', '<p>微信开发，华农二手微信平台，技术：java后台开发，js前端，成果形式：软件系统、论文</p>', '1', '5', '32', null, '2016-10-13 00:00:00', '0', '1', '2016-10-13 15:31:47', '2016-10-16 20:19:48');
INSERT INTO `thesis` VALUES ('193', '2', '1', '电商环境下生鲜农产品消费行为分析', '论文类', '导师出题', '毕业论文', '<p>消费者网购生鲜农产品的意愿及影响因素分析；技术：问卷调查，数据分析；成果形式：论文</p>', '1', '5', '39', null, '2016-10-13 00:00:00', '0', '1', '2016-10-13 15:33:34', '2016-10-16 22:01:34');
INSERT INTO `thesis` VALUES ('194', '2', '1', '网易云音乐的市场动态与竞争对手分析', '论文类', '导师出题', '毕业论文', '<p>网易云音乐的发展动态及其竞品分析；要求的技术：用户调研问卷、数据分析；成果形式：论文</p>', '1', '5', '40', null, '2016-10-13 00:00:00', '0', '1', '2016-10-13 15:34:54', '2016-10-16 20:17:11');
INSERT INTO `thesis` VALUES ('195', '2', '1', 'O2O模式下消费者行为分析——以天猫超市为例', '论文类', '导师出题', '毕业论文', '<p>研究新兴的O2O运作模式，并以其中的成功代表——天猫超市为例，探究O2O模式对消费者行为（包括消费者对O2O行为的接受程度、在实体店的购买意愿等）产生的影响，对实体店销售和营销行为产生的影响，并分析以后的发展趋势。成果形式：论文</p>', '1', '5', '45', null, '2016-10-13 00:00:00', '0', '1', '2016-10-13 15:56:01', '2016-10-16 20:16:46');
INSERT INTO `thesis` VALUES ('196', '2', '1', '农产品电商化的用户体验研究', '论文类', '导师出题', '毕业论文', '<p>主要研究农产品电商化后用户的使用体验，分析农产品电商化的优缺点，提出改进方案。在研究分析的过程中会使用到一系列的数据分析、数据挖掘的工具，如SPSS等。成果形式：论文</p>', '1', '5', '46', null, '2016-10-13 00:00:00', '0', '1', '2016-10-13 15:56:41', '2016-10-16 20:16:26');
INSERT INTO `thesis` VALUES ('197', '2', '1', '农产品电子商务影响因素分析', '论文类', '导师出题', '毕业论文', '<p>研究内容：①分析我国电子商务发展的现状②研究促进影响其发展的主要因素③研究阻碍其发展的关键因素                          研究技术：调研分析、层次分析法、统计分析与检验、                                成果形式：基于因素分析，找出影响我国农产品电子商务发展的因素，并提出促进其发展的建议。成果形式：论文</p>', '1', '5', '50', null, '2016-10-13 00:00:00', '0', '1', '2016-10-13 15:57:21', '2016-10-16 20:16:00');
INSERT INTO `thesis` VALUES ('198', '2', '1', '基于B2C模式的农产品物流配送方案研究', '论文类', '导师出题', '毕业论文', '<p>农产品物流配送模式及发展前景，调研分析。成果形式：论文</p>', '1', '5', '51', null, '2016-10-13 00:00:00', '0', '1', '2016-10-13 15:58:04', '2016-10-16 20:15:27');
INSERT INTO `thesis` VALUES ('199', '2', '1', '电商环境下农村居民消费行为分析', '论文类', '导师出题', '毕业论文', '<p>研究内容：在国家政策的大力支持，电商巨头的推动和农村居民的参与下，我国农村电商得到快速发展，对农村居民的消费观念以及生活习惯产生潜移默化的影响。通过对电商环境下农村居民消费行为的调查分析，了解农村居民的消费需求、消费习惯与消费行为特征，分析消费过程中存在的问题，得出结论可以便于电商企业挖掘农村消费市场，为拓展中国农村电子商务消费市场提供参考性建议和策略。<br />\r\n技术：①文献分析法②问卷调查法③SPSS统计分析方法<br />\r\n成果形式：论文</p>', '1', '5', '68', null, '2016-10-13 00:00:00', '0', '1', '2016-10-13 15:58:46', '2016-10-16 20:14:53');
INSERT INTO `thesis` VALUES ('200', '2', '1', '“互联网+”环境下城镇居民有机农产品接受行为分析', '论文类', '导师出题', '毕业论文', '<p>本研究基于UTAUT（整合技术接受和使用）模型，根据互联网+农业大环境的具体特点，对城镇居民创新性、感知风险和社会影响等变量构建新的采纳模型,验证了当前环境下农业互联网结合的可行性。研究方法主要包括：文献研宄法、问卷调查法、描述性统计方法、结构方程模型等。成果形式：论文</p>', '1', '5', '88', null, '2016-10-13 00:00:00', '0', '1', '2016-10-13 15:59:29', '2016-10-16 20:14:23');
INSERT INTO `thesis` VALUES ('201', '2', '1', '城镇居民参与农产品众筹的行为分析', '论文类', '导师出题', '毕业论文', '<p>通过研究城镇居民对农产品众筹的参与现状，分析农产品众筹的市场和前景，找出制约其发展的因素。成果形式：论文</p>', '1', '5', '91', null, '2016-10-13 00:00:00', '0', '1', '2016-10-13 16:00:13', '2016-10-16 19:16:21');
INSERT INTO `thesis` VALUES ('202', '1', '3', '大型项目中CSS的组织和管理探索', '应用软件开发', '生产实践', '应用研究', '<p>大型项目中CSS的组织和管理探索&nbsp;</p>', '1', '217', '716', null, '2017-05-10 00:00:00', '0', '1', '2016-10-13 16:10:09', '2016-10-19 14:42:41');
INSERT INTO `thesis` VALUES ('203', '1', '3', '基于SSM学生综合考评系统中评奖评优子系统的开发', '应用软件开发', '生产实践', '设计性', '<p>基于SSM学生综合考评系统中评奖评优子系统的开发</p>', '1', '217', '727', null, '2017-05-10 00:00:00', '0', '1', '2016-10-13 16:12:01', '2016-10-13 16:13:30');
INSERT INTO `thesis` VALUES ('204', '2', '1', '电子期刊文献采集和分析系统', '设计类', '导师出题', '毕业论文', '', '1', '23', '86', null, '2017-04-15 00:00:00', '0', '1', '2016-10-13 16:43:08', '2016-10-13 16:56:53');
INSERT INTO `thesis` VALUES ('205', '2', '1', '广西XX地区农户农药使用行为分析', '论文类', '导师课题', '毕业论文', '', '1', '23', '89', null, '2017-04-15 00:00:00', '0', '1', '2016-10-13 16:44:29', '2016-10-13 16:44:29');
INSERT INTO `thesis` VALUES ('206', '2', '1', '基于质量安全追溯的农产品产地信息采集研究', '论文类', '导师课题', '毕业论文', '', '1', '23', '106', null, '2017-04-15 00:00:00', '0', '1', '2016-10-13 16:45:58', '2016-10-13 16:45:58');
INSERT INTO `thesis` VALUES ('207', '2', '1', '个人博客平台开发', '设计类', '学生定题', '毕业论文', '', '1', '23', '117', null, '2017-04-15 00:00:00', '0', '1', '2016-10-13 16:47:08', '2016-10-13 16:47:08');
INSERT INTO `thesis` VALUES ('208', '2', '1', '基于蔬菜质量安全的广东江门鹤山地区农户生产行为分析', '论文类', '导师课题', '毕业论文', '', '1', '23', '66', null, '2017-04-15 00:00:00', '0', '1', '2016-10-13 16:49:33', '2016-10-13 16:49:33');
INSERT INTO `thesis` VALUES ('209', '2', '1', '任务管理系统', '设计类', '学生定题', '毕业论文', '', '1', '23', '84', null, '2017-04-15 00:00:00', '0', '1', '2016-10-13 16:50:52', '2016-10-13 16:50:52');
INSERT INTO `thesis` VALUES ('210', '2', '1', 'XX农产品价格采集与预测', '论文类', '学生定题', '毕业论文', '', '1', '23', '77', null, '2017-04-15 00:00:00', '0', '1', '2016-10-13 16:52:06', '2016-10-13 16:52:06');
INSERT INTO `thesis` VALUES ('211', '2', '1', '基于农户生产行为分析的蔬菜质量安全决定模型研究', '论文类', '导师课题', '毕业论文', '', '1', '23', '47', null, '2017-04-15 00:00:00', '0', '1', '2016-10-13 16:53:00', '2016-10-13 16:53:00');
INSERT INTO `thesis` VALUES ('212', '2', '2', '基于第三方物流的农产品供应模式研究', '论文类', '导师课题', '毕业论文', '', '1', '14', '171', null, '2016-10-13 00:00:00', '0', '1', '2016-10-13 21:43:57', '2016-10-13 21:43:57');
INSERT INTO `thesis` VALUES ('213', '2', '1', '基于产品评论的情感分析研究及实现', '设计类', '导师课题', '毕业论文', '', '1', '14', '55', null, '2016-10-14 00:00:00', '0', '1', '2016-10-13 21:49:58', '2016-10-13 21:49:58');
INSERT INTO `thesis` VALUES ('214', '2', '1', '数据挖掘在股票分析中的应用', '设计类', '导师课题', '毕业论文', '', '1', '14', '49', null, '2016-10-14 00:00:00', '0', '1', '2016-10-13 21:51:30', '2016-10-13 21:51:30');
INSERT INTO `thesis` VALUES ('216', '2', '2', '绿色物流系统体系评价方法研究', '论文类', '导师课题', '毕业论文', '', '1', '14', '172', null, '2016-10-14 00:00:00', '0', '1', '2016-10-13 21:57:57', '2016-10-13 22:18:36');
INSERT INTO `thesis` VALUES ('217', '2', '2', '物联网技术在农业信息化中的应用与研究', '论文类', '导师课题', '毕业论文', '', '1', '14', '183', null, '2016-10-14 00:00:00', '0', '1', '2016-10-13 22:02:00', '2016-10-13 22:02:00');
INSERT INTO `thesis` VALUES ('218', '2', '2', '广东省生鲜农产品流通模式研究', '论文类', '导师课题', '毕业论文', '', '1', '14', '192', null, '2016-10-14 00:00:00', '0', '1', '2016-10-13 22:06:54', '2016-10-13 22:06:54');
INSERT INTO `thesis` VALUES ('222', '1', '3', '一种简单的图像分割方法', '应用软件开发', '生产实践', '基础研究', '<p>意义：</p>\r\n\r\n<p>每张照片都有不同的主题和背景，比如人物照中最关键拍摄对象是人物，有时候为了处理照片（比如删除照片中不相关的人或物），我们需要将照片的内容做一个简单分割。分割后，可以简单提取关键人物，或删除不相干内容。本题目主要研究如何实现一种简单照片分割方法。</p>\r\n\r\n<p>相关资料：</p>\r\n\r\n<p>有前期研究资料和代码做参照，需要部分编程。</p>\r\n\r\n<p>备注：</p>\r\n\r\n<p>    欢迎有兴趣的同学加入我们，请发邮件至：<a href=\"mailto:sdliangyun@163.com\">sdliangyun@163.com</a>, 手机暂时无法联系，请尽量用邮箱联系。</p>\r\n\r\n<p>    若需提前指定请尽早提出，为避免大家都选一个题目，请求指定时刻给出多个选项，比如：选择题目 （1）...；（2）...；（3）...。</p>\r\n\r\n<p>    如此，若你选择的（1）已被选中，而（2）未被选中，则将（2）指定给你；依次论推。</p>', '1', '249', '419', null, '2017-04-23 00:00:00', '0', '1', '2016-10-14 01:44:43', '2016-10-14 03:58:31');
INSERT INTO `thesis` VALUES ('223', '1', '3', '一种照片布局编辑方法研究', '应用软件开发', '生产实践', '基础研究', '<p>意义：</p>\r\n\r\n<p>  为达到最佳的摄影效果（比如：避免逆光，避免照片的关键人物被遮挡等），人们有时候拍摄的照片并不理想，比如：人物太小背景太大，人物偏重于某一侧，照片地面背景过多等。你知道吗，其实摄影是美学根据的，但现实的约束常使照片无法达到这些美学要求（比如三分线法则）。因此，对照片进行后编辑处理是有必要的。本题目的目的是通过识别照片中的关键区域（如人脸等，这部分可以根据已有成果直接使用），然后做一些简单的距离计算，在对图像进行简单裁剪，就可以使照片更漂亮一点。其实，有些照片编辑软件，有类似的自动功能，但不如人为的交互操作更准确。所以，我们希望能够做出一个简单、人为鼠标点击交互的图像布局方法。</p>\r\n\r\n<p>相关资料：</p>\r\n\r\n<p>  我们的前期研究成果中，有相关代码和资料供参考，需要部分编程。</p>\r\n\r\n<p>备注：</p>\r\n\r\n<p>   欢迎有兴趣的同学加入我们，请发邮件至：<a href=\"mailto:sdliangyun@163.com\">sdliangyun@163.com</a>, 手机暂时无法联系，请尽量用邮箱联系。</p>\r\n\r\n<p>    若需提前指定请尽早提出，为避免大家都选一个题目，请求指定时刻给出多个选项，比如：选择题目 （1）...；（2）...；（3）...。</p>\r\n\r\n<p>    如此，若你选择的（1）已被选中，而（2）未被选中，则将（2）指定给你；依次论推。</p>', '1', '249', '496', null, '2017-04-23 00:00:00', '0', '1', '2016-10-14 01:58:42', '2016-10-19 12:57:28');
INSERT INTO `thesis` VALUES ('224', '1', '3', '照片重要区域的识别方法研究', '应用软件开发', '生产实践', '应用研究', '<p>意义：</p>\r\n\r\n<p>&nbsp;&nbsp; 每张照片都应该有自己的主题，否则这张照片属于拍摄失败的作品。</p>\r\n\r\n<p>&nbsp;&nbsp;&nbsp; 照片的主题应该是它的重要区域，如何在拍照完成后让相机自动识别出重要区域呢？</p>\r\n\r\n<p>&nbsp;&nbsp;&nbsp; 虽然，有人认为拍摄时的定焦区域，一定程度上应该是重要区域。但实际上，因光照不通，背景干扰等，常出现背景比主题更突出的情况，导致摄像失败。</p>\r\n\r\n<p>&nbsp;&nbsp;&nbsp; 本题目，通过利用一定的基础理论（比如：人眼关注区域等），意图设计能够自动识别重要区域的方法。可以不用做到准确识别，只是给出大致范围和区域即可。</p>\r\n\r\n<p>相关资料：</p>\r\n\r\n<p>&nbsp;&nbsp;&nbsp; 我们的前期研究，有相关代码和资料的积累，可供参考，需要部分编程，语言不限</p>\r\n\r\n<p>备注：&nbsp;&nbsp;</p>\r\n\r\n<p>&nbsp;&nbsp;&nbsp; 欢迎有兴趣的同学加入我们，请发邮件至：<a href=\"mailto:sdliangyun@163.com\">sdliangyun@163.com</a>, 手机暂时无法联系，请尽量用邮箱联系。</p>\r\n\r\n<p>&nbsp;&nbsp;&nbsp; 若需提前指定请尽早提出，为避免大家都选一个题目，请求指定时刻给出多个选项，比如：选择题目 （1）...；（2）...；（3）...。</p>\r\n\r\n<p>&nbsp;&nbsp;&nbsp; 如此，若你选择的（1）已被选中，而（2）未被选中，则将（2）指定给你；依次论推。</p>', '1', '249', null, null, '2017-04-23 00:00:00', '0', '1', '2016-10-14 02:03:23', '2016-10-14 03:51:28');
INSERT INTO `thesis` VALUES ('225', '1', '3', '广陈皮药用部位的三维重建研究', '计算机图形学', '科研项目', '基础研究', '<p>研究广陈皮药用部位的三维重建</p>', '1', '241', '296', null, '2017-04-30 00:00:00', '0', '1', '2016-10-14 02:17:07', '2016-10-16 13:20:30');
INSERT INTO `thesis` VALUES ('226', '1', '3', '照片对称区域的匹配算法', '应用软件开发', '科研项目', '基础研究', '<p>意义：</p>\r\n\r\n<p>&nbsp;&nbsp; 照片的对称性是影响其美感的重要因素。比如：拍照后，人物太靠一侧了，显得头重脚轻；相机拿的不够平，导致照片歪歪斜斜。</p>\r\n\r\n<p>&nbsp;&nbsp; 如何衡量一张照片的对称性呢，通常可以找照片中对称区域的分布。现在已经有一些成熟的对称区域检测方法。</p>\r\n\r\n<p>&nbsp;&nbsp; 本题目的研究目的是 利用已有的对称区域检测方法，将检测出的区域进行配对，配对依据比较简单可以根据面积大小、距离远近等，最终实现对称区域的匹配。</p>\r\n\r\n<p>&nbsp;&nbsp; 其中，对称区域的寻找通过调用现有方法即可，主要完成匹配工作。</p>\r\n\r\n<p>相关资料：</p>\r\n\r\n<p>&nbsp;&nbsp;&nbsp;&nbsp; 我们的前期研究中，有相关资料和代码的积累，可供参考，只需部分编程。</p>\r\n\r\n<p>备注：&nbsp;&nbsp;&nbsp;</p>\r\n\r\n<p>&nbsp;&nbsp;&nbsp; 欢迎有兴趣的同学加入我们，请发邮件至：<a href=\"mailto:sdliangyun@163.com\">sdliangyun@163.com</a>, 手机暂时无法联系，请尽量用邮箱联系。</p>\r\n\r\n<p>&nbsp;&nbsp;&nbsp; 若需提前指定请尽早提出，为避免大家都选一个题目，请求指定时刻给出多个选项，比如：选择题目 （1）...；（2）...；（3）...。</p>\r\n\r\n<p>&nbsp;&nbsp;&nbsp; 如此，若你选择的（1）已被选中，而（2）未被选中，则将（2）指定给你；依次论推。</p>', '1', '249', '574', null, '2017-04-23 00:00:00', '0', '1', '2016-10-14 02:29:03', '2016-10-14 03:50:55');
INSERT INTO `thesis` VALUES ('227', '1', '3', '照片相似性度量方法研究', '应用软件开发', '生产实践', '应用研究', '<p>意义：</p>\r\n\r\n<p>&nbsp;&nbsp; 在人物照片拍摄时，我比较喜欢用连拍，这样可以在若干秒的连续拍摄中，找到最佳表情、最佳光照等效果。</p>\r\n\r\n<p>&nbsp;&nbsp; 现在有些相机可以从序列照片中，自动选择最佳或次佳的照片。但被选中的照片常非常类似。因此，本题目主要通过对比两张照片，计算出其相似性。</p>\r\n\r\n<p>&nbsp;&nbsp; 相似性的计算在理论上比较简单，通过局部小分块的颜色差异实现，所以编程难度不大。</p>\r\n\r\n<p>相关资料：</p>\r\n\r\n<p>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; 我们的前期研究中，已积累相关资料和代码，可供参考，需要实现部分代码，语言不限。</p>\r\n\r\n<p>备注：&nbsp;&nbsp;&nbsp;&nbsp;</p>\r\n\r\n<p>&nbsp;&nbsp;&nbsp; 欢迎有兴趣的同学加入我们，请发邮件至：<a href=\"mailto:sdliangyun@163.com\">sdliangyun@163.com</a>, 手机暂时无法联系，请尽量用邮箱联系。</p>\r\n\r\n<p>&nbsp;&nbsp;&nbsp; 若需提前指定请尽早提出，为避免大家都选一个题目，请求指定时刻给出多个选项，比如：选择题目 （1）...；（2）...；（3）...。</p>\r\n\r\n<p>&nbsp;&nbsp;&nbsp; 如此，若你选择的（1）已被选中，而（2）未被选中，则将（2）指定给你；依次论推。</p>', '1', '249', '634', null, '2017-04-23 00:00:00', '0', '1', '2016-10-14 02:56:21', '2016-10-14 03:50:25');
INSERT INTO `thesis` VALUES ('228', '1', '3', 'B超图像分割方法综述研究', '应用软件开发', '生产实践', '应用研究', '<p>意义：</p>\r\n\r\n<p>&nbsp;&nbsp;&nbsp; B超图像和一般的黑白图像比较相似。虽然，图像生成方法上有一定的区别。</p>\r\n\r\n<p>&nbsp;&nbsp;&nbsp; 对B超图像的分割和分析，一直是医学领域的研究热点。</p>\r\n\r\n<p>&nbsp;&nbsp;&nbsp; 当前已经存在大量B超图像的分割方法，但这些方法之间各有所长，有时又相互补充。</p>\r\n\r\n<p>&nbsp;&nbsp;&nbsp; 因此，本题目的研究价值在于：通过调用现有B超图像的分割方法，对大量B超图像进行分割。然后，分析分割结果的理想程度，汇总和分类这些分割方法的优劣，分析它们最佳。</p>\r\n\r\n<p>相关资料：</p>\r\n\r\n<p>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; 我们的前期研究有部分代码和资料积累，可供参考。</p>\r\n\r\n<p>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; 本课题的编程要求较少，但要求认真和细致的进行资料汇总和分析。</p>\r\n\r\n<p>备注：&nbsp;&nbsp;&nbsp;</p>\r\n\r\n<p>&nbsp;&nbsp;&nbsp;&nbsp; 欢迎有兴趣的同学加入我们，请发邮件至：<a href=\"mailto:sdliangyun@163.com\">sdliangyun@163.com</a>, 手机暂时无法联系，请尽量用邮箱联系。</p>\r\n\r\n<p>&nbsp;&nbsp;&nbsp; 若需提前指定请尽早提出，为避免大家都选一个题目，请求指定时刻给出多个选项，比如：选择题目 （1）...；（2）...；（3）...。</p>\r\n\r\n<p>&nbsp;&nbsp;&nbsp; 如此，若你选择的（1）已被选中，而（2）未被选中，则将（2）指定给你；依次论推。</p>', '1', '249', null, null, '2017-04-23 00:00:00', '0', '1', '2016-10-14 03:02:21', '2016-10-14 03:50:01');
INSERT INTO `thesis` VALUES ('229', '1', '3', '图像显著边缘的检测方法研究', '应用软件开发', '生产实践', '应用研究', '<p>意义：</p>\r\n\r\n<p>&nbsp;&nbsp;&nbsp; 照片中的物体轮廓，是物体的重要信息。如果能够将主要轮廓提取出来，我们可以生成一张照片的素描画。</p>\r\n\r\n<p>&nbsp;&nbsp;&nbsp;&nbsp; 试想想，如果在某个景点拍了一张很不错的照片，马上可以生成它的素描，其实是挺有意思的，对吗？</p>\r\n\r\n<p>&nbsp;&nbsp;&nbsp; 但现有的很多图像边缘检测方法，都各有千秋，有些适合风景照，有些适合人物照，有些适合光照比较充足时的照片。</p>\r\n\r\n<p>&nbsp;&nbsp;&nbsp;&nbsp; 通过分析现有的边缘检测方法（可以利用已有代码），试图分析或构造一种合理的图像边缘检测方法，是很有价值的研究。</p>\r\n\r\n<p>&nbsp;&nbsp; 我们可以通过考虑边缘的长度、相邻边缘的关系等进行构造，算法复杂度不高，但需要部分编程。</p>\r\n\r\n<p>相关资料：</p>\r\n\r\n<p>&nbsp;&nbsp;&nbsp;&nbsp; 我们的前期研究，有相关资料和代码可供参考，需要部分编程。</p>\r\n\r\n<p>备注：&nbsp;&nbsp;</p>\r\n\r\n<p>&nbsp;&nbsp;&nbsp; 欢迎有兴趣的同学加入我们，请发邮件至：<a href=\"mailto:sdliangyun@163.com\">sdliangyun@163.com</a>, 手机暂时无法联系，请尽量用邮箱联系。</p>\r\n\r\n<p>&nbsp;&nbsp;&nbsp; 若需提前指定请尽早提出，为避免大家都选一个题目，请求指定时刻给出多个选项，比如：选择题目 （1）...；（2）...；（3）...。</p>\r\n\r\n<p>&nbsp;&nbsp;&nbsp; 如此，若你选择的（1）已被选中，而（2）未被选中，则将（2）指定给你；依次论推。</p>', '1', '249', null, null, '2017-04-23 00:00:00', '0', '1', '2016-10-14 03:22:24', '2016-10-14 03:49:32');
INSERT INTO `thesis` VALUES ('230', '1', '3', '简单物体跟踪方法研究', '应用软件开发', '科研项目', '应用研究', '<p>意义：</p>\r\n\r\n<p>&nbsp;&nbsp;&nbsp;&nbsp; 跟踪视频中的运动物体是视频处理的研究热点，具有重要应用价值，比如：无人机导航，自动驾驶控制、视频监控报警等。</p>\r\n\r\n<p>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; 但如何准确跟踪是人们关注的焦点。目前已经有一些不错的跟踪方法，可是它们也是各有所长。</p>\r\n\r\n<p>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; 本题目试图通过分析现有一种跟踪方法，找出其不足，分析问题所在，并编写少量代码验证一下，实现简单的物体跟踪。</p>\r\n\r\n<p>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; 代码复杂度不高，但需要对视频处理感兴趣</p>\r\n\r\n<p>相关资料：</p>\r\n\r\n<p>&nbsp;&nbsp;&nbsp;&nbsp; 可以提供供参考的物体跟踪方法的代码和资料。</p>\r\n\r\n<p>备注：</p>\r\n\r\n<p>&nbsp;&nbsp;&nbsp;&nbsp;欢迎有兴趣的同学加入我们，请发邮件至：<a href=\"mailto:sdliangyun@163.com\">sdliangyun@163.com</a>, 手机暂时无法联系，请尽量用邮箱联系。</p>\r\n\r\n<p>&nbsp;&nbsp;&nbsp; 若需提前指定请尽早提出，为避免大家都选一个题目，请求指定时刻给出多个选项，比如：选择题目 （1）...；（2）...；（3）...。</p>\r\n\r\n<p>&nbsp;&nbsp;&nbsp; 如此，若你选择的（1）已被选中，而（2）未被选中，则将（2）指定给你；依次论推。</p>\r\n\r\n<p>&nbsp;</p>', '1', '249', null, null, '2017-04-23 00:00:00', '0', '1', '2016-10-14 03:26:48', '2016-10-14 03:48:57');
INSERT INTO `thesis` VALUES ('231', '1', '3', '物体运动轨迹分析研究', '应用软件开发', '科研项目', '应用研究', '<p>意义：</p>\r\n\r\n<p>&nbsp;&nbsp; 视频中物体的运动轨迹具有重要意义，常可以得出某种规律。比如：当一个人的运动轨迹在不停重复出现时，说明他在循环处理某件事；当动物的轨迹突变时，说明它可能受到了惊吓。</p>\r\n\r\n<p>&nbsp;&nbsp;&nbsp;本课题预计根据现有跟踪方法，统计每一帧的跟踪结果，绘制出运动轨迹，并进行简单的运动速度和方向的分析。</p>\r\n\r\n<p>&nbsp;&nbsp; 跟踪方法已经有现存代码，可以直接调用。轨迹统计只需根据物体的中心的坐标变化即可实现，算法复杂度低，但需要</p>\r\n\r\n<p>相关资料：</p>\r\n\r\n<p>&nbsp;&nbsp;&nbsp;&nbsp; 我们前期研究中，已积累了物体跟踪方法的代码，可直接使用。只需编程统计轨迹变化即可。</p>\r\n\r\n<p>备注：&nbsp;&nbsp;&nbsp;&nbsp;</p>\r\n\r\n<p>&nbsp; 欢迎有兴趣的同学加入我们，请发邮件至：<a href=\"mailto:sdliangyun@163.com\">sdliangyun@163.com</a>, 手机暂时无法联系，请尽量用邮箱联系。</p>\r\n\r\n<p>&nbsp;&nbsp;&nbsp; 若需提前指定请尽早提出，为避免大家都选一个题目，请求指定时刻给出多个选项，比如：选择题目 （1）...；（2）...；（3）...。</p>\r\n\r\n<p>&nbsp;&nbsp;&nbsp; 如此，若你选择的（1）已被选中，而（2）未被选中，则将（2）指定给你；依次论推。&nbsp;</p>', '1', '249', '564', null, '2017-04-23 00:00:00', '0', '1', '2016-10-14 03:32:05', '2016-10-14 03:48:25');
INSERT INTO `thesis` VALUES ('232', '1', '3', '交互式运动物体的识别方法', '应用软件开发', '科研项目', '应用研究', '<p>意义：</p>\r\n\r\n<p>&nbsp;&nbsp;识别视频的运动物体是视频处理的关键，具有重要应用价值，可用于国内外当前视觉领域的研究热点，如：无人机导航、自动驾驶&nbsp;&nbsp;、视频监控预警等。</p>\r\n\r\n<p>&nbsp; 本题目，预计通过调用现有的跟踪方法，引入人为的指引，提高跟踪的准确性。</p>\r\n\r\n<p>&nbsp;&nbsp; 需要编程部分为：提供一个简单的交互接口，通过鼠标选中矩形框覆盖目标物体，然后简单分析一下跟踪结果的好坏。</p>\r\n\r\n<p>&nbsp;&nbsp;&nbsp; 算法复杂度不高，但需要对视频编辑有兴趣。</p>\r\n\r\n<p>相关资料：</p>\r\n\r\n<p>&nbsp;&nbsp;&nbsp; 我们前期研究中，已经积累了相关代码和方法，可供</p>\r\n\r\n<p>备注：&nbsp; &nbsp;&nbsp;</p>\r\n\r\n<p>&nbsp;&nbsp;&nbsp; 欢迎有兴趣的同学加入我们，请发邮件至：<a href=\"mailto:sdliangyun@163.com\">sdliangyun@163.com</a>, 手机暂时无法联系，请尽量用邮箱联系。</p>\r\n\r\n<p>&nbsp;&nbsp;&nbsp; 若需提前指定请尽早提出，为避免大家都选一个题目，请求指定时刻给出多个选项，比如：选择题目 （1）...；（2）...；（3）...。</p>\r\n\r\n<p>&nbsp;&nbsp;&nbsp; 如此，若你选择的（1）已被选中，而（2）未被选中，则将（2）指定给你；依次论推。</p>', '1', '249', null, null, '2017-04-23 00:00:00', '0', '1', '2016-10-14 03:33:06', '2016-10-14 03:47:00');
INSERT INTO `thesis` VALUES ('233', '1', '3', '一种运动物体的分割方法', '应用软件开发', '科研项目', '应用研究', '<p>意义：</p>\r\n\r\n<p>&nbsp;&nbsp; 通过识别视频中的运动物体，并将其分割出来，是视频编辑的重要研究内容。</p>\r\n\r\n<p>&nbsp;&nbsp; 可以将切割出的物体，粘贴到新的背景上，形成新的视频效果。比如：将一只蝴蝶飞过花丛，切割出蝴蝶粘贴到雪山背景视频，可构造出一只蝴蝶飞跃喜马拉雅。</p>\r\n\r\n<p>&nbsp;&nbsp; 本题目有参考代码实现，可在此代码上做简单拓展和分析。需要对视频编辑感兴趣的同学。</p>\r\n\r\n<p>相关资料：</p>\r\n\r\n<p>&nbsp;&nbsp;&nbsp; 我们的前期研究资料已经有部分代码积累，可供参考。</p>\r\n\r\n<p>备注：</p>\r\n\r\n<p>&nbsp;&nbsp; 欢迎有兴趣的同学加入我们，请发邮件至：<a href=\"mailto:sdliangyun@163.com\">sdliangyun@163.com</a>, 手机暂时无法联系，请尽量用邮箱联系。</p>\r\n\r\n<p>&nbsp;&nbsp;&nbsp; 若需提前指定请尽早提出，为避免大家都选一个题目，请求指定时刻给出多个选项，比如：选择题目 （1）...；（2）...；（3）...。</p>\r\n\r\n<p>&nbsp;&nbsp;&nbsp; 如此，若你选择的（1）已被选中，而（2）未被选中，则将（2）指定给你；依次论推。</p>\r\n\r\n<p>&nbsp;</p>', '1', '249', null, null, '2017-04-23 00:00:00', '0', '1', '2016-10-14 03:41:04', '2016-10-14 03:43:57');
INSERT INTO `thesis` VALUES ('235', '1', '3', '计算思维教学案例库设计与实现', '应用软件开发', '其他', '应用研究', '<p>计算思维是指运用计算机科学的基础概念进行问题求解、系统设计，以及人类行为理解的涵盖计算机科学之广度的一系列思维活动。计算机教育界已明确提出&ldquo;计算思维能力的培养&rdquo;作为计算机基础教学的核心任务。要落实计算思维教学必需通过具体的案例将计算思维的概念实例化。</p>\r\n\r\n<p>&nbsp;&nbsp;&nbsp; 本毕业设计要求针对学生的专业背景设计出具有专业特色的教学案例。</p>\r\n\r\n<p>&nbsp;&nbsp;&nbsp; 本题目难度不大，资料也较为丰富，编程工作量较小。关键工作是材料的分析与组织，要求学生学过算法设计与分析，并有较强的相关实践能力。</p>', '1', '234', '549', null, '2017-04-23 00:00:00', '0', '1', '2016-10-14 09:26:07', '2016-10-14 09:26:07');
INSERT INTO `thesis` VALUES ('236', '1', '3', '球类学习网站设计与开发', '应用软件开发', '其他', '基础研究', '<p> </p>\r\n\r\n<p><span style=\"color:black\">(1) </span><span style=\"color:black\">简介：移动学习已经成为信息技术专家研究的热点，国内移动教育游戏仍然处于初级阶段，具有良好的开发价值。Android是一种以Linux为基础的开放源代码操作系统，主要使用于便携设备。</span></p>\r\n\r\n<p><span style=\"color:black\">(2) </span><span style=\"color:black\">要求:开发基于Android系统的学习应用程序。</span></p>\r\n\r\n<p><span style=\"color:black\">(3) </span><span style=\"color:black\">所需具备的基础:JAVA</span></p>', '1', '234', null, null, '2017-04-23 00:00:00', '0', '1', '2016-10-14 09:27:54', '2016-10-19 15:28:35');
INSERT INTO `thesis` VALUES ('237', '1', '3', '基于AI的游戏软件研究与实现', '应用软件开发', '其他', '基础研究', '<p>&nbsp;</p>\r\n\r\n<p>(1) 简介：AI即Artificial Intelligence的缩写，是人脑模拟和机器智能相结合的高尖端科学技术, AI的出现赋予了网络游戏中角色智商，大大地增加了网络游戏的可玩性。</p>\r\n\r\n<p>(2) 要求:从人工智能技术的原理出发,结合游戏开发的实际问题,从现存的人工智能技术中寻找适合在游戏中使用的成熟AI技术,并对这些技术在项目中的实际应用情况进行试验和研究。</p>\r\n\r\n<p>(3) 所需具备的基础:C或者Java基础&nbsp; 人工智能&nbsp;&nbsp; 有编程的兴趣爱好</p>', '1', '234', '548', null, '2017-04-23 00:00:00', '0', '1', '2016-10-14 09:31:22', '2016-10-14 09:31:22');
INSERT INTO `thesis` VALUES ('238', '1', '3', '基于Ajax的迎新系统中考勤与年度考核模拟子系统的实现', '应用软件开发', '科研项目', '基础研究', '<p>关键词：AJAX 考勤</p>', '1', '216', '767', null, '2017-04-10 00:00:00', '0', '1', '2016-10-14 09:39:15', '2016-10-18 20:11:05');
INSERT INTO `thesis` VALUES ('239', '1', '3', '基于nodejs和mongodb的写作阅读平台用户管理子系统开发', '应用软件开发', '科研项目', '基础研究', '', '1', '216', '768', null, '2017-04-10 00:00:00', '0', '1', '2016-10-14 09:40:04', '2016-10-18 20:10:41');
INSERT INTO `thesis` VALUES ('240', '1', '3', '校友管理网站设计与实现', '应用软件开发', '其他', '基础研究', '<p>设计一个网站，管理校友信息和以邮件方式推送学校一个月发生的重要事情的网页链接，如果校友感兴趣可以点击查看。要求对校友的个人信息一方面要进行隐私方面保护；另一方面又要能够促进校友间的交流.</p>', '1', '234', '554', null, '2017-04-23 00:00:00', '0', '1', '2016-10-14 09:40:22', '2016-10-14 09:40:22');
INSERT INTO `thesis` VALUES ('241', '1', '3', '基于WebSocket实现实时通信及消息推送', '应用软件开发', '科研项目', '基础研究', '', '1', '216', '774', null, '2017-04-10 00:00:00', '0', '1', '2016-10-14 09:40:44', '2016-10-18 20:09:31');
INSERT INTO `thesis` VALUES ('242', '1', '3', '基于SpringMVC的隧道掘进系统中物资管理子系统的开发', '应用软件开发', '科研项目', '基础研究', '', '1', '216', '775', null, '2017-04-10 00:00:00', '0', '1', '2016-10-14 09:41:33', '2016-10-18 20:08:50');
INSERT INTO `thesis` VALUES ('243', '1', '3', '基于SpringMVC和Mybatis货运物流信息管理系统的实现', '应用软件开发', '科研项目', '基础研究', '', '1', '216', '777', null, '2017-04-10 00:00:00', '0', '1', '2016-10-14 09:42:22', '2016-10-18 20:08:14');
INSERT INTO `thesis` VALUES ('244', '1', '3', '基于EasyUI的游客流量监测系统中游客行为分析子系统的实现', '应用软件开发', '科研项目', '基础研究', '', '1', '216', '778', null, '2017-04-10 00:00:00', '0', '1', '2016-10-14 09:42:53', '2016-10-18 20:07:44');
INSERT INTO `thesis` VALUES ('245', '1', '3', '物流信息系统的项目系统管理子系统的实现', '应用软件开发', '科研项目', '基础研究', '', '1', '216', '782', null, '2017-04-10 00:00:00', '0', '1', '2016-10-14 09:43:29', '2016-10-18 20:07:04');
INSERT INTO `thesis` VALUES ('247', '1', '3', '基于Vaadin的全堆栈Java Web开发', '应用软件开发', '科研项目', '基础研究', '', '1', '216', '791', null, '2017-04-10 00:00:00', '0', '1', '2016-10-14 09:44:44', '2016-10-18 20:06:17');
INSERT INTO `thesis` VALUES ('248', '1', '3', '基于SpringMVC的迎新管理系统中扩展子系统的开发', '应用软件开发', '科研项目', '基础研究', '', '1', '216', '792', null, '2017-04-10 00:00:00', '0', '1', '2016-10-14 09:45:26', '2016-10-18 20:05:42');
INSERT INTO `thesis` VALUES ('249', '1', '3', '博达易贷业务管理系统', '应用软件开发', '科研项目', '基础研究', '', '1', '216', '793', null, '2017-04-10 00:00:00', '0', '1', '2016-10-14 09:45:57', '2016-10-18 20:04:40');
INSERT INTO `thesis` VALUES ('250', '1', '3', '基于angularJS、NodeJS和mongoDB的高校迎新系统中内容管理子系统应用', '应用软件开发', '生产实践', '基础研究', '', '1', '216', '794', null, '2017-04-10 00:00:00', '0', '1', '2016-10-14 09:46:33', '2016-10-18 20:03:40');
INSERT INTO `thesis` VALUES ('251', '1', '3', '图书馆管理系统', '应用软件开发', '其他', '设计性', '<p>该图书馆管理系统需要完成如下工作：</p>\r\n\r\n<p>（1）&nbsp;借书、还书和预约</p>\r\n\r\n<p>每个账号限定接15本书，只能预约2本书，逾期不还书不能借书。对过期未还图书的读者进行罚款处理</p>\r\n\r\n<p>（2）&nbsp;按书名或作者，编号，查询图书&nbsp;，模糊查询。</p>\r\n\r\n<p>（3）&nbsp;账号有管理员账号，有读者账号，管理员可以增删图书，管理读者账号，可以查询图书借阅的信息。读者账号可以在线借阅图书，借阅后图书馆为其保留一天，一天不来拿，则取消借阅，读者还可以在归还图书后评论该书，或者推荐该书，推荐数越多，显示的越靠前。</p>\r\n\r\n<p>（4）&nbsp;读者可以在线注册账号。管理员账号是内部添加，不可注册。</p>', '1', '217', '446', null, '2017-05-20 00:00:00', '0', '1', '2016-10-14 09:59:22', '2016-10-14 09:59:22');
INSERT INTO `thesis` VALUES ('252', '1', '3', '大学课程在线题库的设计与实现', '应用软件开发', '教学改革项目', '设计性', '<p>大学课程在线题库的设计与实现</p>', '1', '217', '521', null, '2017-05-20 00:00:00', '0', '1', '2016-10-14 10:08:48', '2016-10-14 10:08:48');
INSERT INTO `thesis` VALUES ('253', '1', '3', '基于Bootstrap的迎新系统中宿舍与权限管理子系统的实现', '应用软件开发', '生产实践', '应用研究', '<p>201330340213</p>', '1', '259', '717', null, '2017-04-15 00:00:00', '0', '1', '2016-10-14 10:24:06', '2016-10-14 18:26:18');
INSERT INTO `thesis` VALUES ('254', '1', '3', '精准扶贫信息化平台中精确识别子系统的看开发', '应用软件开发', '生产实践', '应用研究', '<p>精准扶贫信息化平台中精确识别子系统的看开发</p>', '1', '259', '718', null, '2017-04-15 00:00:00', '0', '1', '2016-10-14 10:25:04', '2016-10-14 18:26:53');
INSERT INTO `thesis` VALUES ('255', '1', '3', '基于MyBits的超市进销存系统的实现', '应用软件开发', '生产实践', '应用研究', '<p>基于MyBits的超市进销存系统的实现</p>', '1', '259', '732', null, '2017-04-10 00:00:00', '0', '1', '2016-10-14 10:26:24', '2016-10-15 10:27:07');
INSERT INTO `thesis` VALUES ('256', '1', '3', '基于SSH框架的社情民意系统信息管理子系统的设计实现', '应用软件开发', '科研项目', '基础研究', '<p>基于SSH框架的社情民意系统信息管理子系统的设计实现</p>', '1', '259', '735', null, '2017-04-15 00:00:00', '0', '1', '2016-10-14 10:28:43', '2016-10-14 18:27:39');
INSERT INTO `thesis` VALUES ('257', '1', '3', '基于SpringMVC的企业销售管理子系统的实现', '应用软件开发', '生产实践', '应用研究', '<p>1、基于SpringMVC，Spring，Mybatis技术，实现企业销售管理系统；<br />\r\n2、根据订单对生产流程优化排程，使企业能够根据实际状况合理地利用各项资源安排生产，综合考虑企业的主生产计划、实际库存、预计接收量和已分配量，其中预计接收量包括采购在途和生产在制等，通过计算得到各种物料的需求时间和需求数量，并最终得到生产计划和采购计划等，直接指导企业的采购和生产。<br />\r\n3、本模块提供丰富的查询统计和分析功能，以便管理者可以对决定企业效益的部分进行有效控制。<br />\r\n4、可以按天、月、年统计销售收入、销售毛利汇总明细报表、销售年报表。<br />\r\n按日、月、年进行货品销售金额排行、货品销售毛利排行、货品销售数量排行、往来单位销售金额排行、日销售总毛利等。<br />\r\n还需提供按客户和按合同号查询生产情况。</p>\r\n\r\n<p> </p>', '1', '259', '737', null, '2017-04-15 00:00:00', '0', '1', '2016-10-14 10:29:26', '2016-10-15 10:24:00');
INSERT INTO `thesis` VALUES ('258', '1', '3', '额度控制系统的测试与重构', '应用软件开发', '生产实践', '应用研究', '<p>额度控制系统的测试与重构</p>', '1', '259', '527', null, '2017-04-15 00:00:00', '0', '1', '2016-10-14 10:56:30', '2016-10-14 18:48:16');
INSERT INTO `thesis` VALUES ('259', '1', '3', '基于SSH框架的财务系统报表', '应用软件开发', '科研项目', '基础研究', '<p>基于SSH框架的财务系统报表</p>', '1', '259', '438', null, '2017-04-15 00:00:00', '0', '1', '2016-10-14 11:04:47', '2016-10-14 18:47:48');
INSERT INTO `thesis` VALUES ('260', '1', '3', '食用农产品的溯源系统', '应用软件开发', '科研项目', '基础研究', '<p>使用农产品的溯源系统</p>', '1', '259', '411', null, '2017-04-10 00:00:00', '0', '1', '2016-10-14 11:06:08', '2016-10-14 15:12:20');
INSERT INTO `thesis` VALUES ('261', '1', '3', '食用农产品的溯源分析与设计', '应用软件开发', '科研项目', '应用研究', '<p>使用农产品的溯源分析与设计</p>', '1', '259', '414', null, '2017-04-10 00:00:00', '0', '1', '2016-10-14 11:07:20', '2016-10-14 15:14:19');
INSERT INTO `thesis` VALUES ('262', '1', '3', '测试报告系统', '应用软件开发', '生产实践', '应用研究', '<p><!--StartFragment -->建立一个测试报告管理系统，能管理缺陷，追踪缺陷，使得测试流程信息化，规范化。</p>', '1', '259', '408', null, '2017-04-15 00:00:00', '0', '1', '2016-10-14 11:08:59', '2016-10-19 21:26:10');
INSERT INTO `thesis` VALUES ('263', '1', '3', '个人博客', '应用软件开发', '科研项目', '基础研究', '<p>个人博客</p>', '1', '259', '838', null, '2017-04-15 00:00:00', '0', '1', '2016-10-14 11:35:22', '2016-10-14 18:45:56');
INSERT INTO `thesis` VALUES ('264', '1', '3', '格式化文档管理系统', '应用软件开发', '科研项目', '基础研究', '<p>格式化文档管理系统</p>', '1', '259', '867', null, '2017-04-15 00:00:00', '0', '1', '2016-10-14 11:35:53', '2016-10-18 17:53:42');
INSERT INTO `thesis` VALUES ('266', '1', '3', '基于SSH框架的物流管理系统', '应用软件开发', '生产实践', '应用研究', '<p>使用Eclipse作为开发环境，后台使用Mysql数据库搭建，基于SSH框架，使用Java语言开发一个物流管理系统，实现物流管理，配送管理等功能。</p>', '1', '237', '453', null, '2017-04-20 00:00:00', '0', '1', '2016-10-14 13:17:39', '2016-10-18 18:31:00');
INSERT INTO `thesis` VALUES ('267', '1', '3', '企业员工考勤管理系统', '应用软件开发', '生产实践', '应用研究', '<p>使用Eclipse作为开发环境，后台使用Mysql数据库搭建，基于SSH框架，自选语言开发一个企业员工管理系统。</p>', '1', '237', '480', null, '2017-04-20 00:00:00', '0', '1', '2016-10-14 13:24:24', '2016-10-19 12:29:12');
INSERT INTO `thesis` VALUES ('268', '1', '3', '租车管理系统', '应用软件开发', '生产实践', '应用研究', '<p>实现租车管理系统，包括车辆管理，租赁管理，司机管理等功能。</p>', '1', '237', '368', null, '2017-04-20 00:00:00', '0', '1', '2016-10-14 13:26:53', '2016-10-18 21:12:37');
INSERT INTO `thesis` VALUES ('269', '1', '3', '代驾预约管理系统', '应用软件开发', '生产实践', '应用研究', '<p>包括来电管理，订单管理，客户管理，派工管理，信誉管理等功能</p>', '1', '237', '324', null, '2017-04-20 00:00:00', '0', '1', '2016-10-14 13:31:55', '2016-10-14 13:31:55');
INSERT INTO `thesis` VALUES ('270', '1', '3', 'Android平台下的个人事务管理系统', '应用软件开发', '生产实践', '应用研究', '<p>实现个人目标管理，个人事务备忘管理，个人事务提醒管理等功能</p>', '1', '237', '641', null, '2017-04-20 00:00:00', '0', '1', '2016-10-14 13:35:03', '2016-10-14 13:35:03');
INSERT INTO `thesis` VALUES ('271', '1', '3', 'Android平台下的个人记账管理系统', '应用软件开发', '生产实践', '应用研究', '', '1', '237', '490', null, '2017-04-20 00:00:00', '0', '1', '2016-10-14 13:35:56', '2016-10-19 10:48:11');
INSERT INTO `thesis` VALUES ('272', '1', '3', '旅行游记APP开发', '应用软件开发', '生产实践', '应用研究', '', '1', '237', '642', null, '2017-04-20 00:00:00', '0', '1', '2016-10-14 13:36:56', '2016-10-14 13:36:56');
INSERT INTO `thesis` VALUES ('273', '1', '3', '汽车分时租赁系统的应用', '应用软件开发', '生产实践', '基础研究', '<p>汽车分时租赁系统的应用</p>', '1', '263', '425', null, '2017-04-15 00:00:00', '0', '1', '2016-10-14 13:59:17', '2016-10-14 13:59:17');
INSERT INTO `thesis` VALUES ('274', '1', '3', '车位管理系统', '应用软件开发', '科研项目', '基础研究', '<p>车位管理系统</p>', '1', '263', '810', null, '2017-04-15 00:00:00', '0', '1', '2016-10-14 14:00:11', '2016-10-14 14:01:19');
INSERT INTO `thesis` VALUES ('275', '1', '3', '太空战机', '应用软件开发', '生产实践', '基础研究', '<p>太空战机</p>', '1', '263', '813', null, '2017-04-15 00:00:00', '0', '1', '2016-10-14 14:00:41', '2016-10-14 14:01:47');
INSERT INTO `thesis` VALUES ('277', '1', '3', '漫画网', '应用软件开发', '生产实践', '基础研究', '<p>漫画网</p>', '1', '263', '819', null, '2017-04-15 00:00:00', '0', '1', '2016-10-14 14:02:54', '2016-10-14 14:02:54');
INSERT INTO `thesis` VALUES ('278', '1', '3', '门急诊挂号子系统', '应用软件开发', '生产实践', '基础研究', '<p>门急诊挂号子系统</p>', '1', '263', '820', null, '2017-04-15 00:00:00', '0', '1', '2016-10-14 14:03:31', '2016-10-14 14:03:31');
INSERT INTO `thesis` VALUES ('279', '1', '3', '企业财务管理薪酬管理子系统', '应用软件开发', '生产实践', '基础研究', '<p>企业财务管理薪酬管理子系统</p>', '1', '263', '840', null, '2017-04-15 00:00:00', '0', '1', '2016-10-14 14:04:14', '2016-10-14 14:04:14');
INSERT INTO `thesis` VALUES ('280', '1', '3', '酒店房间管理及结账管理子系统', '应用软件开发', '生产实践', '基础研究', '<p>酒店房间管理及结账管理子系统</p>', '1', '263', '841', null, '2017-04-15 00:00:00', '0', '1', '2016-10-14 14:04:48', '2016-10-14 14:04:48');
INSERT INTO `thesis` VALUES ('281', '1', '3', 'HTTP应用代码生成与文档智能展示系统', '应用软件开发', '生产实践', '基础研究', '<p>HTTP应用代码生成与文档智能展示系统</p>', '1', '263', '849', null, '2017-04-15 00:00:00', '0', '1', '2016-10-14 14:05:33', '2016-10-14 14:05:33');
INSERT INTO `thesis` VALUES ('282', '2', '1', '本科生参与慕课学习的动力研究', '论文类', '导师课题', '毕业论文', '', '1', '24', '85', null, '2017-04-14 00:00:00', '0', '1', '2016-10-14 14:21:20', '2016-10-16 23:02:38');
INSERT INTO `thesis` VALUES ('283', '2', '1', '移动医疗的市场需求研究', '论文类', '其他', '毕业论文', '', '1', '24', '33', null, '2017-04-14 00:00:00', '0', '1', '2016-10-14 14:22:44', '2016-10-16 22:54:11');
INSERT INTO `thesis` VALUES ('284', '2', '1', '以某护肤品为例的电商渠道营销影响因素分析', '论文类', '学生定题', '毕业论文', '', '1', '24', '58', null, '2017-04-14 00:00:00', '0', '1', '2016-10-14 14:24:10', '2016-10-16 22:57:36');
INSERT INTO `thesis` VALUES ('285', '2', '1', '农产品物流模式创新研究——以**地区为例', '论文类', '其他', '毕业论文', '', '1', '24', '70', null, '2017-04-14 00:00:00', '0', '1', '2016-10-14 14:25:12', '2016-10-16 23:00:18');
INSERT INTO `thesis` VALUES ('286', '2', '2', '高校教师评教影响因素分析', '论文类', '导师出题', '毕业论文', '', '1', '24', '154', null, '2017-04-14 00:00:00', '0', '1', '2016-10-14 14:26:37', '2016-10-16 23:21:43');
INSERT INTO `thesis` VALUES ('287', '2', '2', '逆向物流经营模式选择研究', '论文类', '其他', '毕业论文', '', '1', '24', '153', null, '2017-04-14 00:00:00', '0', '1', '2016-10-14 14:27:47', '2016-10-16 23:18:49');
INSERT INTO `thesis` VALUES ('288', '2', '2', '农药包装闭环供应链管理研究', '论文类', '其他', '毕业论文', '', '1', '24', '155', null, '2017-04-14 00:00:00', '0', '1', '2016-10-14 14:28:53', '2016-10-16 23:13:27');
INSERT INTO `thesis` VALUES ('289', '2', '2', '一线城市O2O外卖配送现状与发展研究----以广州为例', '论文类', '其他', '毕业论文', '', '1', '24', '138', null, '2017-04-14 00:00:00', '0', '1', '2016-10-14 14:30:52', '2017-10-01 17:16:34');
INSERT INTO `thesis` VALUES ('290', '1', '3', 'Android平台下的游戏开发', '应用软件开发', '生产实践', '应用研究', '', '1', '237', null, null, '2017-04-20 00:00:00', '0', '1', '2016-10-14 14:32:31', '2016-10-18 18:31:36');
INSERT INTO `thesis` VALUES ('291', '1', '3', 'Android平台下的射击类游戏开发', '应用软件开发', '生产实践', '应用研究', '', '1', '237', '668', null, '2017-04-20 00:00:00', '0', '1', '2016-10-14 14:33:10', '2016-10-19 10:49:47');
INSERT INTO `thesis` VALUES ('292', '1', '3', 'Android平台下的美图系统', '应用软件开发', '生产实践', '应用研究', '', '1', '237', '652', null, '2017-04-20 00:00:00', '0', '1', '2016-10-14 14:34:19', '2016-10-14 14:34:19');
INSERT INTO `thesis` VALUES ('293', '1', '3', 'Android平台下的二手书分享系统', '应用软件开发', '生产实践', '应用研究', '', '1', '237', '399', null, '2017-04-20 00:00:00', '0', '1', '2016-10-14 14:36:56', '2016-10-19 08:12:08');
INSERT INTO `thesis` VALUES ('294', '1', '3', '基于ThinkPHP框架的微博系统', '应用软件开发', '生产实践', '应用研究', '', '1', '237', '456', null, '2017-04-20 00:00:00', '0', '1', '2016-10-14 14:38:20', '2016-10-18 18:18:53');
INSERT INTO `thesis` VALUES ('295', '2', '1', '基于农情服务的数据挖掘关键技术研究', '论文类', '导师课题', '毕业论文', '', '1', '14', '119', null, '2016-10-15 00:00:00', '0', '1', '2016-10-14 15:06:28', '2016-10-14 15:06:28');
INSERT INTO `thesis` VALUES ('296', '2', '1', '数据挖掘技术在农业信息系统中的应用', '论文类', '导师课题', '毕业论文', '', '1', '14', '62', null, '2016-10-15 00:00:00', '0', '1', '2016-10-14 15:07:09', '2016-10-14 15:07:09');
INSERT INTO `thesis` VALUES ('297', '1', '3', '基于U3D引擎的愤怒小鸟游戏设计与实现', '应用软件开发', '生产实践', '应用研究', '<p><!--StartFragment --></p>\r\n\r\n<p>请加入毕业QQ群：106883175</p>', '1', '260', '863', null, '2017-03-31 00:00:00', '0', '1', '2016-10-14 15:11:11', '2017-08-19 12:34:01');
INSERT INTO `thesis` VALUES ('298', '1', '3', '药房管理子系统', '应用软件开发', '生产实践', '应用研究', '<p><!--StartFragment --></p>\r\n\r\n<p>请加入毕业设计QQ群：106883175</p>', '1', '260', '674', null, '2017-03-31 00:00:00', '0', '1', '2016-10-14 15:12:52', '2016-10-18 15:49:06');
INSERT INTO `thesis` VALUES ('299', '1', '3', '基于SSM的华农学生用电收费系统', '应用软件开发', '生产实践', '应用研究', '<p>请加入毕业设计QQ群：106883175</p>', '1', '260', '675', null, '2017-03-31 00:00:00', '0', '1', '2016-10-14 15:14:32', '2016-10-18 15:48:37');
INSERT INTO `thesis` VALUES ('300', '1', '3', '基于spring+springMVC+mybatis的航空机票预订系统', '应用软件开发', '生产实践', '应用研究', '<p>请加入毕业设计QQ群：106883175</p>', '1', '260', '676', null, '2017-03-31 00:00:00', '0', '1', '2016-10-14 15:15:16', '2016-10-18 15:48:05');
INSERT INTO `thesis` VALUES ('301', '1', '3', '住院收费子系统', '应用软件开发', '生产实践', '应用研究', '<p>请加入毕业设计QQ群：106883175</p>', '1', '260', '683', null, '2017-03-31 00:00:00', '0', '1', '2016-10-14 15:16:05', '2016-10-18 15:47:30');
INSERT INTO `thesis` VALUES ('302', '1', '3', '千里马网', '应用软件开发', '生产实践', '应用研究', '<p>请加入毕业设计QQ群：106883175</p>', '1', '260', '686', null, '2017-03-31 00:00:00', '0', '1', '2016-10-14 15:16:48', '2016-10-18 15:46:53');
INSERT INTO `thesis` VALUES ('303', '1', '3', '一款基于Unity3D的手机双人休闲游戏的设计与实现', '应用软件开发', '生产实践', '应用研究', '<p>请加入毕业设计QQ群：106883175</p>', '1', '260', '758', null, '2017-03-31 00:00:00', '0', '1', '2016-10-14 15:18:04', '2016-10-19 16:38:44');
INSERT INTO `thesis` VALUES ('304', '1', '3', '基于SSM的投诉管理系统的设计与实现', '应用软件开发', '生产实践', '应用研究', '<p>请加入毕业设计QQ群：106883175</p>', '1', '260', '719', null, '2017-03-31 00:00:00', '0', '1', '2016-10-14 15:20:49', '2016-10-18 15:45:35');
INSERT INTO `thesis` VALUES ('305', '1', '3', '基于Spring MVC学生信息管理子系统的实现', '应用软件开发', '生产实践', '应用研究', '<p>请加入毕业设计QQ群：106883175</p>', '1', '260', '720', null, '2017-03-31 00:00:00', '0', '1', '2016-10-14 15:21:32', '2016-10-18 15:44:04');
INSERT INTO `thesis` VALUES ('306', '1', '3', '基于SpringMVC和Hibernate的电子备课子系统的开发', '应用软件开发', '生产实践', '应用研究', '<p>请加入毕业设计QQ群：106883175</p>', '1', '260', '721', null, '2017-03-31 00:00:00', '0', '1', '2016-10-14 15:22:08', '2016-10-18 15:41:14');
INSERT INTO `thesis` VALUES ('307', '1', '3', '基于golang,nodejs和mongoDB的写作平台开发', '应用软件开发', '生产实践', '应用研究', '<p>请加入毕业设计QQ群：106883175</p>', '1', '260', '738', null, '2017-03-31 00:00:00', '0', '1', '2016-10-14 15:22:50', '2016-10-18 15:40:10');
INSERT INTO `thesis` VALUES ('308', '1', '3', '基于SSH恵家 E 站中加盟商管理子系统的开发', '应用软件开发', '生产实践', '应用研究', '<p>请加入毕业设计QQ群：106883175</p>', '1', '260', '739', null, '2017-03-31 00:00:00', '0', '1', '2016-10-14 15:23:19', '2016-10-18 15:38:16');
INSERT INTO `thesis` VALUES ('309', '1', '3', '仓库管理系统', '应用软件开发', '生产实践', '应用研究', '<p>对货物进行分类管理，及时提醒管理人员补充缺少的货物。 主要功能如下：</p>\r\n\r\n<p>（1）各种货物信息的查询、增加、删除、修改；</p>\r\n\r\n<p>（2）自由设置货物的提醒信息，如当某种货物的数量少于某个设置的阈值时，系统发信息给管理人员，提醒补充相应的货物；</p>\r\n\r\n<p>（3）用户可以对不同品牌的同一类货物进行评价，系统可以根据评价信息推荐优先选购的品牌。</p>\r\n\r\n<p>该系统要求用户界面友好，易用，具有一定的容错能力。 实现技术任选。如能结合PC端与手机端，效果会更好。</p>', '1', '271', '493', null, '2017-04-16 00:00:00', '0', '1', '2016-10-14 15:44:05', '2016-10-19 12:57:04');
INSERT INTO `thesis` VALUES ('310', '1', '3', '基于web的兼职分享平台', '应用软件开发', '生产实践', '应用研究', '<p>项目简介:构建一个兼职工作平台,用户主要分为雇主和兼职人员，雇主可以通过平台发布项目; 兼职人员可以通过平台接单,完成项目并获得相应的款项。</p>\r\n\r\n<p>具体功能:</p>\r\n\r\n<p>一、兼职人员:</p>\r\n\r\n<p>1.注册登录功能;</p>\r\n\r\n<p>2.在个人中心建立自己的档案,包括个人信息,技能,空闲时间等;</p>\r\n\r\n<p>3.在个人中心可以看到适合自己的一些工作推送;</p>\r\n\r\n<p>4.在个人中心可以搜索适合自己的工作;</p>\r\n\r\n<p>5.在个人中心可以查看手上的工作进度:包括申请中,签约中,进行中,已完成等;</p>\r\n\r\n<p>6.登录后,在个人中心可以查看收入情况(数字,图表等);</p>\r\n\r\n<p>二、雇主用户:</p>\r\n\r\n<p>1.雇主用户注册,登录功能;</p>\r\n\r\n<p>2.在雇主中心填写详细资料，包括个人信息，公司（单位）性质等，并进行认证;</p>\r\n\r\n<p>3.在雇主中心发布自己的需要别人完成的工作(工作类型,时间,薪酬);</p>\r\n\r\n<p>4.在雇主中心查看手上的项目进度:包括收到申请,签约中,进行中,已完成等;</p>\r\n\r\n<p>6.登录后,在雇主中心可以查看支出情况(数字,图表等);</p>\r\n\r\n<p>该系统要求用户界面友好，易用，具有一定的容错能力。 实现技术任选。</p>', '1', '271', '358', null, '2017-04-16 00:00:00', '0', '1', '2016-10-14 15:59:05', '2016-10-14 15:59:05');
INSERT INTO `thesis` VALUES ('311', '1', '3', '图书管理系统的设计与实现', '网络技术与应用', '生产实践', '应用研究', '<p>系统主要功能：</p>\r\n\r\n<p>图书管理员：</p>\r\n\r\n<p>1、登录，修改个人信息，修改密码</p>\r\n\r\n<p>2、 图书信息的查询、增加、删除、修改；</p>\r\n\r\n<p>3、 读者信息的查询、增加、删除、修改；</p>\r\n\r\n<p>4、&nbsp; 图书借出归还操作</p>\r\n\r\n<p>读者：</p>\r\n\r\n<p>1、&nbsp; 登录，修改个人信息，修改密码</p>\r\n\r\n<p>2、&nbsp; 查看图书信息（书评，余量等）</p>\r\n\r\n<p>3、&nbsp; 查询当前借阅及历史借阅</p>\r\n\r\n<p>4、&nbsp; 查看书籍推荐信息</p>\r\n\r\n<p>5、&nbsp; 查看借阅排行榜等榜单</p>\r\n\r\n<p>6、&nbsp; 与其他读者互动交流读书心得等</p>\r\n\r\n<p>&nbsp;</p>\r\n\r\n<p>该系统要求用户界面友好，易用，具有一定的容错能力。实现技术任选。</p>', '1', '271', '346', null, '2017-04-16 00:00:00', '0', '1', '2016-10-14 16:04:59', '2016-10-14 16:04:59');
INSERT INTO `thesis` VALUES ('312', '1', '3', '基于Android的个人财务管理系统应用开发', '应用软件开发', '生产实践', '应用研究', '<p>该系统可以帮助个人管理财务信息。</p>\r\n\r\n<p>包括各个类别的支出、收入情况，投资情况等等。</p>\r\n\r\n<p>根据个人的财务情况作出有用的提醒信息。 如个人在某个方面支出超过了一定的阈值（该值可由用户自由设置），系统可以提醒用户。&nbsp;</p>', '1', '271', '318', null, '2017-04-16 00:00:00', '0', '1', '2016-10-14 16:09:32', '2016-10-14 16:09:32');
INSERT INTO `thesis` VALUES ('313', '1', '3', '网上商城的设计与实现', '网络技术与应用', '生产实践', '应用研究', '<p>主要功能</p>\r\n\r\n<p>商城管理员：</p>\r\n\r\n<p>1、登陆，修改个人信息，修改密码</p>\r\n\r\n<p>2、商品信息的查询、增加、删除、修改</p>\r\n\r\n<p>3、订单管理，查看，取消订单</p>\r\n\r\n<p>用户：</p>\r\n\r\n<p>1、注册个人账号</p>\r\n\r\n<p>2、登陆，更新或者注销个人信息</p>\r\n\r\n<p>3、查询并购买相关物品</p>\r\n\r\n<p>4、订单管理，查看，评论订单</p>\r\n\r\n<p>系统：</p>\r\n\r\n<p>1、根据用户的购买历史记录，推荐物品</p>', '1', '271', '356', null, '2017-04-16 00:00:00', '0', '1', '2016-10-14 16:12:57', '2016-10-14 16:12:57');
INSERT INTO `thesis` VALUES ('314', '1', '3', '基于Web企业人力资源管理系统', '网络技术与应用', '生产实践', '应用研究', '<p>&nbsp;</p>\r\n\r\n<p>该系统主要是针对企业人员的信息进行管理。</p>\r\n\r\n<p>如对企业人员信息的进行查询、增加、删除、修改；</p>\r\n\r\n<p>不同部门的管理人员应该有不同的管理权限；</p>\r\n\r\n<p>一般的企业人员只能查询自己的基本信息，或在限定时间内修改特定的信息。</p>', '1', '271', '357', null, '2017-04-16 00:00:00', '0', '1', '2016-10-14 16:14:45', '2016-10-14 16:14:45');
INSERT INTO `thesis` VALUES ('315', '1', '3', '高校院系校友录ＡPP开发', '应用软件开发', '生产实践', '应用研究', '<p>高校院系校友录管理系统</p>\r\n\r\n<p>该系统主要对高校的校友信息进行管理。</p>\r\n\r\n<p>&nbsp;</p>\r\n\r\n<p>包括校友信息的查询、增加、删除、修改；</p>\r\n\r\n<p>&nbsp;</p>\r\n\r\n<p>发布校友活动通知；可以根据校友的信息、活动的内容推荐合适的活动地点、时间。</p>', '1', '271', '315', null, '2017-04-16 00:00:00', '0', '1', '2016-10-14 16:17:14', '2016-10-14 16:17:14');
INSERT INTO `thesis` VALUES ('316', '1', '3', '数据库专题教学网站', '应用软件开发', '生产实践', '应用研究', '<p>包括但不限于下列基本要求： （1）了解前端开发主要技术及其原理，学习教学设计相关理论；（2）以数据库内容为例，通过广泛搜集、整理相关资源与在线课程，构建一个数据库专题学习网站，供大学一年级学生进行基于网络的自主学习。（3）使用概念图对知识进行整理，并能够点击概念节点跳转相关网页。（4）提供在线的即时反馈的练习；（5）该网站同时提供有关教学方法知识，为教师提供教学方法参考。</p>', '1', '258', '502', null, '2017-05-20 00:00:00', '0', '1', '2016-10-14 19:04:39', '2016-10-18 20:10:25');
INSERT INTO `thesis` VALUES ('317', '1', '3', '基于JavaSwing的Blastn算法解析及图形化实现研究', '生物信息学', '生产实践', '应用研究', '<p>本项目要求使用java Swing技术来实现。</p>\r\n\r\n<p>Blast，全称Basic Local Alignment Search Tool，即“基于局部比对算法的搜索工具”，由Altschul等人于1990年发布。Blast能够实现比较两端核酸或者蛋白序列之间的同源性的功能，它能够快速的找到两段序列之间的同源序列并对比对区域进行打分以确定同源性的高低。</p>\r\n\r\n<p>Blast的运行方式是先用目标序列建数据库（这种数据库称为database，里面的每一条序列称为subject），然后用待查序列（query）在database中搜索，每一条query与database中的每一条subject都要进行双序列比对，从而得出全部比对结果。</p>\r\n\r\n<p>Blast是一个继承的程序包，通过调用不同的比对模块，blast实现了物种可能的序列比对方式：</p>\r\n\r\n<p>blastn：核酸序列对核算库的比对。</p>\r\n\r\n<p> </p>\r\n\r\n<p>请先发邮件联系</p>\r\n\r\n<p>李西明</p>\r\n\r\n<p>liximing_cn@163.com</p>\r\n\r\n<p> </p>\r\n\r\n<p> </p>', '1', '246', null, null, '2017-05-01 00:00:00', '0', '1', '2016-10-14 19:45:03', '2016-10-16 18:09:44');
INSERT INTO `thesis` VALUES ('318', '1', '3', '基于javaSwing的公共云安全数据存储及检索技术研究', '云计算', '生产实践', '应用研究', '<p>本项目要求使用java Swing技术来实现。</p>\r\n\r\n<p>具体技术算法由现有科研项目提供。</p>\r\n\r\n<p>&nbsp;</p>\r\n\r\n<p>云计算是一种新型的计算模式，为用户提供计算和存储服务，是分布式计算、并行计算、网格计算和效用计算相结合的产物。它意味着计算能力也可以作为一种商品进行流通，就像煤气、水电一样，取用方便，费用低廉，最大的不同在于，它是通过互联网进行传输的。云计算将互联网资源有效地整合在一起，采用虚拟化技术，将物理资源和虚拟服务分开，提高了网络资源的利用率。但是当前云计算的发展并非一帆风顺，它仍然面临着许多问题，而安全问题最为关键。为此，大量科研机构对云计算安全展开了积极地研究，但是目前只有少数公司和组织对于云计算安全问题有较为清晰的认识，仍缺乏统一的安全标准。</p>\r\n\r\n<p>&nbsp;</p>\r\n\r\n<p>请先发邮件联系</p>\r\n\r\n<p>李西明</p>\r\n\r\n<p>liximing_cn@163.com</p>\r\n\r\n<p>&nbsp;</p>\r\n\r\n<p>&nbsp;</p>', '1', '246', null, null, '2017-05-01 00:00:00', '0', '1', '2016-10-14 19:50:37', '2016-10-16 13:27:11');
INSERT INTO `thesis` VALUES ('319', '1', '3', '基于python的数据抓取系统的研究与设计', '大数据', '生产实践', '应用研究', '<p>设计开发基于python的数据抓取系统。</p>\r\n\r\n<p>&nbsp;</p>\r\n\r\n<p>请先发邮件联系</p>\r\n\r\n<p>李西明</p>\r\n\r\n<p>liximing_cn@163.com</p>', '1', '246', '597', null, '2017-05-01 00:00:00', '0', '1', '2016-10-14 19:53:25', '2016-10-16 13:27:28');
INSERT INTO `thesis` VALUES ('320', '1', '3', '基于python的大数据聚类算法的研究与实现', '大数据', '生产实践', '应用研究', '<p>基于python的数据聚类算法的研究与实现。</p>\r\n\r\n<p>&nbsp;</p>\r\n\r\n<p>数据聚类是对于静态数据分析的一门技术，在许多领域受到广泛应用，包括机器学习，数据挖掘，模式识别，图像分析以及生物信息。</p>\r\n\r\n<p>在MongoDB数据库上进行数据聚类分析。</p>\r\n\r\n<p>&nbsp;</p>\r\n\r\n<p>请先发邮件联系</p>\r\n\r\n<p>李西明</p>\r\n\r\n<p>liximing_cn@163.com</p>', '1', '246', null, null, '2017-05-01 00:00:00', '0', '1', '2016-10-14 20:08:11', '2016-10-16 13:27:19');
INSERT INTO `thesis` VALUES ('321', '1', '3', '二维码安全技术探讨', '信息安全', '生产实践', '调查报告', '<p>二维码本身是一串文本，不会含有病毒，木马和恶意扣费软件。<br />\r\n目前主要的安全问题是二维码到一个手机应用的下载链接，这个手机应用包含病毒，木马、广告和恶意扣费内容。</p>\r\n\r\n<p>&nbsp;</p>\r\n\r\n<p>你&ldquo;扫一扫&rdquo;了吗？黑白相间、形似迷宫的二维码已经深入人们的日常生活。随着智能手机普及，二维码成为连接线上、线下的一个重要通道。<br />\r\n犯罪分子利用二维码传播手机病毒和不良信息进行诈骗等犯罪活动，严重威胁消费者的财产安全。</p>\r\n\r\n<p>&nbsp;</p>\r\n\r\n<p>请先发邮件联系</p>\r\n\r\n<p>李西明</p>\r\n\r\n<p>liximing_cn@163.com</p>', '1', '246', '467', null, '2017-05-01 00:00:00', '0', '1', '2016-10-14 20:13:24', '2016-10-16 13:26:27');
INSERT INTO `thesis` VALUES ('322', '1', '3', '基于树莓派和python的实用监控系统开发', '网络技术与应用', '生产实践', '设计性', '<p>&nbsp;</p>\r\n\r\n<p>基于树莓派和python的家用监控系统开发。</p>\r\n\r\n<p>使用树莓派 + Python + OpenCV 打造监控及运动检测系统。</p>\r\n\r\n<p>&nbsp;</p>\r\n\r\n<p>请先发邮件联系</p>\r\n\r\n<p>李西明</p>\r\n\r\n<p>liximing_cn@163.com</p>', '1', '246', null, null, '2017-05-01 00:00:00', '0', '1', '2016-10-14 20:19:05', '2016-10-16 13:27:01');
INSERT INTO `thesis` VALUES ('323', '1', '3', '基于树莓派 和 Python的大容量数据服务器集群设计', '网络技术与应用', '生产实践', '设计性', '<p>基于树莓派 和 Python的大容量数据服务器集群设计。</p>\r\n\r\n<p>使用多个树莓派和多个硬盘，构建大容量分布式的数据备份系统。</p>\r\n\r\n<p> </p>\r\n\r\n<p>请先发邮件联系</p>\r\n\r\n<p>李西明</p>\r\n\r\n<p>liximing_cn@163.com</p>', '1', '246', null, null, '2017-05-01 00:00:00', '0', '1', '2016-10-14 20:38:29', '2016-10-16 13:26:48');
INSERT INTO `thesis` VALUES ('324', '1', '3', '改进的蚁群聚类算法', '人工智能', '科研项目', '基础研究', '<p>改进的蚁群聚类算法</p>', '1', '253', '449', null, '2017-04-23 00:00:00', '0', '1', '2016-10-14 21:13:10', '2016-10-14 21:13:10');
INSERT INTO `thesis` VALUES ('325', '2', '2', '我国民营快递公司发展过程中的问题及对策研究', '其他', '导师课题', '毕业论文', '<p>在电子商务蓬勃发展的背景下，四通一达和顺丰为代表的民营快递公司得到了长足的进步。然而业务规模的增长也带来了一系列的问题。试利用SWOT等方法，结合市场调研，分析当前我国快递公司的发展现状和问题，并给出响应的对策。</p>', '1', '19', '159', null, '2017-05-20 00:00:00', '0', '1', '2016-10-15 06:42:44', '2016-10-15 06:42:44');
INSERT INTO `thesis` VALUES ('326', '2', '1', '基于数据挖掘的实时汽车买卖系统研究', '论文类', '导师课题', '毕业论文', '', '1', '13', '34', null, '2016-10-14 00:00:00', '0', '1', '2016-10-15 06:46:04', '2016-10-17 08:43:51');
INSERT INTO `thesis` VALUES ('327', '2', '2', '我国快递企业的智能快递柜选址策略研究', '论文类', '导师课题', '毕业论文', '<p>1，试收集相关文献，结合市场调查，分析智能快递柜在我国快递行业的应用现状。</p>\r\n\r\n<p>2，试利用混合整数规划，重心法等方法，结合我国快递行业的发展环境，对我国快递企业的智能快递柜的选址策略进行研究。</p>\r\n\r\n<p> </p>', '1', '19', '145', null, '2017-05-20 00:00:00', '0', '1', '2016-10-15 07:15:15', '2016-10-15 07:16:31');
INSERT INTO `thesis` VALUES ('328', '2', '1', '基于金融大数据的期货自动交易数据挖掘研究', '论文类', '导师出题', '毕业论文', '', '1', '13', '133', null, '2016-10-14 00:00:00', '0', '1', '2016-10-15 07:33:41', '2016-10-17 08:43:11');
INSERT INTO `thesis` VALUES ('329', '2', '1', '多平台电商商圈分析系统设计', '设计类', '导师出题', '毕业论文', '', '1', '13', '101', null, '2016-10-14 00:00:00', '0', '1', '2016-10-15 07:34:34', '2016-10-17 08:42:37');
INSERT INTO `thesis` VALUES ('330', '2', '2', '基于大数据的自动问卷情感分析', '论文类', '导师出题', '毕业论文', '', '1', '13', '178', null, '2016-10-14 00:00:00', '0', '1', '2016-10-15 07:38:33', '2016-10-15 07:38:33');
INSERT INTO `thesis` VALUES ('331', '2', '2', '基于大数据的物流供应商选择研究', '论文类', '导师出题', '毕业论文', '', '1', '13', null, null, '2016-10-14 00:00:00', '0', '1', '2016-10-15 07:41:38', '2016-10-15 07:41:38');
INSERT INTO `thesis` VALUES ('332', '2', '2', '基于大数据的金融市场计算机化的交易研究', '论文类', '导师出题', '毕业论文', '', '1', '13', '157', null, '2016-10-14 00:00:00', '0', '1', '2016-10-15 07:43:17', '2016-10-17 08:46:17');
INSERT INTO `thesis` VALUES ('333', '2', '2', '基于大数据的电商退换货数据挖掘', '论文类', '导师出题', '毕业论文', '', '1', '13', '144', null, '2016-10-14 00:00:00', '0', '1', '2016-10-15 07:44:53', '2016-10-17 08:45:43');
INSERT INTO `thesis` VALUES ('334', '2', '1', '互联网思维下人力资源管理——以某某企业为例', '论文类', '导师出题', '毕业论文', '<p>该论文以互联网+为背景，研究互联网+人力资源的时代环境，特点，结构，典型案例，最终梳理出其基本规律及其方法。</p>', '1', '11', '105', null, '2016-10-15 00:00:00', '0', '1', '2016-10-15 08:09:03', '2016-10-15 08:09:03');
INSERT INTO `thesis` VALUES ('335', '2', '1', '互联网思维下品牌营销运用研究——以某某企业为例', '论文类', '导师出题', '毕业论文', '', '1', '11', '60', null, '2016-10-15 00:00:00', '0', '1', '2016-10-15 08:10:41', '2016-10-15 08:10:41');
INSERT INTO `thesis` VALUES ('336', '2', '2', '基于混合整数规划的快递公司收件中转场车辆拥堵问题研究', '论文类', '导师课题', '毕业论文', '<p>对于快递公司的收件中转场来说，一个常见的问题在某个班次的一个时间段内，很多收货点的车辆集中到达，直接导致收件中转场拥堵。试利用混合整数规划等运筹学方法，建立点部收件车辆的调度模型，合理解决收件中转场的拥堵问题。</p>', '1', '19', null, null, '2017-05-20 00:00:00', '0', '1', '2016-10-15 08:12:08', '2016-10-15 08:12:08');
INSERT INTO `thesis` VALUES ('337', '2', '1', '互联网思维下用户参与产品设计研究——以某某企业为例', '论文类', '导师课题', '毕业论文', '', '1', '11', '65', null, '2016-10-15 00:00:00', '0', '1', '2016-10-15 08:12:30', '2016-10-15 08:12:30');
INSERT INTO `thesis` VALUES ('339', '2', '1', '互联网思维下家庭农场经营研究——以某某家庭农场为例', '论文类', '导师课题', '毕业论文', '', '1', '11', '44', null, '2016-10-15 00:00:00', '0', '1', '2016-10-15 08:15:26', '2016-10-17 08:48:50');
INSERT INTO `thesis` VALUES ('340', '2', '1', '政府部门采纳社交网络工具行为及影响因素', '论文类', '导师课题', '毕业论文', '', '1', '11', '30', null, '2016-10-15 00:00:00', '0', '1', '2016-10-15 08:18:09', '2016-10-15 08:18:09');
INSERT INTO `thesis` VALUES ('341', '2', '1', '电子政务数据开放与利用研究', '论文类', '导师课题', '毕业论文', '', '1', '11', '53', null, '2016-10-15 00:00:00', '0', '1', '2016-10-15 08:22:39', '2016-10-15 08:22:39');
INSERT INTO `thesis` VALUES ('342', '2', '1', '电子政务绩效评价研究', '论文类', '导师课题', '毕业论文', '', '1', '11', '73', null, '2016-10-15 00:00:00', '0', '1', '2016-10-15 08:23:46', '2016-10-17 08:49:18');
INSERT INTO `thesis` VALUES ('343', '2', '1', '统一电子政务平台的系统需求分析研究', '论文类', '导师课题', '毕业论文', '', '1', '11', '103', null, '2016-10-15 00:00:00', '0', '1', '2016-10-15 08:24:53', '2016-10-17 08:49:42');
INSERT INTO `thesis` VALUES ('344', '2', '1', '电子政务大数据建设的现状与问题研究', '论文类', '导师课题', '毕业论文', '', '1', '11', null, null, '2016-10-15 00:00:00', '0', '1', '2016-10-15 08:26:10', '2016-10-15 08:26:10');
INSERT INTO `thesis` VALUES ('345', '2', '2', '互联网思维下价值链重构研究——以某某企业为例', '论文类', '导师出题', '毕业论文', '', '1', '11', null, null, '2016-10-15 00:00:00', '0', '1', '2016-10-15 09:03:05', '2016-10-15 09:03:05');
INSERT INTO `thesis` VALUES ('346', '2', '1', '基于机器视觉和数据挖掘的豪猪行为识别', '设计类', '导师课题', '毕业论文', '<p>主要研究豪猪机器识别，跟踪行为并利用数据挖掘进行行为分析。成果形式：论文</p>', '1', '5', '97', null, '2016-10-15 00:00:00', '0', '1', '2016-10-15 09:52:42', '2016-10-16 20:13:41');
INSERT INTO `thesis` VALUES ('347', '2', '1', '基于网络爬虫的搜索引擎设计', '设计类', '导师出题', '毕业论文', '<p>网络爬虫主要是将互联网上的网页下载到本地形成一个或联网内容的镜像备份，要求的技术是java，python。<br />\r\n成果形式：软件系统、论文</p>', '1', '5', '118', null, '2016-10-15 00:00:00', '0', '1', '2016-10-15 09:54:45', '2016-10-16 20:12:30');
INSERT INTO `thesis` VALUES ('348', '1', '3', '基于SNMP的服务器监控系统', '网络技术与应用', '其他', '应用研究', '<p>对SNMP协议进行深入学习研究；</p>\r\n\r\n<p>对SNMP进行应用。</p>', '1', '203', '631', null, '2016-10-15 00:00:00', '0', '1', '2016-10-15 09:55:30', '2016-10-15 09:55:30');
INSERT INTO `thesis` VALUES ('349', '1', '3', '楼盘展示网站的设计与实现', '应用软件开发', '生产实践', '设计性', '<p>1</p>', '1', '217', '421', null, '2016-05-20 00:00:00', '0', '1', '2016-10-15 10:14:33', '2016-10-18 18:08:13');
INSERT INTO `thesis` VALUES ('350', '1', '3', '基于PHP的华农趣事分享平台', '应用软件开发', '科研项目', '基础研究', '<p>具有游客，会员，管理员三种用户及权限：</p>\r\n\r\n<p style=\"margin-left:18pt\">1.注册，注销</p>\r\n\r\n<p style=\"margin-left:18pt\">2.查看别人分享的趣事</p>\r\n\r\n<p style=\"margin-left:18pt\">3.修改个人信息</p>\r\n\r\n<p style=\"margin-left:18pt\">4.评论（纯文字）</p>\r\n\r\n<p style=\"margin-left:18pt\">5.点赞</p>\r\n\r\n<p style=\"margin-left:18pt\">6.收藏</p>\r\n\r\n<p style=\"margin-left:18pt\">7.发布趣事，包括纯文字，带图片，带视频等三种方式。</p>\r\n\r\n<p style=\"margin-left:18pt\">8.撤回趣事</p>\r\n\r\n<p style=\"margin-left:18pt\">9.审核趣事</p>\r\n\r\n<p style=\"margin-left:18pt\">10.删除趣事</p>\r\n\r\n<p>&nbsp;</p>\r\n\r\n<p style=\"margin-left:18pt\">华农因为校园面积大，同学与同学之间的交流非常少，各个学院除了联谊之外，基本没有任何交流。而华农趣事平台能够为华农学子提供一个生活趣事的分享，无形之中增加了同学们之间的了解与交流。外界大多数的平台都是面向社会上形形色色的人，并不能像这个平台一样是真正华农学生的平台，而这个平台，学生一打开，面对的都是自己的校友，并且可能让很多本身没有任何关联的华农学子，从陌生人成为朋友。整个平台以传播趣事为主，旨在让华农的学生能够在同学之间传播正能量，收获友谊。</p>', '1', '217', '558', null, '2016-05-20 00:00:00', '0', '1', '2016-10-15 10:15:07', '2016-10-17 11:00:52');
INSERT INTO `thesis` VALUES ('351', '1', '3', '市场联合管理后台系统', '应用软件开发', '生产实践', '设计性', '<p>市场联合管理系统需要完成以下功能：</p>\r\n\r\n<p>&nbsp; &nbsp;1.商户信息登记，分类（经营商品类型，商家身份证，消防许可文件，食品安全文件等等）。</p>\r\n\r\n<p style=\"margin-left:18pt\">2.可根据商户证件号码，查询到商户相应的信息文件。</p>\r\n\r\n<p style=\"margin-left:18pt\">3.可查询相应市场的摊位空置商铺剩余量，提供相应信息给商家。</p>\r\n\r\n<p style=\"margin-left:18pt\">4.管理员可以对系统商户信息进行增删改查。</p>\r\n\r\n<p style=\"margin-left:18pt\">5.设置游客身份，遍历各个市场商户的商铺名，经营商品类型，及铺位（非隐私类信息）。</p>', '1', '217', '540', null, '2017-05-20 00:00:00', '0', '1', '2016-10-15 10:15:49', '2016-10-19 14:42:32');
INSERT INTO `thesis` VALUES ('352', '1', '3', '基于安卓的个人时间管理软件', '应用软件开发', '其他', '应用研究', '<p>安卓系统应用开发；</p>\r\n\r\n<p>JAVA程序设计；</p>\r\n\r\n<p>对时间管理有全面的理解。</p>', '1', '203', '359', null, '2016-10-15 00:00:00', '0', '1', '2016-10-15 10:17:20', '2016-10-18 23:33:15');
INSERT INTO `thesis` VALUES ('353', '1', '3', '家庭实用菜谱网站的设计与实现', '网络技术与应用', '其他', '应用研究', '<p>WEB各项技术的应用；</p>\r\n\r\n<p>网站的规划设计；</p>\r\n\r\n<p>菜谱方面的需求理解。</p>', '1', '203', '638', null, '2016-10-15 00:00:00', '0', '1', '2016-10-15 10:20:10', '2016-10-19 10:51:31');
INSERT INTO `thesis` VALUES ('354', '1', '3', '基于WEB的小型教学辅助系统的研究与开发', '网络技术与应用', '其他', '应用研究', '<p>WEB各项技术的应用；</p>\r\n\r\n<p>教学辅助系统的全面学习应用。</p>', '1', '203', '291', null, '2016-10-15 00:00:00', '0', '1', '2016-10-15 10:23:20', '2016-10-15 10:23:20');
INSERT INTO `thesis` VALUES ('355', '1', '3', '基于安卓的个人手账管理软件', '应用软件开发', '其他', '应用研究', '<p>安卓系统应用的开发；</p>\r\n\r\n<p>JAVA编程技术；</p>\r\n\r\n<p>个人手账的全面管理。</p>', '1', '203', '375', null, '2016-10-15 00:00:00', '0', '1', '2016-10-15 10:25:29', '2016-10-15 10:25:29');
INSERT INTO `thesis` VALUES ('356', '1', '3', '可溯源移动电商后台管理系统', '应用软件开发', '科研项目', '应用研究', '<p>可溯源移动电商后台管理系统</p>', '1', '253', '349', null, '2017-04-23 00:00:00', '0', '1', '2016-10-15 21:21:54', '2016-10-15 21:21:54');
INSERT INTO `thesis` VALUES ('357', '1', '3', '基于NFC及二维码的农产品可溯源APP', '应用软件开发', '科研项目', '应用研究', '<p>基于NFC及二维码的农产品可溯源APP</p>', '1', '253', '348', null, '2017-04-23 00:00:00', '0', '1', '2016-10-15 21:23:59', '2016-10-15 21:23:59');
INSERT INTO `thesis` VALUES ('358', '2', '1', '图书馆管理信息系统的设计与实现', '设计类', '导师出题', '毕业论文', '', '1', '26', null, null, '2016-10-11 00:00:00', '0', '1', '2016-10-15 22:30:55', '2016-10-15 22:33:40');
INSERT INTO `thesis` VALUES ('359', '2', '1', '销售管理信息系统的设计与实现', '设计类', '导师出题', '毕业论文', '', '1', '26', null, null, '2016-10-11 00:00:00', '0', '1', '2016-10-15 22:32:30', '2016-10-15 22:32:30');
INSERT INTO `thesis` VALUES ('360', '2', '1', '设备管理信息系统的设计与实现', '设计类', '导师出题', '毕业论文', '', '1', '26', null, null, '2016-10-11 00:00:00', '0', '1', '2016-10-15 22:33:10', '2016-10-15 22:33:10');
INSERT INTO `thesis` VALUES ('361', '1', '3', '基于HTML5的“乡游天下”APP', '应用软件开发', '其他', '应用研究', '<p>基于HTML5的&ldquo;乡游天下&rdquo;APP</p>', '1', '253', '440', null, '2017-04-23 00:00:00', '0', '1', '2016-10-16 09:19:13', '2016-10-16 09:19:13');
INSERT INTO `thesis` VALUES ('362', '2', '1', '毕业班级网站设计与实现', '设计类', '导师出题', '毕业论文', '', '1', '27', '92', null, '2016-10-16 00:00:00', '0', '1', '2016-10-16 12:19:40', '2016-10-16 12:19:40');
INSERT INTO `thesis` VALUES ('363', '2', '1', '数码单反相机与摄影探索网站设计', '设计类', '导师出题', '毕业论文', '', '1', '27', null, null, '2016-10-16 00:00:00', '0', '1', '2016-10-16 12:21:39', '2016-10-16 12:21:39');
INSERT INTO `thesis` VALUES ('364', '1', '3', '基于javaSwing的网络爬虫系统开发', '数据挖掘', '生产实践', '设计性', '<p>基于javaSwing的网络爬虫系统开发</p>\r\n\r\n<p>开发可配置的开源爬虫框架，提供爬虫控制台管理界面，通过配置解析各类网页内容，无需写一句java代码即可抽取所需数据。<br />\r\n<br />\r\n1.包含强大的页面解析引擎，提供jsoup、xpath、正则表达式等处理链，通过简单配置即可抽取所需的指定内容。<br />\r\n2.提供爬虫控制管理界面，可实时监控抓取状态，动态添加抓取任务，动态配置定时任务，可对单个网页进行测试抓取。<br />\r\n3.提供抓取各阶段的触发器、拦截器，方便扩展。</p>\r\n\r\n<p>&nbsp;</p>\r\n\r\n<p>请先发邮件联系</p>\r\n\r\n<p>李西明</p>\r\n\r\n<p>liximing_cn@163.com</p>', '1', '246', '551', null, '2017-05-01 00:00:00', '0', '1', '2016-10-16 13:26:09', '2016-10-16 13:26:09');
INSERT INTO `thesis` VALUES ('365', '1', '3', '基于机器视觉的多类水果识别研究与实现', '数字图像处理', '科研项目', '基础研究', '<p>基于机器视觉技术进行野外柑橘的识别研究与实现</p>', '1', '241', '285', null, '2017-04-30 00:00:00', '0', '1', '2016-10-16 13:44:42', '2016-10-19 13:04:29');
INSERT INTO `thesis` VALUES ('366', '1', '3', '微信会员营销系统的设计与实现', '应用软件开发', '生产实践', '应用研究', '<p>微信会员营销系统的设计与实现</p>', '1', '241', '329', null, '2017-04-30 00:00:00', '0', '1', '2016-10-16 13:46:52', '2016-10-16 13:46:52');
INSERT INTO `thesis` VALUES ('367', '1', '3', '基于深度学习的飞鸟识别系统', '应用软件开发', '生产实践', '应用研究', '<p>利用现在非常火的深度学习技术来识别飞鸟，开发工具和语言不限。</p>\r\n\r\n<p>欢迎有兴趣的同学加入此前沿技术。</p>\r\n\r\n<p>QQ: 77481028，彭老师</p>', '1', '241', null, null, '2017-04-30 00:00:00', '0', '1', '2016-10-16 14:05:18', '2016-10-16 14:05:18');
INSERT INTO `thesis` VALUES ('368', '1', '3', '基于计算机视觉技术的飞鸟检测和识别系统', '应用软件开发', '生产实践', '应用研究', '<p>利用现在非常火的计算机视觉技术来检测和识别飞鸟，开发工具和语言不限。</p>\r\n\r\n<p>欢迎有兴趣的同学加入此前沿技术。</p>\r\n\r\n<p>QQ: 77481028，彭老师</p>', '1', '241', null, null, '2017-04-30 00:00:00', '0', '1', '2016-10-16 14:13:59', '2016-10-16 14:13:59');
INSERT INTO `thesis` VALUES ('369', '1', '3', '基于树莓派的无线自组网设计与开发', '应用软件开发', '生产实践', '应用研究', '<p>&nbsp;</p>\r\n\r\n<p>基于树莓派的无线自组网设计与开发</p>\r\n\r\n<p>树莓派（英语：Raspberry Pi），是一款基於Linux系統的只有一張信用卡大小的单板机電腦。它由英國的树莓派基金會所開發，目的是以低價硬體及自由軟體刺激在学校的基本的电脑科学教育。树莓派的生产是通过有生产许可的两家公司：Element 14/Premier Farnell和RS Components。这两家公司都在网上出售树莓派。</p>\r\n\r\n<p>无线自组织网络由不需要任何基础设施的一组具有动态组网能力的节点组成，这种网络适应了军事和商用中对网络和设备移动性的要求，而引起了人们的关注，并在20世纪90年代以后获得了广泛的研究和发展。</p>\r\n\r\n<p>与其他通信网络相比，无线自组织网络具有带宽有限、链路容易改变、节点的移动性以及由此带来的网络拓扑的动态性、物理安全有限、受设备限制等特点。正是由于这些区别，无线自组织网络协议栈也产生了比传统网络协议栈更高的要求：适应移动分布节点随机收发行为的媒体接入控制(MAC)协议，基于动态拓扑结果的高效、稳健的路由算法，便利的异构网络互联技术，有效的功率控制，合理的跨层信息交互、多层协同设计，可靠的安全机制等等。</p>\r\n\r\n<p>&nbsp;</p>\r\n\r\n<p>请先发邮件联系</p>\r\n\r\n<p>李西明</p>\r\n\r\n<p>liximing_cn@163.com</p>', '1', '246', null, null, '2017-05-01 00:00:00', '0', '1', '2016-10-16 14:20:26', '2016-10-16 14:20:46');
INSERT INTO `thesis` VALUES ('370', '1', '3', '改进的基因表达式编程聚类算法', '应用软件开发', '科研项目', '基础研究', '<p>改进的基因表达式编程聚类算法</p>', '1', '253', '450', null, '2017-04-23 00:00:00', '0', '1', '2016-10-16 14:59:02', '2016-10-16 14:59:02');
INSERT INTO `thesis` VALUES ('371', '1', '3', '基于AngularJS和Laravel的电影社区网站', '应用软件开发', '生产实践', '应用研究', '<p>基于html5, javaScript, php, mySQL等技术，自行设计和实现提供影讯，电影榜单，影评，分类搜索功能的网站。可参考\"豆瓣电影\"等。</p>', '1', '214', '407', '266', '2016-10-16 00:00:00', '0', '1', '2016-10-16 15:01:04', '2017-09-29 20:57:16');
INSERT INTO `thesis` VALUES ('372', '1', '3', '基于无人机航拍视频的图像拼接系统', '应用软件开发', '生产实践', '应用研究', '<p>当前，无人机的发展被人们认为是类似于上世纪80年代个人电脑领域里苹果公司推出麦金塔电脑的变革式的发展。而计算机视觉技术+无人机，更给人以无限的想象空间。</p>\r\n\r\n<p>本毕业设计利用无人机航拍视频进行图像拼接，生成大场景图像。开发工具和语言不限。</p>\r\n\r\n<p>欢迎有兴趣的同学加入。</p>\r\n\r\n<p>QQ: 77481028，彭老师</p>', '1', '241', null, null, '2017-04-30 00:00:00', '0', '1', '2016-10-16 15:20:24', '2016-10-16 15:20:24');
INSERT INTO `thesis` VALUES ('373', '1', '3', '基于无人机航拍图像的三维重建系统', '应用软件开发', '生产实践', '应用研究', '<p>当前，无人机的发展被人们认为是类似于上世纪80年代个人电脑领域里苹果公司推出麦金塔电脑的变革式的发展。而计算机视觉技术+无人机，更给人以无限的想象空间。</p>\r\n\r\n<p>本毕业设计利用无人机航拍图像进行场景的三维重建，形成立体图像。开发工具和语言不限。</p>\r\n\r\n<p>欢迎有兴趣的同学加入。</p>\r\n\r\n<p>QQ: 77481028，彭老师</p>', '1', '241', null, null, '2017-04-30 00:00:00', '0', '1', '2016-10-16 15:23:57', '2016-10-16 15:23:57');
INSERT INTO `thesis` VALUES ('375', '1', '3', '智慧教室1', '应用软件开发', '科研项目', '基础研究', '<p>针对教三的视频数据进行智能分析</p>', '1', '212', '814', null, '2017-04-23 00:00:00', '0', '1', '2016-10-16 15:36:29', '2016-10-16 15:36:29');
INSERT INTO `thesis` VALUES ('376', '1', '3', '图片去雨', '应用软件开发', '科研项目', '应用研究', '<p>针对图片中雨的像素，采用机器学习的方法进行图片去雨</p>', '1', '212', '498', null, '2017-04-23 00:00:00', '0', '1', '2016-10-16 15:41:57', '2016-10-16 15:41:57');
INSERT INTO `thesis` VALUES ('377', '1', '3', '机器学习的图片去雨特征提取', '应用软件开发', '科研项目', '应用研究', '', '1', '212', '806', null, '2017-04-23 00:00:00', '0', '1', '2016-10-16 15:44:20', '2016-10-16 15:44:20');
INSERT INTO `thesis` VALUES ('378', '1', '3', '玉米种子类别识别系统', '应用软件开发', '科研项目', '基础研究', '<p>针对采集到的不同玉米种子，采用机器学习的方式，进行种子类别的识别</p>', '1', '212', null, null, '2017-04-23 00:00:00', '0', '1', '2016-10-16 15:48:39', '2016-10-16 15:48:39');
INSERT INTO `thesis` VALUES ('379', '1', '3', '航拍数据分析系统', '数字图像处理', '科研项目', '应用研究', '<p>针对航拍获得的数据，进行分析</p>', '1', '212', null, null, '2017-04-23 00:00:00', '0', '1', '2016-10-16 15:52:03', '2016-10-16 15:52:03');
INSERT INTO `thesis` VALUES ('380', '1', '3', '个性化毕业照片拍摄于分享系统', '应用软件开发', '科研项目', '基础研究', '<p>通过平台，个性化设置毕业照片的拍摄并进行分享</p>', '1', '212', '466', null, '2017-04-23 00:00:00', '0', '1', '2016-10-16 15:53:38', '2016-10-16 15:53:38');
INSERT INTO `thesis` VALUES ('381', '1', '3', '校园小黄车的智能平台研究', '应用软件开发', '科研项目', '基础研究', '<p>针对华农的小黄车，智能分析小黄车数据</p>', '1', '212', '608', null, '2017-04-23 00:00:00', '0', '1', '2016-10-16 15:55:46', '2016-10-16 15:55:46');
INSERT INTO `thesis` VALUES ('382', '1', '3', '猪病诊疗系统', '应用软件开发', '科研项目', '应用研究', '<p>猪病诊疗系统</p>', '1', '253', '448', null, '2017-04-23 00:00:00', '0', '1', '2016-10-16 15:56:46', '2016-10-16 15:56:46');
INSERT INTO `thesis` VALUES ('383', '1', '3', '基于Android的校园车位可视化分析系统', '应用软件开发', '科研项目', '基础研究', '<p>针对高校车位紧张，建立车位管理的可视化分析系统</p>', '1', '212', null, null, '2017-04-23 00:00:00', '0', '1', '2016-10-16 15:58:20', '2016-10-16 15:58:20');
INSERT INTO `thesis` VALUES ('384', '1', '3', '基于Android的学校二手教材流通平台', '应用软件开发', '科研项目', '基础研究', '<p>针对学校的二手教材，建立流通交易平台</p>', '1', '212', '637', null, '2017-04-23 00:00:00', '0', '1', '2016-10-16 16:00:03', '2016-10-16 16:00:03');
INSERT INTO `thesis` VALUES ('385', '1', '3', '基于Android校园饭堂菜品网上选择与下单系统', '应用软件开发', '科研项目', '基础研究', '<p>针对校园饭堂的菜品，利用互联网技术，进行网上下单</p>', '1', '212', '560', null, '2017-04-23 00:00:00', '0', '1', '2016-10-16 16:02:37', '2016-10-16 16:02:37');
INSERT INTO `thesis` VALUES ('386', '1', '3', '基于林场的土地资源分析系统', '应用软件开发', '科研项目', '基础研究', '<p>针对林场的视频数据，进行土地资源分析</p>', '1', '212', null, null, '2017-04-23 00:00:00', '0', '1', '2016-10-16 16:04:29', '2016-10-16 16:04:29');
INSERT INTO `thesis` VALUES ('387', '1', '3', '林场视频数据的建设与传输系统', '应用软件开发', '科研项目', '基础研究', '<p>针对林场，进行视频数据的建设与传输</p>', '1', '212', null, null, '2017-04-23 00:00:00', '0', '1', '2016-10-16 16:05:41', '2016-10-16 16:05:41');
INSERT INTO `thesis` VALUES ('388', '1', '3', '基于Spark的大数据聚类的研究与实现', '数据挖掘', '其他', '应用研究', '<p>选取典型聚类算法，基于spark环境进行应用推广研究，实现一个基于Spark的大数据分析应用系统</p>', '1', '236', null, null, '2017-04-10 00:00:00', '0', '1', '2016-10-16 16:55:14', '2016-10-16 16:55:14');
INSERT INTO `thesis` VALUES ('389', '1', '3', '基于Spark的高维大数据降维处理的研究与实现', '大数据', '其他', '应用研究', '<p>选取经典降维算法，基于spark环境进行高维大数据降维，为进一步进行大数据分析支持提供解决方案。</p>', '1', '236', null, null, '2017-04-10 00:00:00', '0', '1', '2016-10-16 17:00:12', '2016-10-16 17:00:12');
INSERT INTO `thesis` VALUES ('390', '1', '3', '基于android的社区拼客平台的设计与实现', '应用软件开发', '其他', '应用研究', '<p>参照目前常见拼客平台，设计并实现一个小型的应用于社区的拼客平台</p>', '1', '236', '343', null, '2017-04-10 00:00:00', '0', '1', '2016-10-16 17:13:46', '2016-10-19 14:10:09');
INSERT INTO `thesis` VALUES ('391', '1', '3', '基于android拼货平台的设计与实现', '应用软件开发', '其他', '应用研究', '<p>参照目前常见拼货平台，设计并实现一个基于android的应用于城市间物流运输的拼货平台</p>', '1', '236', null, null, '2017-04-10 00:00:00', '0', '1', '2016-10-16 17:17:04', '2016-10-16 17:17:04');
INSERT INTO `thesis` VALUES ('392', '1', '3', '基于Spark的推荐引擎的设计与应用', '应用软件开发', '科研项目', '应用研究', '<p>以实际应用为基础，设计并实现一个基于spark的推荐引擎，并将该引擎应用与实际的应用系统中。</p>', '1', '236', null, null, '2017-04-10 00:00:00', '0', '1', '2016-10-16 17:23:15', '2016-10-16 17:23:15');
INSERT INTO `thesis` VALUES ('393', '1', '3', '基于二维码的图纸管理与追溯android应用系统', '应用软件开发', '科研项目', '基础研究', '<p>在装修设计企业中，各类项目图纸具有以下特点：</p>\r\n\r\n<p>1）数量大</p>\r\n\r\n<p>2）种类多</p>\r\n\r\n<p>3）流程复杂</p>\r\n\r\n<p>4）管理困难</p>\r\n\r\n<p>针对这些特点和问题，设计并实现一个基于二维码的图纸管理与追溯系统，该系统的主要功能为</p>\r\n\r\n<p>图纸自动编码</p>\r\n\r\n<p>图纸状态记录</p>\r\n\r\n<p>图纸状态查询</p>\r\n\r\n<p>出图流程追溯</p>\r\n\r\n<p>要求实现基于android的 图纸文件管理追溯系统 </p>', '1', '236', null, null, '2017-04-10 00:00:00', '0', '1', '2016-10-16 17:33:42', '2016-10-16 17:34:23');
INSERT INTO `thesis` VALUES ('394', '1', '3', '基于Java的企业招聘系统的设计与实现', '应用软件开发', '科研项目', '应用研究', '<p>设计并实现一个企业招聘系统</p>\r\n\r\n<p>要求该系统除具有招聘系统最基本的注册 简历筛选等功能外  还具备在线人材考核功能，能够建立基础题库对人才专业技能、性格等方面进行基本考核，为人才招聘提供更客观的依据。</p>\r\n\r\n<p> </p>\r\n\r\n<p>要求基于java平台实现该系统。</p>', '1', '236', '604', null, '2017-04-10 00:00:00', '0', '1', '2016-10-16 17:56:30', '2016-10-19 13:13:24');
INSERT INTO `thesis` VALUES ('395', '1', '3', '基于ThinkPHP的美食分享网站', '应用软件开发', '生产实践', '应用研究', '<p>基于html5, javaScript, php, mySQL等技术，自行设计和实现提供菜谱分类，推荐菜谱，用户上传新菜谱，评论，问答社区等功能的网站。可参考&quot;下厨房&quot;等。</p>', '1', '214', '420', null, '2016-10-16 00:00:00', '0', '1', '2016-10-16 18:00:10', '2016-10-16 18:00:10');
INSERT INTO `thesis` VALUES ('396', '1', '3', '基于java的人才培训与考核系统的设计与实现', '应用软件开发', '其他', '应用研究', '<p>基于java平台   设计并实现一个人才培训与 考核系统</p>\r\n\r\n<p>主要功能</p>\r\n\r\n<p>培训课程管理  （课程建立  课程内容展示（ppt 视频等） 课程练习）</p>\r\n\r\n<p>培训计划管理   （培训计划建立  培训进度管理  。。）</p>\r\n\r\n<p>培训考核管理    （培训阶段考核  培训课程考核。。。。</p>\r\n\r\n<p>培训人才管理    （人才录入  课程进展  成绩单。。。）</p>\r\n\r\n<p>要求该系统支持手机在线访问和使用。</p>\r\n\r\n<p> </p>', '1', '236', '667', null, '2017-04-10 00:00:00', '0', '1', '2016-10-16 18:05:03', '2016-10-19 14:07:40');
INSERT INTO `thesis` VALUES ('397', '1', '3', '基于javaSwing开发公共云上的密码管理器', '信息安全', '生产实践', '设计性', '<p>基于javaSwing开发公共云上的密码管理器</p>\r\n\r\n<p>密码管理器是指围绕用户账号密码安全和管理的软件或者硬件的集合。</p>\r\n\r\n<p>一款个人信息安全产品，带有电子签名和身份认证工具，以硬件方式管理个人账号和密码，国际加密算法和双因素认证安全机制保证信息的安全性和保密性，带你体验上网的便利和安全。</p>\r\n\r\n<p><br />\r\n软件界面简洁，操作简单，功能强大，性能超群，是保障数据安全。</p>\r\n\r\n<p>请先发邮件联系</p>\r\n\r\n<p>李西明</p>\r\n\r\n<p>liximing_cn@163.com</p>', '1', '246', null, null, '2017-05-01 00:00:00', '0', '1', '2016-10-16 18:09:35', '2016-10-16 18:10:00');
INSERT INTO `thesis` VALUES ('398', '1', '3', '基于HTML5及CSS3的移动商务平台的设计与实现', '应用软件开发', '其他', '应用研究', '<p>设计并实现一个基于HTML5及CSS3的移动商务平台，并结合具体实践进行应用。</p>', '1', '236', '602', null, '2017-04-10 00:00:00', '0', '1', '2016-10-16 18:30:22', '2016-10-19 12:46:22');
INSERT INTO `thesis` VALUES ('399', '1', '3', '基于HTML5及CSS3的移动信息发布与分享系统的设计与实现', '应用软件开发', '其他', '应用研究', '<p>设计并实现一个基于HTML5及CSS3的移动信息发布与分享系统，要求支持多种类型的信息发布（请柬、邀请函、通知、。。。）</p>\r\n\r\n<p>支持多种类型的模板建立与使用</p>\r\n\r\n<p>支持多种途径的分</p>\r\n\r\n<p>享和发布</p>', '1', '236', '559', null, '2017-04-10 00:00:00', '0', '1', '2016-10-16 18:36:18', '2016-10-19 12:44:22');
INSERT INTO `thesis` VALUES ('400', '1', '3', '基于HTML5及CSS3的移动文学写作与分享系统的设计与实现', '应用软件开发', '其他', '应用研究', '<p>设计并实现一个基于HTML5及CSS3的文学移动写作与分享系统，要求该系统能够支持文学作品的分类、作品上传  作品阅读  作品分享</p>\r\n\r\n<p> </p>\r\n\r\n<p>并且具有阅读统计和作者和读者分级积分功能</p>\r\n\r\n<p> </p>\r\n\r\n<p>另外要求系统具有内容的自动审核或人工审核机制，保证言论的合理与合法。</p>', '1', '236', '284', null, '2017-04-10 00:00:00', '0', '1', '2016-10-16 18:43:49', '2016-10-19 12:41:16');
INSERT INTO `thesis` VALUES ('401', '1', '3', 'PC端网页在移动android端显示的转码系统的设计与实现', '应用软件开发', '科研项目', '应用研究', '<p>设计并实现一个能将PC端网页在移动android端完美显示的转码系统。</p>\r\n\r\n<p>要求能完成多种类型的pc网页转码显示 &nbsp;并保留相同的网页交互功能和访问体验</p>', '1', '236', null, null, '2017-04-10 00:00:00', '0', '1', '2016-10-16 18:58:15', '2016-10-16 18:58:15');
INSERT INTO `thesis` VALUES ('402', '1', '3', '农资移动电商平台的研发与优化', '应用软件开发', '生产实践', '应用研究', '<p>农资移动电商平台的研发与优化</p>', '1', '253', '321', null, '2017-04-23 00:00:00', '0', '1', '2016-10-16 19:23:41', '2016-10-16 19:23:41');
INSERT INTO `thesis` VALUES ('403', '1', '3', '基于B2C的可溯源移动电商APP', '应用软件开发', '科研项目', '应用研究', '<p>基于B2C的可溯源移动电商APP</p>', '1', '253', '308', null, '2017-04-23 00:00:00', '0', '1', '2016-10-16 19:55:39', '2016-10-16 19:55:39');
INSERT INTO `thesis` VALUES ('404', '1', '3', '游戏渲染技术的研究与实现', '计算机图形学', '其他', '应用研究', '<p>游戏引擎是一个处理游戏底层技术的平台,使用游戏引擎,游戏开发人员可以不用花过多精力去处理系统架构、内存管理、图形渲染等一些底层的技术,可以直接使用引擎提供的API来进行游戏开发,从而大大缩短游戏开发时间。</p>', '1', '229', '401', null, '2017-04-23 00:00:00', '0', '1', '2016-10-16 20:36:10', '2016-10-16 21:34:09');
INSERT INTO `thesis` VALUES ('406', '1', '3', '基于java web 酒店客房管理系统设计与实现', '应用软件开发', '其他', '设计性', '<p>一、系统功能：</p>\r\n\r\n<p>客房预订系统：可以处理散客预订、团体预订、客房预订、预订未到处理、预售查询等事务。 <br />\r\n前台接待系统：可以处理散客入住登记，合约入住，团体入住和手动入住，补填客单修改客人信息、转房、调房、设置房态、客人留言，预订客房查询、可售客房查询等事务。<br />\r\n前台收银系统：处理记账、买单、限制客人消费、退房、押金加入、查账、转账、设置跑单、可用保险管理、团体买单及退房业务。<br />\r\n账务系统：除具有收银功能外，还具有纠错、报表输出等功能。<br />\r\n客房管理：可设置净房、脏房、坏房及取消坏房，设置SKIP房、SLEEP房，查询房态等业务。<br />\r\n经理系统：可修改客房定价，增加、删除、修改各级密码，个性特别客单，设置系统参 数，内部银行系统，数据整理，自我诊断，数据备份。<br />\r\n客户管理：能处理客人手工、自动输入，客人资料查询与修改，黑名单，入住客人自动查询客历、入住客人自动归入客历。  <br />\r\n财务系统：主要是处理酒店的日常的账务报表，有收入报表（前台收入明细表、现付收 入明细表）、消费报表、顾客账务（住房账务、离店客人账务各跑单账务）、酒店总表。</p>\r\n\r\n<p>二、开发工具</p>\r\n\r\n<p>进行方式：采用JSP、JavaScript等进行前台页面的编写，运用Java、SQL Server等进行后台开发。</p>', '1', '240', '531', null, '2017-04-23 00:00:00', '0', '1', '2016-10-16 20:46:32', '2016-10-18 22:22:32');
INSERT INTO `thesis` VALUES ('407', '1', '3', '视频色调矫正技术研究与实现', '数字图像处理', '科研项目', '应用研究', '<p>在光线不理想的情况下录制的视频效果不理想，整体偏暗、偏亮或者出现色差，该论文的目的是对这样的色调做矫</p>', '1', '229', null, null, '2017-04-23 00:00:00', '0', '1', '2016-10-16 20:48:11', '2016-10-16 21:33:49');
INSERT INTO `thesis` VALUES ('408', '1', '3', '基于JavaScript的超市管理系统设计与实现', '应用软件开发', '其他', '设计性', '<p>一、功能描述</p>\r\n\r\n<p>包括基本的员工信息，进货信息，库存信息，商品信息，销售信息等基本数据表。<br />\r\n管理员能管理进货员，销售员，仓库管理员等员工的信息，负责商品的上架与下架，可以查询进货，销售清单，营业额等营业信息。制定进货计划。<br />\r\n进货员根据管理员制定的进货计划进行进货。<br />\r\n销售员负责销售盘点，还可查询商品位置分布。<br />\r\n仓库管理员负责将商品分仓（如冷冻仓库），盘点和报损，当仓库满时会出现库存警告。<br />\r\n运用数据挖掘中的关联规则方法，根据销售情况，分析商品最佳搭配位置。由管理员决定商品位置。</p>\r\n\r\n<p>二、开发方法</p>\r\n\r\n<p>采用JSP、JavaScript等进行前台页面的编写，运用Java、SQL Server等进行后台开发；</p>', '1', '240', '544', null, '2017-04-23 00:00:00', '0', '1', '2016-10-16 20:49:14', '2016-10-18 21:54:35');
INSERT INTO `thesis` VALUES ('409', '1', '3', '基于Java script 的网上购书系统设计与实现', '应用软件开发', '其他', '设计性', '<p>一、功能描述</p>\r\n\r\n<p>系统具备多类型用户：普通用户和图书管理员。<br />\r\n用户模块包括用户登录、注册，用户网上 浏览图书，网上购书，用户登录网站主页时可以选择图书分类列表，浏览图书信息，搜索图书，当用户要购买图书时需要注册或登录，登录后用户可以修改自己的信息，浏览自己的购物车，用户选中图书后可以添加到购物车，结算后生成订单。<br />\r\n系统可以根据用户购买的情况推荐书籍。<br />\r\n管理员模块包括对图书的购进，库存管理，设置、更新读者信息评论，图书信息查询，订单管理。 管理员登录网站可以对用户信息及商品图书进行增、删、改、查，且可以修改自己的信息。</p>\r\n\r\n<p>二、开发方法</p>\r\n\r\n<p>采用JSP、JavaScript等进行前台页面的编写，运用Java、SQL Server等相关数据库开发语言进行后台开发；</p>', '1', '240', '545', null, '2017-04-23 00:00:00', '0', '1', '2016-10-16 20:53:04', '2016-10-18 21:47:18');
INSERT INTO `thesis` VALUES ('410', '1', '3', '小型购物APP设计与实现', '应用软件开发', '其他', '设计性', '<p>一、功能描述</p>\r\n\r\n<p>系统具备多类型用户：经理-管理员-普通用户<br />\r\n经理：管理员和用户信息管理（包括级别变更），采购管理，商品信息管理，库存查询及报警，保质期查询及报警，查看用户订单信息，数据统计，数据分析等。<br />\r\n管理员：用户信息管理，商品信息管理，供应商管理，查看用户订单信息。<br />\r\n用户：浏览及购买商品，查看购物车，查看订单，修改个人信息。<br />\r\n二、开发方法</p>\r\n\r\n<p><span style=\"color:#ff0000\"><strong>说明: &nbsp;选择该题目的同学可与老师沟通后对题目做相应修改或调整!</strong></span></p>', '1', '240', '645', null, '2017-04-23 00:00:00', '0', '1', '2016-10-16 20:56:48', '2016-10-19 08:50:50');
INSERT INTO `thesis` VALUES ('411', '1', '3', '基于Java script 的学生宿舍管理系统的设计与实现', '应用软件开发', '其他', '设计性', '<p>本系统能为高校学生公寓的管理提供了一个强大的信息化手段。应有友好用户界面，操作简便人性化，功能完善。只有合法用户才能通过用户名及密码登陆系统。如果以管理员的身份登陆系统，系统可以显示上次登陆时间，或者用短信的方式通知管理员本人，防止非法登陆。系统应具备完善的公寓管理功能，具体包括宿舍信息添加功能， 宿舍信息浏览管理，本公寓管理系统提供了根据“已住人数少于等于”，“已住人数大于等于”，“已住人数等于”，“已住人数不等于”，楼层、楼号、房间等条件进行查询的功能。查询结果可以分页显示，也可以直观的图形方式查看，每个宿舍入住情况。可以编辑宿舍信息，可以删除宿舍。学生基本信息添加， 基本信息浏览功能，提供了根据学生姓名、性别、学号、宿舍等多条件查询学生信息。查询结果可以进行分页显示，同时可以指定每页显示的条数。对查询结果提供了编辑和删除的功能。 学生信息可以自动导入，然后系统自动根据学生的性别、年级、专业和班级对学生分配宿舍。外来人员访问添加，增加外人访问记录，具体包括来访者姓名、身份证号码、被访者姓名、房间号、进入时间、离开时间。 外来人员访问记录查询，可以根据来访者姓名、被访者姓名、被访者房间号查询访客记录。结果同样可以分页显示以及可以编辑和删除。 物品出入登记，记录从宿舍楼中搬出的物品记录；同时提供了修改、删除和查询功能。 卫生检查评分管理，可以为宿舍进行评分，同时提供了查询功能、编辑功能和删除功能。 报修信息添加，记录宿舍报修信息；报修信息查询，可以根据宿舍号、保修者等条件查询宿舍报修记录。 送水记录添加，记录了宿舍送水信息；查询宿舍送水历史记录，可以修改和删除送水记录；水电费缴纳情况。<br />\r\n3）用户设置管理功能：本模块负责添加用户、设置用户访问权限、修改用户信息和删除用户功能的实现。<br />\r\n4）数据库管理：具体包括数据库的备份；数据库恢复；数据库压缩功能。</p>', '1', '240', '614', null, '2017-04-23 00:00:00', '0', '1', '2016-10-16 21:00:09', '2016-10-17 11:04:48');
INSERT INTO `thesis` VALUES ('412', '1', '3', '基于Java scritp的有机食品销售系统的设计与实现', '应用软件开发', '其他', '设计性', '<p>（1）具有一般销售系统的基本功能，包括产品展示，管理，采购，销售，库存；及销售量、销售金额的统计等，还应该包括有机食品独有的特点，包含食品的保质期维护，食品的回溯体系。</p>\r\n\r\n<p>（2）进行方式：采用JSP、DIV+CSS、JavaScript等进行前台页面的编写，运用Java、SQL Server等进行后台开发和进行前、后台的数据连接。</p>', '1', '240', '556', null, '2017-04-23 00:00:00', '0', '1', '2016-10-16 21:02:19', '2016-10-18 22:09:26');
INSERT INTO `thesis` VALUES ('413', '1', '3', '华农淘系统的设计与实现', '应用软件开发', '其他', '设计性', '<p>（1）功能描述：包括了用户的基本信息，商品信息。管理员（web端）可以管理修改商品信息，管理用户权限，查看数据以及删除用户发布不合法内容。普通用户可以在APP端登录、查看、搜索、收藏、购买商品以及留言评论，也可以把自己多余而他人需要的东西发布上去，也可查看历史订单。</p>\r\n\r\n<p>（2）开发方式：采用JSP、DIV+CSS、JavaScript等进行前台页面的编写，运用Java、SQL Server等进行后台开发和进行前、后台的数据连接。</p>\r\n\r\n<p> </p>\r\n\r\n<p> </p>', '1', '240', '616', null, '2017-04-23 00:00:00', '0', '1', '2016-10-16 21:04:24', '2016-10-19 09:34:26');
INSERT INTO `thesis` VALUES ('414', '1', '3', '基于Java script的物流信息管理系统的设计与实现', '应用软件开发', '其他', '设计性', '<p>（1）功能描述：用户管理( 实现对客户用户、企业用户、管理员用户信息的管理功能)、运单管理（实现录入订单信息、审批订单信息的功能）、出入库管理（入库：实现签收货物、货物入库信息管理的功能； 出库：实现货物转送、装配车辆、客户提货、货物签收信息管理的功能）、运输配送管理（实现发车确认、签收确认、财务核对的功能）、基本信息统计查询（年、月、日总订单统计；地区总订单统计；运单查询；出入库查询；货损、货差查询；）</p>\r\n\r\n<p>（2）进行方式：采用JSP、DIV+CSS、JavaScript等进行前台页面的编写，运用Java、SQL Server等进行后台开发和进行前、后台的数据连接。</p>', '1', '240', '546', null, '2017-04-23 00:00:00', '0', '1', '2016-10-16 21:07:29', '2016-10-18 22:12:47');
INSERT INTO `thesis` VALUES ('415', '1', '3', '基于Spring MVC的自助餐厅管理系统的设计与实现', '应用软件开发', '其他', '设计性', '<p>（1）功能描述：本自助餐厅管理系统的用户是中小型参观，它集结账管理，报表管理，菜品管理系统等强大功能于一身，操作者登陆之后，可以为用户提供餐位管理（包间和大厅桌位管理）以及营业状况查询等功能实现。</p>\r\n\r\n<p>菜品管理模块：对系统的菜品进行搜索、添加、修改、设定有效状态操作。</p>\r\n\r\n<p>食材管理模块：对食材的添加、修改、设定有效状态、搜索、操作。</p>\r\n\r\n<p>桌台管理模块：可进行桌台的添加、修改、设定有效状态、搜索操作</p>\r\n\r\n<p>下单管理模块：下单管理包括桌位开单功能、桌位加菜功能。</p>\r\n\r\n<p>结账模块：供管理员查看桌台和订单的付款信息，并标记桌台和订单的结账状态，方便服务员跟踪订单信息。</p>\r\n\r\n<p>报表模块：供管理员查看店里各个菜品的销售情况数据，以便进行菜品的统计分析。主要是通过Oracle的视图对菜品表、订单信息表、订单明细表这三个表的菜品名称、下单时间、销售数量数据进行数据的统计。</p>\r\n\r\n<p>（2）进行方式：利用MyEclipse+Oracle开发工具，以及SpringMVC、easyUI框架技术，还有运用JavaScript、JavaWeb、div+css语言进行项目设计。</p>', '1', '240', '503', null, '2017-04-23 00:00:00', '0', '1', '2016-10-16 21:10:46', '2016-10-18 21:21:27');
INSERT INTO `thesis` VALUES ('416', '1', '3', '基于Java web的企业工资管理系统的设计与实现', '应用软件开发', '其他', '设计性', '<p>一、任务描述</p>\r\n\r\n<p>1、基础信息管理，包括：部门管理、岗位管理、员工信息管理；</p>\r\n\r\n<p>主要功能：描述企业工资系统的基础信息维护管理描述组织中的部门信息，以及部门的上下级关系。主要用于定位部门，可以定位的条件包括部门编号，名称，类型，用于新建、修改、删除一个部门；描述组织中的岗位信息，以及岗位的编制信息。新建、修改、删除一个岗位，描述组织中的岗位信息，以及岗位的编制信息。定位部门，可以定位的条件包括部门编号，名称，类型，用于新建、修改、删除一个员工信息。</p>\r\n\r\n<p>2、工资管理，包括：工资项目管理、固定工资维护、导入数据录入、</p>\r\n\r\n<p>描述企业工资系统的工资相关信息管理，描述工资项目的维护管理，显示所有的工资项目，用于增加、修改、删除一个工资项目，描述员工固定工资信息的维护管理，查询员工的固定工资信息，查询条件部门名、员工编号，查询员工的考勤信息或者补发等导入项目数据，查询条件部门名、员工编号、开始日期、结束日期，用于批量维护某个部门的员工的考勤信息或者补发等导入项目数据，描述某个部门的员工的各个工资项目的工资的批量计算、批量保存计算出的员工的工资、批量修改工资的状态，发放后的工资不能再进行结算或者修改。</p>\r\n\r\n<p>二、进行方式：采用JSP、DIV+CSS、JavaScript等进行前台页面的编写，运用Java、SQL Server等进行后台开发和进行前、后台的数据连接。</p>', '1', '240', '501', null, '2017-04-23 00:00:00', '0', '1', '2016-10-16 21:19:55', '2016-10-17 11:03:09');
INSERT INTO `thesis` VALUES ('417', '1', '3', '基于web 的选课系统设计与实现', '应用软件开发', '其他', '设计性', '<p>随着web2.0的日益发展与成熟，web系统影响了我们的生活，使用者关心的是便利性、良好的安全性和避免和减少各种错误的发生。选课系统的符合上述特点，所以选择web来开发选课系统。该系统主要为学生提供选课功能。系统基于web服务器，用户只需通过任何一个主流浏览器软件即可进行登录等操作。</p>\r\n\r\n<p>所有用户使用系统均需要登录，并且以不同的角色登录拥有不同的权限操作。教师提供课程和课程信息，并且能查看选该老师的课的学生信息；管理员负责管理用户、审核课程和维护系统；学生按照学校规定进行选课，也是主要难点，获取自身的课程表，并且限制冲突的选修课程。</p>\r\n\r\n<p>开发环境：WAMP（即Windows7+Apache服务器+MySql数据库+PHP）。</p>\r\n\r\n<p>前端开发技术：html、css、javascript、jQuery，前台包括浏览器端的页面与用户交互。</p>\r\n\r\n<p>后端开发技术：PHP5、Ajax、ThinkPHP、后端包括操作数据和动态的页面信息。</p>', '1', '240', '386', null, '2017-04-23 00:00:00', '0', '1', '2016-10-16 21:22:11', '2016-10-18 21:18:43');
INSERT INTO `thesis` VALUES ('418', '1', '3', '基于web的企业物资管理系统设计与实现', '应用软件开发', '其他', '设计性', '<p>企业物资管理系统是为了将企业物资管理人工化走向信息化，本系统难度适中，系统的使用者包括管理员、采购员、普通用户三种，每一种用户的功能如下：</p>\r\n\r\n<p>管理员：户密码修改、供应商管理、人员管理、部门管理、物资管理、库存警告、物资类别管理、物资申请记录、物资报损记录、物资库存盘点。</p>\r\n\r\n<p>采购员：责修改密码、物资类别管理、物资库存管理、库存警告、物资申请记录、物资报损记录、库存盘点。</p>\r\n\r\n<p>普通用户：修改密码、物资查看、物资申请、物资报损。</p>\r\n\r\n<p>企业物资管理系统是一个典型数据库应用程序，使用java编程语言在MyEclipse等开发环境下开发前台，采用了MySQL数据库实现后台设计和开发，能提供人性化的操作界面，方便的操作模式，使用者能够快速入手并且熟练的使用，最后经过系统的测试使系统能够正常使用。</p>', '1', '240', '388', null, '2017-04-23 00:00:00', '0', '1', '2016-10-16 21:25:12', '2016-10-18 22:18:25');
INSERT INTO `thesis` VALUES ('419', '1', '3', '图像分割技术研究与实现', '数字图像处理', '科研项目', '基础研究', '<p>图像分割是图像处理的经典问题，本文拟探讨一种特殊输入的图像分割技术</p>', '1', '229', null, null, '2017-04-23 00:00:00', '0', '1', '2016-10-16 21:28:25', '2016-10-16 21:28:25');
INSERT INTO `thesis` VALUES ('420', '1', '3', '拼图游戏设计与实现', '计算机图形学', '科研项目', '基础研究', '', '1', '229', null, null, '2017-04-23 00:00:00', '0', '1', '2016-10-16 21:35:58', '2016-10-16 21:35:58');
INSERT INTO `thesis` VALUES ('421', '1', '3', '图像高光去除', '数字图像处理', '科研项目', '基础研究', '<p>有时拍摄的照片存在高光区域，对这样的区域做</p>', '1', '229', null, null, '2017-04-23 00:00:00', '0', '1', '2016-10-16 21:38:52', '2016-10-16 21:38:52');
INSERT INTO `thesis` VALUES ('422', '1', '3', '基于微信公众号的代驾预约系统', '应用软件开发', '生产实践', '应用研究', '<p>基于微信公众号的代驾预约系统</p>', '1', '264', '393', null, '2017-05-20 00:00:00', '0', '1', '2016-10-16 21:40:42', '2016-10-18 21:22:04');
INSERT INTO `thesis` VALUES ('423', '1', '3', '酒店餐厅订餐管理系统', '应用软件开发', '生产实践', '应用研究', '<p>设计一套包括订餐、食材、会员、收费管理等功能</p>', '1', '264', '380', null, '2017-05-20 00:00:00', '0', '1', '2016-10-16 21:45:04', '2016-10-18 20:26:38');
INSERT INTO `thesis` VALUES ('424', '1', '3', '基于kinect的三维重建', '计算机图形学', '科研项目', '基础研究', '<p>三维重建是增强现实(AR)的一个重要研究内容，是目前的一个</p>', '1', '229', null, null, '2017-04-23 00:00:00', '0', '1', '2016-10-16 21:45:11', '2016-10-16 21:45:11');
INSERT INTO `thesis` VALUES ('425', '1', '3', '基于微信公众号的上班考勤系统设计', '应用软件开发', '生产实践', '应用研究', '<p>设套计一基于微信公众号的上班考勤系统</p>', '1', '264', '394', null, '2017-05-20 00:00:00', '0', '1', '2016-10-16 21:48:37', '2016-10-18 20:41:46');
INSERT INTO `thesis` VALUES ('426', '1', '3', '基于kinect的纹理贴图', '数字图像处理', '科研项目', '基础研究', '<p>三维重建是增强现实(AR)的一个重要研究内容，是目前的热点问题。本论文研究与实现kinect的纹理贴图</p>', '1', '229', null, null, '2017-04-23 00:00:00', '0', '1', '2016-10-16 21:49:06', '2016-10-16 21:57:27');
INSERT INTO `thesis` VALUES ('427', '1', '3', '基于 Kinect 的数据采集和数据处理', '计算机图形学', '科研项目', '基础研究', '<p>三维重建是增强现实(AR)的一个重要研究内容，是目前的一个</p>', '1', '229', null, null, '2017-04-23 00:00:00', '0', '1', '2016-10-16 21:52:57', '2016-10-17 14:26:37');
INSERT INTO `thesis` VALUES ('428', '1', '3', '3D 深度数据的精度优化', '计算机图形学', '科研项目', '基础研究', '<p>三维重建是增强现实(AR)的一个重要研究内容，是目前的研究热点，本文对Kinect获取的三维深度数据</p>', '1', '229', null, null, '2017-04-23 00:00:00', '0', '1', '2016-10-16 21:57:12', '2016-10-16 21:57:12');
INSERT INTO `thesis` VALUES ('429', '1', '3', '高校二手书城智能推送平台', '应用软件开发', '生产实践', '应用研究', '<p>设计一个高校二手书城智能推送平台，使得低年级的学生可以快捷的在平台上免费或低价买到需要的二手教材和复习资料</p>', '1', '264', '395', null, '2017-05-20 00:00:00', '0', '1', '2016-10-16 22:01:33', '2016-10-18 20:59:37');
INSERT INTO `thesis` VALUES ('430', '1', '3', '基于web的社区自助餐订餐系统', '应用软件开发', '生产实践', '应用研究', '<p>基于web的社区自助餐订餐系统</p>', '1', '264', '384', null, '2017-05-20 00:00:00', '0', '1', '2016-10-16 22:05:10', '2016-10-18 21:40:52');
INSERT INTO `thesis` VALUES ('431', '1', '3', '基于web的停车场管理系统', '应用软件开发', '生产实践', '应用研究', '<p>设计一个基于web的停车场管理系统，自动计算空车位数等信息</p>', '1', '264', '376', null, '2017-05-20 00:00:00', '0', '1', '2016-10-16 22:07:22', '2016-10-18 20:37:42');
INSERT INTO `thesis` VALUES ('432', '1', '3', '基于web的电子商务网站设计与实现', '应用软件开发', '生产实践', '应用研究', '<p>设计一个基于web的电子商务网站</p>', '1', '264', '389', null, '2017-05-20 00:00:00', '0', '1', '2016-10-16 22:09:45', '2016-10-18 22:15:10');
INSERT INTO `thesis` VALUES ('433', '1', '3', '基于APP的人才招聘热线管理平台', '应用软件开发', '生产实践', '应用研究', '<p>设计一个基于APP的人才招聘热线管理平台，包括应聘和招聘的信息等内容</p>', '1', '264', '390', null, '2017-05-20 00:00:00', '0', '1', '2016-10-16 22:13:29', '2016-10-18 20:44:02');
INSERT INTO `thesis` VALUES ('434', '1', '3', '基于eclipse的移动微车票系统', '应用软件开发', '生产实践', '应用研究', '<p>设计一个基于eclipse的移动微车票系统，包括查询车次、购票等功能</p>', '1', '264', '392', null, '2017-05-20 00:00:00', '0', '1', '2016-10-16 22:17:22', '2016-10-18 20:34:47');
INSERT INTO `thesis` VALUES ('435', '1', '3', '计算机网络安全概论网络课程设计与实现', '应用软件开发', '生产实践', '应用研究', '<p>包括但不限于下列基本要求： （1）了解网络课程开发主要技术及其原理，学习教学设计相关理论；（2）以计算机网络安全概论内容为例，通过广泛搜集、整理相关资源与在线课程，构建一个计算机网络安全概论网络课程，供大学一年级学生进行基于网络的自主学习。（3）使用概念图对知识进行整理，并能够点击概念节点跳转相关网页。（4）提供在线的即时反馈的练习；（5）对大学一年级网络安全知识有一定的扩展，例如给出一个计算机网络安全方面的项目实施案例，包括需要的基础知识准备，或进一步学习概念图指引。</p>', '1', '258', '512', null, '2017-05-20 00:00:00', '0', '1', '2016-10-16 22:18:02', '2016-10-18 20:09:56');
INSERT INTO `thesis` VALUES ('436', '1', '3', '基于Node.js的组网与因特网在线学习系统的设计与实现', '应用软件开发', '生产实践', '应用研究', '<p>包括但不限于下列基本要求： （1）了解在线学习系统开发主要技术及其原理，学习教学设计相关理论；（2）以组网与因特网内容为例，通过广泛搜集、整理相关资源与在线课程，构建一个组网与因特网网络课程，供大学一年级学生进行基于网络的自主学习。（3）使用概念图对知识进行整理，并能够点击概念节点跳转相关网页。（4）提供在线的即时反馈的练习；（5）对大学一年级组网与因特网知识有一定的扩展，例如给出一个Web项目实施案例，包括需要的基础知识准备，或进一步学习概念图指引。</p>', '1', '258', '529', null, '2017-05-20 00:00:00', '0', '1', '2016-10-16 22:19:01', '2016-10-18 20:09:26');
INSERT INTO `thesis` VALUES ('437', '1', '3', '基于HTML5的算法基础在线学习系统', '应用软件开发', '生产实践', '应用研究', '<p>包括但不限于下列基本要求： （1）了解在线学习系统开发主要技术及其原理，学习教学设计相关理论；（2）以算法基础内容为例，通过广泛搜集、整理相关资源与在线课程，构建一个组网与因特网网络课程，供大学一年级学生进行基于网络的自主学习。（3）使用概念图对知识进行整理，并能够点击概念节点跳转相关网页。（4）提供在线的即时反馈的练习；（5）对大学一年级算法基础知识有一定的扩展，例如给出算法基础进一步学习概念图指引。</p>', '1', '258', '533', null, '2017-05-20 00:00:00', '0', '1', '2016-10-16 22:20:06', '2016-10-18 20:08:58');
INSERT INTO `thesis` VALUES ('438', '1', '3', '数据结构计算机辅助教学系统', '应用软件开发', '生产实践', '应用研究', '<p>包括但不限于下列基本要求： （1）了解计算机辅助教学系统系统开发主要技术及其原理，学习教学设计相关理论；（2）以数据结构内容为例，通过广泛搜集、整理相关资源与在线课程，构建一个数据结构网络课程，供大学一年级学生进行基于网络的自主学习。（3）使用概念图对知识进行整理，并能够点击概念节点跳转相关网页。（4）提供在线的即时反馈的练习；（5）对大学一年级数据结构知识有一定的扩展，例如给出图的基础，或进一步学习概念图指引。</p>', '1', '258', '536', null, '2017-05-20 00:00:00', '0', '1', '2016-10-16 22:21:05', '2016-10-18 20:08:28');
INSERT INTO `thesis` VALUES ('439', '1', '3', '基于移动APP的学生上课考勤系统', '应用软件开发', '生产实践', '应用研究', '<p>设计一个基于JS的数据建模设计方法和可视化方法</p>', '1', '264', '379', null, '2017-05-20 00:00:00', '0', '1', '2016-10-16 22:21:32', '2016-10-18 20:51:35');
INSERT INTO `thesis` VALUES ('440', '1', '3', '淘淘二手市场', '应用软件开发', '生产实践', '应用研究', '<p>包括但不限于下列基本要求：（1）了解web程序开发主要技术及其原理；（2）使用面向对象的方法与工具，对淘淘二手市场系统进行清晰的需求分析与系统设计；（3）应用web开发技术完成淘淘二手市场系统的实现；</p>', '1', '258', '543', null, '2017-05-20 00:00:00', '0', '1', '2016-10-16 22:21:54', '2016-10-18 20:07:54');
INSERT INTO `thesis` VALUES ('441', '1', '3', '电建宝系统需求分析与交互设计', '应用软件开发', '生产实践', '设计性', '<p>包括但不限于下列基本要求：（1）了解需求分析理论，并用于对需求分析的应用进行指导；（2）了解人机交互理论在交互设计中的应用，并用于对交互设计进行指导。（3）能够明确阐述理论在实践中的应用。（4）给出清晰的分析、设计过程及其产出，以及最后的设计图。最终能够将知识迁移到后续开展其他类似系统分析与交互设计中。</p>', '1', '258', '550', null, '2017-05-20 00:00:00', '0', '1', '2016-10-16 22:22:55', '2016-10-18 20:07:25');
INSERT INTO `thesis` VALUES ('442', '1', '3', '电建协同管理系统前端开发', '应用软件开发', '生产实践', '应用研究', '<p>包括但不限于下列基本要求：（1）了解前端开发主要技术及其原理；（2）使用面向对象的方法与工具，对电建协同管理系统进行清晰的需求分析与系统设计；（3）应用前端开发技术完成电建协同管理系统的前端程序的实现；</p>', '1', '258', '563', null, '2017-05-20 00:00:00', '0', '1', '2016-10-16 22:23:40', '2016-10-18 20:06:53');
INSERT INTO `thesis` VALUES ('443', '1', '3', '基于MEAN架构的学生课后作业辅助系统', '应用软件开发', '生产实践', '应用研究', '<p>包括但不限于下列基本要求：（1）了解MEAN架构开发主要技术及其原理；（2）使用面向对象的方法与工具，对学生课后作业辅助系统进行清晰的需求分析与系统设计；（3）应用MEAN架构开发技术完成学生课后作业辅助系统的实现；</p>', '1', '258', '452', null, '2017-05-20 00:00:00', '0', '1', '2016-10-16 22:24:26', '2016-10-18 20:06:21');
INSERT INTO `thesis` VALUES ('444', '1', '3', '基于asp.net mvc的网站设计', '应用软件开发', '生产实践', '应用研究', '<p>基于asp.net mvc的网站设计</p>', '1', '264', '391', null, '2017-05-20 00:00:00', '0', '1', '2016-10-16 22:25:00', '2016-10-18 21:14:01');
INSERT INTO `thesis` VALUES ('445', '1', '3', '基于php的农产品电商系统', '应用软件开发', '生产实践', '应用研究', '<p>包括但不限于下列基本要求：（1）了解PHP程序开发主要技术及其原理；（2）使用面向对象的方法与工具，对农产品电商系统进行清晰的需求分析与系统设计；（3）应用PHP程序开发技术完成农产品电商系统的实现；</p>', '1', '258', '457', null, '2017-05-20 00:00:00', '0', '1', '2016-10-16 22:25:14', '2016-10-18 20:05:32');
INSERT INTO `thesis` VALUES ('446', '1', '3', '基于概念图的金融学专题学习网站', '应用软件开发', '生产实践', '应用研究', '<p>包括但不限于下列基本要求：（1）了解概念图理论以及前端开发主要技术及其原理；（2）使用概念图理论与工具，对金融学本科专业知识进行系统整理，画出清晰的概念图；（3）利用前端开发技术，以概念图为基础，辅以搜集与整理的金融学相关资源与在线课程，实现一个专题学习网站，供金融学本科专业学生进行基于网络的自主学习；</p>', '1', '258', '458', null, '2017-05-20 00:00:00', '0', '1', '2016-10-16 22:26:03', '2016-10-18 20:05:00');
INSERT INTO `thesis` VALUES ('447', '1', '3', '基于Java web的金融信息分享平台', '应用软件开发', '生产实践', '基础研究', '<p>包括但不限于下列基本要求：（1）了解Java web程序开发主要技术及其原理；（2）使用面向对象的方法与工具，对金融信息分享平台进行清晰的需求分析与系统设计；（3）应用Java web程序开发技术完成金融信息分享平台的实现；<br />\r\n </p>', '1', '258', '459', null, '2017-05-20 00:00:00', '0', '1', '2016-10-16 22:26:47', '2016-10-18 20:04:22');
INSERT INTO `thesis` VALUES ('448', '1', '3', '基于微商城的电子商务网站设计', '应用软件开发', '生产实践', '应用研究', '<p>基于微商城的电子商务网站设计</p>', '1', '264', '463', null, '2017-05-20 00:00:00', '0', '1', '2016-10-16 22:30:47', '2016-10-19 21:04:38');
INSERT INTO `thesis` VALUES ('449', '2', '1', '多自由度肌电动作识别分类算法研究', '论文类', '学生创新项目', '毕业论文', '', '1', '13', '31', null, '2016-10-16 00:00:00', '0', '1', '2016-10-16 23:18:55', '2016-10-17 08:41:33');
INSERT INTO `thesis` VALUES ('450', '1', '3', '基于ssm的校园共享平台的设计与实现', '应用软件开发', '生产实践', '应用研究', '<p>利用ssm框架设计并实现校园共享平台。该平台主要用于给学生分享／互换／出租自己闲置的东西，比如：书籍，自行车，电器等。需要搭建一个web网站能够浏览查看分享的内容，除了这些基本功能外，还需要考虑加入身份认证，双向选择机制，信誉度机制等，来防止恶意用户只借不还。</p>\r\n\r\n<p>当然，还可以对内容进行扩充。</p>', '1', '275', '624', null, '2017-05-20 00:00:00', '0', '1', '2016-10-17 00:12:20', '2016-10-19 19:19:43');
INSERT INTO `thesis` VALUES ('451', '1', '3', '基于ssm的综测管理系统的设计与实现', '应用软件开发', '生产实践', '应用研究', '<p>学校的综合测评一直都是通过人工纸质的方式进行着，每年到了综合测评的评比，我们总是为参加过的活动加分或者得到过的个人荣誉而烦恼。同时，综合测评的审核过程也不够公开透明，流程也过于繁琐。如果有一套综测管理系统，能够把整个学期的加分和个人荣誉管理起来，同时，简化学院审核过程，将大大减少学生会和辅导员的工作。</p>', '1', '275', '378', null, '2017-05-20 00:00:00', '0', '1', '2016-10-17 00:16:53', '2016-10-19 19:19:20');
INSERT INTO `thesis` VALUES ('452', '1', '3', '基于深度学习的人脸识别的研究与实现', '数字图像处理', '生产实践', '基础研究', '<p>利用深度学习技术，对人脸识别进行研究并应用。</p>', '1', '241', '286', null, '2017-04-30 00:00:00', '0', '1', '2016-10-17 00:35:24', '2016-10-17 00:35:24');
INSERT INTO `thesis` VALUES ('453', '1', '3', '移动平台双人即时通讯游戏', '应用软件开发', '生产实践', '基础研究', '<p>《光影之旅》是一款移动平台下的双人即时通讯游戏。当下的游戏很多都存在一个短板，很多游戏缺乏现实世界中玩家的互动性，往往玩家开始某个游戏一段时间后发现身边没有伙伴，对游戏出现乏味感，进而离开游戏。本游戏理念为增加现实中玩家在进行游戏时的互动性，达到跟现实中的伙伴一起娱乐的目的。通过蓝牙模块实现游戏的即时通讯功能，玩家可以在现实世界中通过互动沟通，共同研究游戏中某些场景的通过方式，同时，为增加游戏的趣味性，共同游戏的两名玩家所控制的游戏角色各自拥有不同的能力，玩家需要结合自身角色的能力来解决场景中的障碍。<br />\r\n本游戏分为通关模式和无限模式，通过模式中随关卡等级的递增，难度同时增加；而无限模式难度则随时间的推移而递增。两名玩家分别控制的角色为光子和影子，光子通过光照能决定影子的移动范围，而影子通过消除路上的障碍帮助光子前进。<br />\r\n游戏以Unity3D引擎为基础搭建场景，基于Android平台进行手游的开发。期间使用Shader技术对场景进行特效渲染，并通过蓝牙实现即时通讯功能达到玩家互动的目的。<br />\r\n主要涉及的技术有：Java、C#、Unity3D、Shader、Android、蓝牙通信、NFC近场通信</p>', '1', '220', '783', null, '2017-04-23 00:00:00', '0', '1', '2016-10-17 09:01:24', '2016-10-17 09:38:33');
INSERT INTO `thesis` VALUES ('454', '1', '3', '基于spark的电影推荐系统', '应用软件开发', '生产实践', '基础研究', '<p>研究SPARK技术，并运用于开源数据集MovieLens，在电影网站中实现推荐效果。</p>', '1', '220', '287', null, '2017-04-23 00:00:00', '0', '1', '2016-10-17 09:05:14', '2016-10-18 10:20:51');
INSERT INTO `thesis` VALUES ('455', '1', '3', '基于hadoop和mathout的电影推荐系统', '应用软件开发', '科研项目', '基础研究', '<p>研究基于HADOOP和MATHOUT的数据挖掘技术，并应用于电影网站的推荐系统中</p>', '1', '220', '432', null, '2017-04-23 00:00:00', '0', '1', '2016-10-17 09:12:18', '2016-10-17 16:53:50');
INSERT INTO `thesis` VALUES ('456', '1', '3', '基于PHP的物流配送管理系统', '应用软件开发', '科研项目', '基础研究', '<p>基于B/S结构的物流配送管理系统能够在网络平台上实现对系统的管理和维护，这不但降低了公司的运营成本呢，也大大提高了工作效率.本系统使用php5作为系统开发环境，使用mysql作为后台数据库，使用php语言的Web技术基于**框架的开发体系结构。</p>', '1', '220', '447', null, '2017-04-23 00:00:00', '0', '1', '2016-10-17 09:13:30', '2016-10-17 09:38:08');
INSERT INTO `thesis` VALUES ('457', '1', '3', '网站用户行为分析系统', '应用软件开发', '科研项目', '基础研究', '<p>研究hadoop生态系统应用，采用如flume或kafka技术采集用户访问网站的日志，对用户显示和隐式的行为进行统计分析。例如网页的UV,PV等统计指标，并以可视化的方式输出。</p>\r\n\r\n<p>&nbsp;</p>', '1', '220', '283', null, '2017-04-23 00:00:00', '0', '1', '2016-10-17 09:16:35', '2017-09-29 23:19:03');
INSERT INTO `thesis` VALUES ('458', '1', '3', '基于HTML5的新闻阅读Hybrid App', '应用软件开发', '科研项目', '基础研究', '<p>开发一个类似于今日头条（移动端：<a href=\"http://m.toutiao.com\">http://m.toutiao.com</a>）的新闻阅读WebApp ，用HTML5和相应的一些技术实现网页版的WebApp是主要的目标。同时还想采用Hybrid开发模式开发一个混合模式的移动应用。<br />\r\n </p>', '1', '220', '462', null, '2017-04-23 00:00:00', '0', '1', '2016-10-17 09:17:32', '2016-10-17 09:37:39');
INSERT INTO `thesis` VALUES ('459', '1', '3', '基于YII框架汽车门户网站', '应用软件开发', '科研项目', '基础研究', '<p>使用到PHP、HTML5和JAVASCRIPT以及<span style=\"display:none\"> </span>MYSQL数据库，采用YII框架开发。<br />\r\n具体参考澳洲最著名的汽车平台carsales：<a href=\"http://www.carsales.com.au/\">http://www.carsales.com.au/</a>和国内的太平洋汽车网：<a href=\"http://www.pcauto.com.cn/\">http://www.pcauto.com.cn/</a></p>', '1', '220', '415', null, '2017-04-23 00:00:00', '0', '1', '2016-10-17 09:19:50', '2016-10-17 09:36:11');
INSERT INTO `thesis` VALUES ('460', '1', '3', '基于Laravel框架的问答社区', '应用软件开发', '生产实践', '基础研究', '<p>研究lLaravel框架，实现一个问答社区，完成用户提出问题、回答问题、分享知识、搜索自己想要了解的知识等功能。<br />\r\n参考网站：天涯问答、知乎</p>', '1', '220', '409', null, '2017-04-23 00:00:00', '0', '1', '2016-10-17 09:21:31', '2016-10-17 09:37:02');
INSERT INTO `thesis` VALUES ('461', '1', '3', '理财点评顾问网站', '应用软件开发', '生产实践', '基础研究', '<p>随着移动智能手机的普及以及互联网金融的发展，互联网理财已成为新的理财潮流。各个平台上种类众多的理财产品让很多人难以决策选择，特别是对于想理财又还只是理财小白的人来说，所以我想做一个第三方理财顾问平台，不卖产品，恪守中立，可以说是一个金融理财方面的“大众点评”平台。旨在为大众提供客观的理财决策参考。<br />\r\n这个网站平台主要包括三大方面：理财文章的推送、理财产品信息的查询和与大众互动方面的理财产品的点评。</p>', '1', '220', '413', null, '2017-04-23 00:00:00', '0', '1', '2016-10-17 09:22:31', '2016-10-17 09:35:09');
INSERT INTO `thesis` VALUES ('462', '1', '3', '基于数字签名的选课系统设计与实现', '信息安全', '生产实践', '应用研究', '<p>目前许多学校对学生的选课采用纸质签名或直接在网上传输未经加密的学生成绩,系统安全性不高。针对此问题采用数字签名技术、B/S架构的方式来确保系统的数据完整性的同时保证数据的保密性、真实性、不可抵赖性等。系统实现了学生选课管理、课程管理、教师对选修课成绩的管理、公私钥对产生、签名验证等功能。</p>', '1', '202', null, null, '2016-04-10 00:00:00', '0', '1', '2016-10-17 09:29:08', '2016-10-17 09:29:08');
INSERT INTO `thesis` VALUES ('463', '1', '3', '多种题型考试系统设计与实现', '应用软件开发', '生产实践', '设计性', '<p>研究分析基于网络平台进行多题型课程无纸化考试的特点,利用熟悉技术实现了多用户环境下的收卷功能,并设计出通用、简捷安全的评分系统。</p>', '1', '202', '352', null, '2017-04-23 00:00:00', '0', '1', '2016-10-17 09:31:22', '2016-10-18 22:03:07');
INSERT INTO `thesis` VALUES ('464', '1', '3', '小区物业管理系统设计与实现', '应用软件开发', '生产实践', '设计性', '<p>设计一个小区物业管理系统，通过此系统最主要解决的是业主知情权，业主意见反映，物业及时为业主解决投诉意见，物业费用管理，水电气费的管理，业主水电气费与投诉意见的统计分析。物业管理人员可以通过统计分析示意图很快的知道每家业主历来用量和每个月业主每种投诉主题类型的总量，以至及时发现问题处理问题，提高物业公司的管理能力，为业主提供一个热情周到的服务。</p>', '1', '202', '366', null, '2017-04-23 00:00:00', '0', '1', '2016-10-17 09:36:25', '2016-10-18 22:01:09');
INSERT INTO `thesis` VALUES ('465', '1', '3', '在线就业求职与招聘系统的设计与实现', '应用软件开发', '生产实践', '设计性', '<p>论文的主要目标是为了完成用于求职以及企业招聘的平台,本系统涉及的技术平台为Internet技术,而平台中所涉及到有关于网页设计方面的构架知识均依照B/S模式进行开发,其中应用于网页平台开发的主要语言是ASP.NET,数据库使用的是SQL SERVER 2000。为了缓解现代人的就业压力以及企业的人力资源压力,一个完善的招聘就业平台可以有利于人才流动,本文将从软件需求、设计和开发等方面介绍该系统的实现以及构架思路;同时,将系统的功能优势简洁地介绍给人们。</p>', '1', '202', '369', null, '2017-04-23 00:00:00', '0', '1', '2016-10-17 09:38:01', '2016-10-18 21:57:51');
INSERT INTO `thesis` VALUES ('466', '1', '3', '基于WEB的设备管理系统的设计与实现', '应用软件开发', '生产实践', '设计性', '<p>设计一个<strong>基于WEB的设备管理系统，通过该平台实现设备采购申请、采购后的登记、极其今后的使用管理及维修、报废等模块，在安全技术上采用数据库访问最小特权策略对用户进行权限控制，把信息局限于工作实际需要的用户范围内；采用包过滤路由技术对内部局域网和服务器进出的IP 进行检查，实现对网络访问的安全控制；在服务器和INTERNET 之间采用硬件防火墙对信息过滤，对外部访问请求进行控制。</strong></p>', '1', '202', '422', null, '2017-04-23 00:00:00', '0', '1', '2016-10-17 09:44:48', '2016-10-17 09:44:48');
INSERT INTO `thesis` VALUES ('467', '1', '3', '在线投票选举系统的设计与实现', '信息安全', '其他', '应用研究', '<p>在线投票评选系统可以根据投票主题不同，可在多个候选项目中进行一个或多个投票，并能根据投票结果进行多种方式的统计，实现对投票信息的</p>\r\n\r\n<p>有效管理。主要模块包括：用户管理模块、投票主题管理模块、候选对象管理模块、投票模块、投票统计等。</p>', '1', '202', '444', null, '2017-04-23 00:00:00', '0', '1', '2016-10-17 09:46:36', '2016-10-17 09:46:36');
INSERT INTO `thesis` VALUES ('468', '1', '3', '医疗就诊预约挂号系统的开发与设计', '应用软件开发', '生产实践', '应用研究', '<p>挂号就医在许多大型医院里是比较困难的事情,医疗资源紧缺以及信息不对称给患者就诊带来了麻烦。预约挂号是解决此问题的一种有效办法,其主要目标是使患者不必到医院就能够根据医生的出诊情况预约就诊,从而合理分配资源。 本项目完成的主要工作如下： 实现了预约选号、取消预约、查询预约记录、预约号表维护等与挂号相关的各项功能及自动取消预约、自动生成预约黑名单等后台服务。 设计了合理的数据结构,建立了将门诊与网络预约数据统一管理的新数据模型,实现了预约号源的按计划管理,实现了门诊号源与预约号源的动态结合,适应了当前的业务流程,增强了医院管理人员管理预约挂号的能力。 引入了分时段预约的概念,在以“上午”、“下午”等午别区分预约时段的基础上,把预约时间细化到小时,并可以在午别范围内任意设置预约时段的起止时间和长度,从而达到了更好的分流患者、引导患者合理安排就诊时间的效果,使医院资源得以被充分而合理的利用。</p>', '1', '202', '360', null, '2017-04-23 00:00:00', '0', '1', '2016-10-17 09:49:27', '2016-10-18 21:52:58');
INSERT INTO `thesis` VALUES ('469', '1', '3', '药品进销存管理系统的设计与实现', '应用软件开发', '生产实践', '设计性', '<p>药品进销存管理系统可以实现药品商家的高效管理，还可以节约资源。通过集中式的信息数据库，将商家的进、销、存等经营业务有机的结合起来中，达到数据共享、降低成本、提高效率、改进服务等目的。本系统要求设计和实现对药品的进、销和存的功能，最后对系统进行了测试，能够满足型医药公司的需要，系统的操作简便、界面友好。</p>', '1', '202', '367', null, '2017-04-23 00:00:00', '0', '1', '2016-10-17 09:51:55', '2016-10-18 21:59:54');
INSERT INTO `thesis` VALUES ('470', '1', '3', '网上拍卖系统的设计与实现', '应用软件开发', '生产实践', '应用研究', '<p>本系统主要是设计一个网上拍卖系统，实现销售展示；商品发布；商品查询；购物车模块，拍卖结账等功能</p>', '1', '202', '588', null, '2017-04-23 00:00:00', '0', '1', '2016-10-17 09:52:36', '2016-10-17 09:52:36');
INSERT INTO `thesis` VALUES ('471', '1', '3', '基于JSP技术的新生报到管理系统设计与实现', '应用软件开发', '生产实践', '设计性', '<p>开发的新生报到管理系统具有的功能模块有用户的登录功能、迎新现场报到功能、事务管理功能、统计查询功能、系统管理功能、服务网管理功能六大功能模块。通过该系统功能应用最终实现了新生的信息化报到,实现了新生报到数据的分系、分专业的统计分析和上报,实现了采集了学生的基本资料信息,为学生档案数据和教务数据奠定了准确的基础数据。在通知书上使用二维码信息,完成自动扫描输入注册。</p>', '1', '202', '370', null, '2017-04-23 00:00:00', '0', '1', '2016-10-17 09:53:59', '2016-10-18 21:54:53');
INSERT INTO `thesis` VALUES ('472', '1', '3', '基于Android的手机定餐系统的设计与实现', '应用软件开发', '生产实践', '应用研究', '<p>设计主要研究无线点餐系统的基本功能和基于Android平台的软件开发、数据库的设计方法。通过对其需求分析和资源的规划,用户UI的交互界面精心设计,以及数据交互,设计最终达成了用户登录、点菜管理、餐桌管理、结账管理等点餐系统的基本功能。系统能够正常运行,各个页面交互性好。在系统规划中先后用数据流程图、系统功能结构图分析了系统所需的各种数据,详细地展现了系统的各个功能模块。 由于手机的不断普及,加上智能操作系统的不断应用,手机上可以实现越来越多的功能了,如果把无线点餐系统与手机结合起来,不仅能为商家节省硬件费用,更可以吸引年经用户自主地进行点餐,成为一个新的亮点。同时可以优化管理流程,提升服务和管理,提高品牌形象和行业核心竞争力。</p>', '1', '202', '609', null, '2017-04-23 00:00:00', '0', '1', '2016-10-17 09:55:28', '2016-10-17 09:55:28');
INSERT INTO `thesis` VALUES ('473', '1', '3', '基于Andriod的短信加密传输研究', '信息安全', '生产实践', '应用研究', '<p>为了解决这些手机用户短语短信内容的保密性的问题，本文设计了一个基于Android平台的手机短信加密软件。该软件通过对传统的短信封装协议进行分析，然后对传统的短信的结构进行重新组合和封装。该软件的加密方式是按块加密的，将短信的内容分开，将短信的域头和SMIL表述域作为一块，而将剩余的短信的附件内容作为另一块。这样做的优点主要由如下几点： （1）分开加密的方式可以将PDU包的数据分开，这样非法入侵者就不容易破解加密的方法； （2）对短信的关键内容采用了两层加密的方式，先采用置乱加密，然后采用AES加密，进一步加大破译的难度； （3）更改了现有的短信封装协议，将关键的加密长度等信息进入进来，这样就方便在解密的时候利用长度将各部分的额内容再合并在一起。 除了对短信的加密算法进行研究之外，本文还考虑了短信加密模块需要具备的其他功能。例如：短信的过滤、短信发送内容的实时监控等。这些功能和短信的加密算法结合在一起实现对多媒体短信的保护。 本文的最后对加密的短信加密软件的一些主要功能进行了测试，通过测试可以验证在加密软件中实现的各个功能是否正确和有效，测试证明加密软件能够实现对短信的PDU实现有效地加密，可以保证短信数据在传输过程中的安全性和保密性，但是该方法也是有缺陷的，就是需要管理需要使用的密钥，如何管理在本文中并没有探讨。</p>', '1', '202', null, null, '2017-04-23 00:00:00', '0', '1', '2016-10-17 09:57:40', '2016-10-17 09:57:40');
INSERT INTO `thesis` VALUES ('474', '1', '3', '基于计算机视觉技术的母猪母性行为识别', '应用软件开发', '科研项目', '基础研究', '<p>采用深度传感摄像设备拍摄的母猪产子后哺乳（30天内）的深度视频，利用图像检测技术对母猪母性的行为进行分析。</p>\r\n\r\n<p>联系邮箱：zheng.chan@163.com</p>', '1', '231', null, null, '2017-04-20 00:00:00', '0', '1', '2016-10-17 10:08:08', '2016-10-17 10:25:10');
INSERT INTO `thesis` VALUES ('475', '1', '3', '自主命题2', '应用软件开发', '科研项目', '基础研究', '<p>自主命题2</p>\r\n\r\n<p>联系邮箱：zheng.chan@163.com</p>', '1', '231', null, null, '2017-04-20 00:00:00', '0', '1', '2016-10-17 10:10:50', '2016-10-19 17:20:22');
INSERT INTO `thesis` VALUES ('476', '1', '3', 'html5游戏类的题-自主命题1', '应用软件开发', '科研项目', '基础研究', '<p>自主命题1</p>\r\n\r\n<p>联系邮箱：zheng.chan@163.com</p>', '1', '231', null, null, '2017-04-20 00:00:00', '0', '1', '2016-10-17 10:12:01', '2016-10-19 17:34:53');
INSERT INTO `thesis` VALUES ('477', '1', '3', '基于faster-rcnn的检测算法对母猪母性行为识别和分析', '应用软件开发', '科研项目', '基础研究', '<p>采用深度传感摄像设备拍摄的母猪产子后哺乳（30天内）的深度视频，利用图像检测技术faster-rcnn，对母猪母性的行为进行分析。</p>\r\n\r\n<p>联系邮箱：zheng.chan@163.com</p>', '1', '231', null, null, '2017-04-20 00:00:00', '0', '1', '2016-10-17 10:13:08', '2016-10-17 10:24:25');
INSERT INTO `thesis` VALUES ('478', '1', '3', '基于HTML5的跑酷游戏的实现', '应用软件开发', '科研项目', '基础研究', '<p>基于HTML5的跑酷游戏的实现</p>\r\n\r\n<p><br />\r\n利用HTML5技术编写一个跑酷游戏，利用HTML5的画布新元素开发小游戏。<br />\r\n可用到HTML5中的cavas封装的库：lufylegend库件，本地离线存储localStorage技术。<br />\r\n包含大致功能模块和要求：<br />\r\n1. 地图模块：<br />\r\n（1）绘制跑酷递推<br />\r\n（2）读取地图<br />\r\n（3）设置关卡<br />\r\n2. 主界面背景模块：<br />\r\n（1）背景图片加载<br />\r\n（2）一些特效比如飘雪、暴雨等场景<br />\r\n（3）一些数据的统计和加载：生命指征的获得和统计，如何获得指征值自行考虑，比如消灭星星或敌物；当指征数达到多少时可进入下一关；<br />\r\n玩家在这一局中时间的统计；关卡的显示等。<br />\r\n3. 游戏主要角色，主角通过键盘控制动作<br />\r\n4. 阶梯、障碍等的设计<br />\r\n5. 考虑是否设置子弹（击打敌物）、敌物、星星（增加生命指征值）<br />\r\n6. 跑酷的各种音效设计<br />\r\n7. 通关的音效和庆贺画面（比如烟花或鲜花等）<br />\r\n8. 先设计PC端的跑酷游戏，但后期测试HTML5的跨平台特性，看能否顺利过渡到移动平台。</p>\r\n\r\n<p>联系邮箱：zheng.chan@163.com</p>', '1', '231', '451', null, '2017-04-20 00:00:00', '0', '1', '2016-10-17 10:14:35', '2016-10-17 10:23:53');
INSERT INTO `thesis` VALUES ('479', '1', '3', 'Android手机的日程管理软件的设计', '应用软件开发', '科研项目', '基础研究', '<p>Android手机的日程管理软件的设计</p>\r\n\r\n<p><br />\r\n每个人每天都有很多事情要办，有时会让自己很忙乱。设计一款在安卓平台上日程管理工具，能够有如下功能：<br />\r\n记录待办事项，查询待办日程；<br />\r\n提供闹铃提醒；<br />\r\n标记已办日程，删除已办日程；<br />\r\n所有待办事项日视图、周视图、月视图；（以日历形式显示各种视图）<br />\r\n可给待办实现标记紧急或重要程度。</p>\r\n\r\n<p>联系邮箱：zheng.chan@163.com</p>', '1', '231', '385', null, '2017-04-20 00:00:00', '0', '1', '2016-10-17 10:15:00', '2016-10-17 10:23:28');
INSERT INTO `thesis` VALUES ('480', '1', '3', 'Android手机的GPS轨迹的记录和浏览', '应用软件开发', '科研项目', '基础研究', '<p>Android手机的GPS轨迹的记录和浏览</p>\r\n\r\n<p>GPS信息包含经纬度，高度，速度，方位角等。<br />\r\nKML后缀文件：Google Earth轨迹文件，GPX后缀文件，GPX轨迹交换文件<br />\r\n能实现如软件MyTracks（Android开源GPS轨迹记录软件）的一些基本功能。<br />\r\n轨迹文件（KML或GPX）复制到电脑以后，用Google Earth打开，可以利用强大的Google Earth功能察看记录的路径和地标。<br />\r\n同样，如果你要进行野营的话，同样可以通过GPS2 Google Earth事先计划路程，然后和同伴在Google Earth上研究最适宜的路线.</p>\r\n\r\n<p>实现记录、浏览户外GPS轨迹记录线路。<br />\r\n1，可持续记录GPS轨迹，包括轨迹和相关地理信息数据（经纬度、海拔高度的变化等），并可对每个地标进行详细标注，这些信息最后记录成GPS轨迹文件(如KML或GPX文件)。<br />\r\n2，选择下载范围，地图离线下载，有效节约手机上网流量。<br />\r\n3，在手机设备上显示已有的轨迹文件（比如软件&ldquo;六只脚&rdquo;的上有几十万条的户外轨迹线路可供下载），用来规划户外行程。</p>\r\n\r\n<p>联系邮箱：zheng.chan@163.com</p>', '1', '231', null, null, '2017-04-20 00:00:00', '0', '1', '2016-10-17 10:16:57', '2016-10-17 10:22:43');
INSERT INTO `thesis` VALUES ('481', '1', '3', 'Android手机的行迹记录及其地图显示', '应用软件开发', '科研项目', '基础研究', '<p>如同软件my tracks一样，记录你持手机移动的GPS的行迹（时间、距离、速度、海拔高度、&hellip;&hellip;等），并用google地图查看该行迹（用红线标示）。</p>\r\n\r\n<p>联系邮箱：zheng.chan@163.com</p>', '1', '231', null, null, '2017-04-20 00:00:00', '0', '1', '2016-10-17 10:18:00', '2016-10-17 10:22:19');
INSERT INTO `thesis` VALUES ('482', '1', '3', 'Android手机对计算机的屏幕监控的实现', '应用软件开发', '科研项目', '基础研究', '<p>实现用手机通过wifi对计算机进行屏幕监控和管理。可应用于移动办公的少量操作，家长监护未成年人使用电脑或监控其上网等。计算机为服务器端（含无线网卡），手机为客户端。<br />\r\n1，实现服务器端和客户端的连接<br />\r\n2，实现远程关机，锁屏。<br />\r\n3，实现手机获取联网计算机的屏幕截屏，实现可视化控制<br />\r\n4，能实现使用手机对计算机的鼠标和键盘的控制</p>\r\n\r\n<p>联系邮箱：zheng.chan@163.com</p>', '1', '231', '342', null, '2017-04-20 00:00:00', '0', '1', '2016-10-17 10:18:29', '2016-10-17 10:22:04');
INSERT INTO `thesis` VALUES ('483', '1', '3', '通过wifi实现Android手机对计算机的远程控制', '应用软件开发', '科研项目', '基础研究', '<p>通过wifi实现Android手机对计算机的远程控制<br />\r\n实现用手机通过wifi对计算机进行远程控制。可应用于移动办公的少量操作，计算机为服务器端（含无线网卡），手机为客户端。<br />\r\n1，实现服务器端和客户端的连接<br />\r\n2，实现远程关机，锁屏。<br />\r\n3，实现手机获取联网计算机的屏幕截屏，实现可视化控制<br />\r\n4，能实现使用手机对计算机的鼠标和键盘的控制</p>\r\n\r\n<p>联系邮箱：zheng.chan@163.com</p>', '1', '231', '383', null, '2017-04-20 00:00:00', '0', '1', '2016-10-17 10:18:53', '2016-10-17 10:21:52');
INSERT INTO `thesis` VALUES ('484', '1', '3', '实现手机通过wifi控制计算机进行幻灯片演讲', '应用软件开发', '科研项目', '基础研究', '<p>对于ppt的演讲者，希望能站到离听者最近的距离，最好就在一群听者的中间，用Android手机通过wifi远程控制计算机，计算机为服务器端（含无线网卡），手机为客户端。最后论文答辩时，就用你的设计实现站在台下的手机控制演讲。<br />\r\n实现：<br />\r\n1，实现服务器端和客户端的连接<br />\r\n2，实现远程关机<br />\r\n3，实现幻灯片开始放映，下一页，上一页，跳转到某页，退出放映<br />\r\n4，能实现使用手机对计算机的鼠标和键盘的控制<br />\r\n&nbsp;</p>\r\n\r\n<p>联系邮箱：zheng.chan@163.com</p>', '1', '231', '382', null, '2017-04-20 00:00:00', '0', '1', '2016-10-17 10:19:32', '2016-10-17 10:21:25');
INSERT INTO `thesis` VALUES ('485', '1', '3', '基于HTML5技术的网页游戏框架的实现', '应用软件开发', '科研项目', '基础研究', '<p>基于HTML5技术的网页游戏框架的实现</p>\r\n\r\n<p><br />\r\n利用HTML5这种技术编写一个小型网页游戏框架，以便让开发者快速利用HTML5的画布新元素开发小游戏。<br />\r\n使用JavaScript语言，该框架只是为了让一些以前使用其他语言开发游戏，例如J2ME，ActionScript，可以快速过渡到HTML5制作跨平台游戏。</p>\r\n\r\n<p>联系邮箱：zheng.chan@163.com<br />\r\n&nbsp;</p>', '1', '231', '495', null, '2017-04-20 00:00:00', '0', '1', '2016-10-17 10:20:07', '2016-10-17 10:21:11');
INSERT INTO `thesis` VALUES ('486', '1', '3', '校园快递代领系统', '应用软件开发', '生产实践', '基础研究', '<p>简要内容描述：微信开发、ＰＨＰ后台开发，设计一个微信端的快递代领系统，含发单端，接单端，接单排名等功能结构。</p>', '1', '220', '339', null, '2017-04-23 00:00:00', '0', '1', '2016-10-17 10:29:08', '2016-10-17 10:29:08');
INSERT INTO `thesis` VALUES ('489', '1', '3', 'B2C商城实现', '应用软件开发', '生产实践', '设计性', '<p>B2C商城实现</p>', '1', '217', '442', null, '2017-05-20 00:00:00', '0', '1', '2016-10-17 11:22:47', '2016-10-17 11:22:47');
INSERT INTO `thesis` VALUES ('490', '1', '3', '基于faster R-CNN的百香果果实检测', '数字图像处理', '科研项目', '应用研究', '<p>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; 为了实现机器人快速的百香果适时采摘，本章在借鉴了人工判别和专用仪器判别方法基础上，利用采用数码相机设备，建立果园场景下百香果RGB-D数据库；采用faster R-CNN和SVM方法开发百香果果实检测系统.</p>\r\n\r\n<p>&nbsp;</p>', '1', '238', null, null, '2017-05-19 00:00:00', '0', '1', '2016-10-17 14:52:15', '2016-10-17 14:52:15');
INSERT INTO `thesis` VALUES ('491', '1', '3', '基于faster R-CNN的小猪检测', '应用软件开发', '科研项目', '应用研究', '<p>采用先进的数码设备，建立猪场场景下小猪数据库；采用faster R-CNN和SVM方法开发检测系统</p>', '1', '238', null, null, '2017-05-19 00:00:00', '0', '1', '2016-10-17 14:57:32', '2016-10-17 14:57:32');
INSERT INTO `thesis` VALUES ('492', '1', '3', '基于稀疏编码的猪只姿态识别与分析', '应用软件开发', '科研项目', '基础研究', '<p>研究在猪体的颜色、轮廓和方向梯度直方图(HOG)基本特征基础上,采用局部约束稀疏编码及空间金字塔匹配模型，提取猪体特征向量表达，使猪只姿态特征在局部和整体上具有更好的聚类性和区分性。</p>', '1', '238', null, null, '2017-05-19 00:00:00', '0', '1', '2016-10-17 15:09:17', '2016-10-17 15:09:17');
INSERT INTO `thesis` VALUES ('493', '1', '3', '基于kinect的猪体三维重构', '应用软件开发', '科研项目', '基础研究', '<p>利用RGB-D视觉技术，生成猪体三维数据，获取猪体三维图像，实现三维测量</p>', '1', '238', null, null, '2017-05-19 00:00:00', '0', '1', '2016-10-17 15:15:06', '2016-10-17 15:15:06');
INSERT INTO `thesis` VALUES ('494', '1', '3', '医疗管理系统的设计与实现', '应用软件开发', '生产实践', '应用研究', '<p>该系统采用B/S结构，使用MySQL作数据库，根据E-R数据模型进行数据库表详细设计，基于Java EE平台，利用熟悉的语言实现医疗管理系统</p>', '1', '238', '481', null, '2017-05-19 00:00:00', '0', '1', '2016-10-17 15:19:02', '2016-10-17 15:19:02');
INSERT INTO `thesis` VALUES ('495', '1', '3', '小型酒店信息管理系统', '应用软件开发', '生产实践', '应用研究', '<p>该系统选取MYSQL数据库，基于Java EE平台，搭建SSH框架，使用Struts2框架把数据与逻辑分开，采用Hibernate框架对持久层进行支撑，再使用Spring框架对Struts2框架与Hibernate框架进行整合，实现小型酒店信息管理系统</p>', '1', '238', '424', null, '2017-05-19 00:00:00', '0', '1', '2016-10-17 15:22:52', '2016-10-17 15:22:52');
INSERT INTO `thesis` VALUES ('496', '1', '3', '基于HOG和Adboost的百香果果实检测', '应用软件开发', '科研项目', '应用研究', '<p>采用高清数码相机设备，建立果园场景下百香果数据库；然后采用HOG特征和Adboost级联方法开发百香果果实检测系统</p>', '1', '238', null, null, '2017-05-19 00:00:00', '0', '1', '2016-10-17 15:25:49', '2016-10-17 15:25:49');
INSERT INTO `thesis` VALUES ('497', '1', '3', '基于HOG特征和Adboost级联方法的母猪检测', '应用软件开发', '科研项目', '基础研究', '<p>采用高清数码相机设备，建立果园场景下百香果数据库；然后采用HOG特征和Adboost级联方法开发百香果果实检测系统</p>', '1', '238', null, null, '2017-05-19 00:00:00', '0', '1', '2016-10-17 15:27:26', '2016-10-17 15:27:26');
INSERT INTO `thesis` VALUES ('498', '1', '3', '慕课学习过程管理研究与应用', '应用软件开发', '教学改革项目', '应用研究', '<p>熟悉慕课学习流程，了解过程管理机制，通过过程管理有关数据分析学生的学习状态，及时给予激励或惩罚。</p>\r\n\r\n<p> </p>', '1', '210', null, null, '2016-10-17 00:00:00', '0', '1', '2016-10-17 15:38:21', '2016-10-17 16:18:15');
INSERT INTO `thesis` VALUES ('499', '1', '3', '微课管理平台设计与实现', '应用软件开发', '教学改革项目', '应用研究', '<p>了解&ldquo;微课&rdquo;的基本概念，设计和实现一个微课管理平台</p>', '1', '210', '663', null, '2016-10-17 00:00:00', '0', '1', '2016-10-17 15:42:00', '2016-10-17 16:17:56');
INSERT INTO `thesis` VALUES ('500', '1', '3', '移动学习支持系统设计与实现', '应用软件开发', '教学改革项目', '应用研究', '<p>了解移动学习的基本原理，应用微信或QQ平台设计和实现一个学习支持系统。</p>\r\n\r\n<p>&nbsp;</p>', '1', '210', null, null, '2016-10-17 00:00:00', '0', '1', '2016-10-17 15:46:03', '2016-10-17 16:17:19');
INSERT INTO `thesis` VALUES ('501', '1', '3', '基于Labview的猪舍环境监测系统设计', '应用软件开发', '科研项目', '应用研究', '<p>LabVIEW&nbsp;（Laboratory Virtual Instrument Engineering Workbench）是一种程序开发环境，由<a href=\"http://baike.baidu.com/view/2398.htm\" target=\"_blank\">美国</a>国家仪器（NI）公司研制开发，是一种用图标代替文本行创建应用程序的图形化编程语言，类似于C开发环境，而LabVIEW使用的是图形化编辑语言G编写程序，产生的程序是框图的形式。</p>\r\n\r\n<p>现有一套传感器设备部署在猪舍，每天采集猪舍温度、湿度、二氧化碳、氨气等环境参数，这些参数会通过云平台下载到实验室服务器，希望利用Labview开发一个应用程序，图形化显示采集到的数据。</p>\r\n\r\n<p>&nbsp;</p>', '1', '255', null, null, '2017-04-23 00:00:00', '0', '1', '2016-10-17 15:46:08', '2016-10-17 15:55:39');
INSERT INTO `thesis` VALUES ('502', '1', '3', '基于微信的校友管理系统设计与实现', '应用软件开发', '科研项目', '基础研究', '', '1', '210', '455', null, '2016-10-17 00:00:00', '0', '1', '2016-10-17 15:47:21', '2016-10-17 15:47:21');
INSERT INTO `thesis` VALUES ('503', '1', '3', 'PageRank算法分析与实现', '应用软件开发', '科研项目', '应用研究', '<p>熟悉PageRank算法的工作原理，应用MapReduce或Pregel并行编程实现</p>', '1', '210', '326', null, '2016-10-17 00:00:00', '0', '1', '2016-10-17 15:49:44', '2016-10-19 10:11:02');
INSERT INTO `thesis` VALUES ('504', '1', '3', 'Bloom过滤器研究与应用', '应用软件开发', '科研项目', '基础研究', '<p>了解Bloom过滤器的</p>', '1', '210', null, null, '2016-10-17 00:00:00', '0', '1', '2016-10-17 15:51:29', '2016-10-17 16:15:24');
INSERT INTO `thesis` VALUES ('505', '1', '3', '基于Labview的农田信息监测系统设计', '应用软件开发', '科研项目', '应用研究', '<p>LabVIEW是一种用图标代替文本行创建应用程序的图形化编程语言。LabVIEW （Laboratory Virtual Instrument Engineering Workbench）是一种程序开发环境，由<a href=\"http://baike.baidu.com/view/2398.htm\" target=\"_blank\">美国</a>国家仪器（NI）公司研制开发，是一种用图标代替文本行创建应用程序的图形化编程语言，类似于C开发环境，而LabVIEW使用的是图形化编辑语言G编写程序，产生的程序是框图的形式。</p>\r\n\r\n<p>现有一套传感器设备部署在猪舍，每天采集猪舍温度、湿度、二氧化碳、氨气等环境参数，这些参数会通过云平台下载到实验室服务器，希望利用Labview开发一个应用程序，图形化显示采集到的数据。</p>', '1', '255', null, null, '2017-04-23 00:00:00', '0', '1', '2016-10-17 15:51:30', '2016-10-17 15:56:02');
INSERT INTO `thesis` VALUES ('506', '1', '3', 'BCH算法研究与仿真', '网络技术与应用', '科研项目', '应用研究', '<p>BCH是一种纠错算法，常用于无线传感器网络中对数据进行编码纠错。学习BCH算法，并利用Matlab进行仿真，验证不同纠错能力下的编码效率。有相关资料可以参考。</p>', '1', '255', '654', null, '2017-04-23 00:00:00', '0', '1', '2016-10-17 15:51:51', '2016-10-18 16:10:02');
INSERT INTO `thesis` VALUES ('507', '1', '3', '词频计算分析与实现', '应用软件开发', '科研项目', '基础研究', '<p>对词频计算过程熟悉，应用MapReduce或Storm实现</p>', '1', '210', '332', null, '2016-10-17 00:00:00', '0', '1', '2016-10-17 15:53:40', '2016-10-17 15:53:40');
INSERT INTO `thesis` VALUES ('508', '1', '3', '基于用户的电影推荐系统设计与实现', '应用软件开发', '科研项目', '基础研究', '', '1', '210', '454', null, '2016-10-17 00:00:00', '0', '1', '2016-10-17 15:54:39', '2016-10-17 15:54:39');
INSERT INTO `thesis` VALUES ('509', '1', '3', '基于物品的购物推荐系统设计与实现', '应用软件开发', '科研项目', '基础研究', '<p>了解协同过滤的</p>', '1', '210', null, null, '2016-10-17 00:00:00', '0', '1', '2016-10-17 15:56:47', '2016-10-17 15:56:47');
INSERT INTO `thesis` VALUES ('510', '1', '3', '二分匹配研究及实现', '应用软件开发', '科研项目', '基础研究', '<p>了解&ldquo;二分匹配&rdquo;</p>', '1', '210', null, null, '2016-10-17 00:00:00', '0', '1', '2016-10-17 15:58:30', '2016-10-17 15:58:30');
INSERT INTO `thesis` VALUES ('511', '1', '3', '单源最短路径研究及实现', '应用软件开发', '科研项目', '基础研究', '<p>了解单源最短路径计算流程，应用Pregel实现其计算。</p>\r\n\r\n<p>&nbsp;</p>', '1', '210', null, null, '2016-10-17 00:00:00', '0', '1', '2016-10-17 15:59:26', '2016-10-17 15:59:26');
INSERT INTO `thesis` VALUES ('512', '1', '3', '基于Storm的广告推荐系统设计与实现', '应用软件开发', '科研项目', '基础研究', '<p>了解广告推荐的工作原理，应用Storm</p>', '1', '210', null, null, '2016-10-17 00:00:00', '0', '1', '2016-10-17 16:02:14', '2016-10-17 16:02:14');
INSERT INTO `thesis` VALUES ('513', '1', '3', '基于Andriod的农田远程监测系统', '应用软件开发', '科研项目', '应用研究', '<p>在Android手机上开发一款APP，用于从服务器上获取农田监测系统的产生的数据，并显示和存储，也可通过APP发送采集指令，获取采集数据。无线传感器网络已经部署在农田，可周期性采集数据发送到服务器。</p>', '1', '255', '635', null, '2017-04-23 00:00:00', '0', '1', '2016-10-17 16:08:08', '2016-10-19 14:36:33');
INSERT INTO `thesis` VALUES ('514', '1', '3', '小区业委会管理系统设计与实现', '应用软件开发', '生产实践', '应用研究', '<p>【任务】<br />\r\n1. 提供管理小区公共事务管理，如消息发布、业主信息管理、小区公共事务管理；<br />\r\n2. 提供内部人员事务管理，如果业主委员会会议管理、内部事务管理、财务管理等； <br />\r\n3. 提供系统管理功能。</p>\r\n\r\n<p>【要求】<br />\r\n1. 使用Java或C#<br />\r\n2. 数据库根据自身情况进行选择</p>\r\n\r\n<p>【联系方式】<br />\r\n手机：13760732070<br />\r\nemail：wangct@scau.edu.cn</p>', '1', '265', '646', null, '2017-04-23 00:00:00', '0', '1', '2016-10-17 16:44:56', '2016-10-19 14:55:19');
INSERT INTO `thesis` VALUES ('515', '1', '3', '基于Android的家谱管理APP设计与实现', '应用软件开发', '生产实践', '应用研究', '<p>【任务】<br />\r\n1. 实现谱编辑管理、家谱图表分析、个人传记、分享墙、信息查询等功能；</p>\r\n\r\n<p>【要求】<br />\r\n1. 使用Android平台<br />\r\n2. 数据库根据自身情况进行选择</p>\r\n\r\n<p>【联系方式】<br />\r\n手机：13760732070<br />\r\nemail：wangct@scau.edu.cn</p>', '1', '265', '499', null, '2017-04-23 00:00:00', '0', '1', '2016-10-17 16:49:36', '2016-10-17 16:49:36');
INSERT INTO `thesis` VALUES ('516', '1', '3', '基于SPARK的购物平台推荐系统', '应用软件开发', '生产实践', '基础研究', '<p>研究SPARK数据挖掘技术，构建一个基于用户推荐/物品推荐的推荐系统， 并应用于电商网站中。</p>', '1', '220', '328', null, '2017-04-23 00:00:00', '0', '1', '2016-10-17 17:02:11', '2016-10-17 17:02:11');
INSERT INTO `thesis` VALUES ('517', '1', '3', 'JSP自动排课系统', '应用软件开发', '科研项目', '基础研究', '<p>联系方式：24883798@qq.com</p>\r\n\r\n<p>&nbsp;</p>', '1', '254', null, null, '2017-05-20 00:00:00', '0', '1', '2016-10-17 18:03:08', '2016-10-17 18:03:08');
INSERT INTO `thesis` VALUES ('518', '1', '3', 'JSP药品销售数据管理系统', '应用软件开发', '科研项目', '基础研究', '<p>联系方式：24883798@qq.com</p>', '1', '254', '397', null, '2017-05-20 00:00:00', '0', '1', '2016-10-17 18:04:55', '2016-10-17 18:04:55');
INSERT INTO `thesis` VALUES ('519', '1', '3', 'JSP 在线教学质量评价系统的设计与实现', '应用软件开发', '科研项目', '基础研究', '<p>联系方式：24883798@qq.com</p>', '1', '254', null, null, '2017-05-20 00:00:00', '0', '1', '2016-10-17 18:09:22', '2016-10-17 18:09:22');
INSERT INTO `thesis` VALUES ('520', '1', '3', 'JSP 机房上机收费管理系统', '应用软件开发', '科研项目', '基础研究', '<p>联系方式：24883798@qq.com</p>', '1', '254', null, null, '2017-05-20 00:00:00', '0', '1', '2016-10-17 18:10:55', '2016-10-17 18:10:55');
INSERT INTO `thesis` VALUES ('521', '1', '3', 'JSP 科研成果申报系统', '应用软件开发', '科研项目', '基础研究', '<p>联系方式：24883798@qq.com</p>', '1', '254', '396', null, '2017-05-20 00:00:00', '0', '1', '2016-10-17 18:12:13', '2016-10-17 18:12:13');
INSERT INTO `thesis` VALUES ('522', '1', '3', 'JSP 教室网上预约系统', '应用软件开发', '科研项目', '基础研究', '', '1', '254', '617', null, '2017-05-20 00:00:00', '0', '1', '2016-10-17 18:13:25', '2016-10-17 18:13:25');
INSERT INTO `thesis` VALUES ('523', '1', '3', 'JAVA 五子棋游戏的设计与实现', '应用软件开发', '科研项目', '基础研究', '<p>联系方式：24883798@qq.com</p>', '1', '254', '418', null, '2017-05-20 00:00:00', '0', '1', '2016-10-17 18:19:59', '2016-10-17 18:19:59');
INSERT INTO `thesis` VALUES ('524', '1', '3', '基于WEB的课程调查问卷系统的设计与实现', '应用软件开发', '其他', '应用研究', '<p>     在积极建立科学管理机制的今天，仅仅靠原始的手工管理或简单的单机管理，管理部门面对大量的信息，无法有效率地将其中的重要部分提取出来，并做出相应的判断和处理。课程问卷调查可以检验学生的学习情况，并能反映学生对课程的一些建议。随着科学技术的不断提高，计算机科学日渐成熟，其强大的功能已为人们深刻认识，它已进入人类社会的各个领域并发挥着越来越重要的作用。<br />\r\n    该题目设计一个基于WEB的课程问卷调查系统，要求支持单选、多选、自定义文本、以及多种题型交叉等类型的问题，需要能够防止同一用户重复提交，并能设置问卷开始以及结束日期，问卷提交后，能够对问卷结果进行统计分析，包括主要功能模块如下：<br />\r\n（1）、用户管理模块：可以对用户及用户组进行添加、修改、删除。用户管理模块主要是对用户的身份及其基本信息、登录控制权限等进行管理 , 以确保答卷信息的真实性和可信度 ,进而获得有参考价值的统计信息。<br />\r\n（2）、问卷管理模块：能够对问卷进行添加、删除、修改和查询等基本管理。<br />\r\n（3）、问卷调查模块：用户能够在网上进行问卷调查，要求支持单选、多选、自定义文本、以及多种题型交叉等类型的问题，需要能够防止同一用户重复提交，并能设置问卷开始以及结束日期。<br />\r\n因设计的系统是通用型问卷调查 ,必须可以方便地对问卷调查表进行在线创建和发布新的主题 ,可以有多个主题同时进行发布调查而互不干扰。问卷调查项目的编辑维护包括调查题目及选项内容的创建、编辑、删除等 , 并可根据需要制定调查问卷的回答方式（如单选、多选、文本填空）等 ,极大地方便了问卷调查表的制作和维护。<br />\r\n（4）、问卷结果分析模块：对问卷结果进行统计分析，要求能对问卷明细数据列表查看，并根据结果生成柱状图统计图表。<br />\r\n<br />\r\n<br />\r\n </p>', '1', '215', '586', null, '2017-04-30 00:00:00', '0', '1', '2016-10-17 18:21:03', '2016-10-17 18:28:12');
INSERT INTO `thesis` VALUES ('525', '1', '3', 'JAVA 物业管理系统', '应用软件开发', '科研项目', '基础研究', '<p>联系方式：24883798@qq.com</p>', '1', '254', '398', null, '2017-05-20 00:00:00', '0', '1', '2016-10-17 18:27:35', '2016-10-17 18:27:35');
INSERT INTO `thesis` VALUES ('526', '1', '3', 'JAVA 文件压缩与解压缩', '应用软件开发', '科研项目', '基础研究', '<p>联系方式：24883798@qq.com</p>', '1', '254', null, null, '2017-05-20 00:00:00', '0', '1', '2016-10-17 18:34:41', '2016-10-17 18:34:41');
INSERT INTO `thesis` VALUES ('527', '1', '3', '英文单词学习系统的设计与实现', '应用软件开发', '其他', '应用研究', '<p>&nbsp; &nbsp; 对于一个单词的学习首先要知道其中文意思以及发音，所以本系统要实现类似于英文词典的查询和发音功能，和生词簿的功能，生词簿用来存储学习者在学习过程中遇到的生词难词以便于反复的学习和记忆；单调的学习则会让学习者感到枯燥和乏味，失去学习的兴趣，为增加学习的趣味性，用户可以根据爱好随意更换自己喜欢的主题色彩和背景音乐，让学习变成一种娱乐和享受，提高了学习的效率；每个学习者都必然要对自己的学习结果有一个全面的了解，才能够查漏补缺，所以对于用户每次完成测试和挑战时候显示下学习的结果，使结果不仅具备数字的直观性还有图画的美观性。</p>\r\n\r\n<p>&nbsp; &nbsp;&nbsp;本系统的主要功能有：<br />\r\n（1）学习模块：包括单词的朗读，中文意思等。单词读音的音频文件需要建立相对路径对数据库进行调用访问其存储文件。<br />\r\n（2）统计功能：实现统计测试模块、挑战模块的成功率。需要在函数中运用添加<a href=\"http://www.2bysj.cn/Article/java/Index.html\">JAVA</a>Script技术来完成统计。<br />\r\n（3）其它窗体：包括主窗体、背景音乐等。背景音乐采用bgsound标签，另外背景音乐的切换<br />\r\n&nbsp;</p>', '1', '215', '365', null, '2017-04-30 00:00:00', '0', '1', '2016-10-17 18:35:26', '2016-10-17 18:35:26');
INSERT INTO `thesis` VALUES ('528', '1', '3', 'JSP C语言试题生成与考试系统', '应用软件开发', '科研项目', '基础研究', '<p>联系方式：24883798@qq.com</p>', '1', '254', null, null, '2017-05-20 00:00:00', '0', '1', '2016-10-17 18:37:10', '2016-10-17 18:37:10');
INSERT INTO `thesis` VALUES ('529', '1', '3', '拼图游戏的实现', '应用软件开发', '其他', '应用研究', '<p>本课题需要重点研究的、关键的问题及解决的思路：<br />\r\n（1）图块移动功能：游戏进行中，完成周边游戏图块上，下，左，右的移动。<br />\r\n（2）各项游戏功能与处理：游戏界面有新游戏，菜单，静音，帮助图标，游戏可以打乱图片，开始游戏；菜单可以选择图片和游戏难度；背景音乐和帮助信息的打开和关闭等；<br />\r\n（3）个性化自定义设置功能：游戏中有自带图片和自选图片。自带图片完成游戏基本功能；自选图片遵从用户体验，可以从图库中选择自己喜爱的图片进行游戏。<br />\r\n（4）其他窗体：游戏主界面有休闲模式、游戏帮助、退出功能。游戏进行中有背景音乐，拼图移动、成功、失败中存在音乐特效。<br />\r\n<br />\r\n&nbsp;</p>', '1', '215', '427', null, '2017-04-30 00:00:00', '0', '1', '2016-10-17 18:38:59', '2016-10-17 18:38:59');
INSERT INTO `thesis` VALUES ('530', '1', '3', '服装销售系统的设计与实现', '应用软件开发', '其他', '应用研究', '<p>本题目主要为用户提供基本信息的查询、修改、删除、添加等功能，还能对用户提供的数据进行统计分析，根据客户的需求生成相应的报表，直观的提供用户所需的数据，方便用户进行数据分析，做好市场定位。相应的需求有：<br />\r\n（1）由于考虑到操作人员可能计算机知识不够好，要求有良好的人机界面，能通过界面直观的了解操作的是哪一步操作。<br />\r\n（2）由于该系统可能会用于多个部门，使用对象多，要求有较好的权限管理。<br />\r\n（3）基础信息管理与查询，支持多条件查询。<br />\r\n（4）完善的商品采购信息、商品销售信息。<br />\r\n（5）方便、健全的结账功能。<br />\r\n（6）报表进行各项数据的分析统计。<br />\r\n<br />\r\n&nbsp;</p>', '1', '215', '428', null, '2017-04-30 00:00:00', '0', '1', '2016-10-17 18:40:21', '2016-10-17 18:40:21');
INSERT INTO `thesis` VALUES ('531', '1', '3', 'JAVA 药品管理系统', '应用软件开发', '科研项目', '基础研究', '<p>联系方式：24883798@qq.com</p>', '1', '254', '355', null, '2017-05-20 00:00:00', '0', '1', '2016-10-17 18:42:11', '2016-10-17 18:42:11');
INSERT INTO `thesis` VALUES ('532', '1', '3', '仓库管理系统的设计与实现', '应用软件开发', '其他', '应用研究', '<p>     企业的物资供应管理往往是很复杂的，烦琐的。由于所掌握的物资种类众多，订货，管理，发放的渠道各有差异，各个企业之间的管理体制不尽相同，各类统计计划报表繁多，因此物资管理必须实现计算机化，而且必须根据企业的具体情况制定相应的方案。</p>\r\n\r\n<p>     仓库管理的物资在题目中主要假定都是企业生产所需要的各种设备。进货时经检查合同确认认为有效托收以后，进行验货入库，填写入库单，进行入库登记。企业各个部分根据所需要的物资设备总额和部门生产活动需要提出物资需求申请。计划员根据整个企业的需求开出物资设备出库单，仓库管理员根据出库单核对发放设备。设备使用完毕需要及时归还入库，填写入库单。根据需要按照月，季，年进行统计分析，产生相应报表。具体功能如下：<br />\r\n1）仓库管理各种信息的输入，包括入库、出库、还库、需求信息的输入等。<br />\r\n2）仓库管理各种信息的查询、修改和维护。<br />\r\n3）设备采购报表的生成。<br />\r\n4）在库存管理中加入最高储备和最低储备字段，对仓库中的物资设备实现监控和报警。<br />\r\n5）企业各个部门的物资需求的管理。<br />\r\n6)操作日志的管理。<br />\r\n7) 仓库管理的使用帮助。<br />\r\n<br />\r\n<br />\r\n </p>', '1', '215', '584', null, '2017-04-30 00:00:00', '0', '1', '2016-10-17 18:44:01', '2016-10-19 10:55:40');
INSERT INTO `thesis` VALUES ('533', '1', '3', 'JSP 医院门诊查询系统', '应用软件开发', '科研项目', '基础研究', '<p>联系方式：24883798@qq.com</p>', '1', '254', '347', null, '2017-05-20 00:00:00', '0', '1', '2016-10-17 18:45:00', '2016-10-17 18:45:00');
INSERT INTO `thesis` VALUES ('534', '1', '3', '医院病房管理系统的设计与实现', '应用软件开发', '其他', '应用研究', '<p>&nbsp; &nbsp; 计算机管理已经渗透了各行各业.对于一个医院来说,房间管理也是一个 必备的环节,病房的入住,费用统计,转病房的登记都包含着复杂的信息,这就需要应用计算机软件来对各项工作进行管理以发挥最大的功效。这次设计的目的就是为医院创建一个方便、实用、快捷的工作环境,减轻医院工作人员的负担,同时这也是现代化管理的必然要求。病房管理涉及到病人的基本信息的录入、修改, 房间的设定、查询和结算等。典型的医院病房管理系统主要应具有以下功能：<br />\r\n1) 对病人情况的查询<br />\r\n2) 对房间的查询<br />\r\n3) 房间的修改<br />\r\n4) 病人转房<br />\r\n5) 病人的登记<br />\r\n6) 费用的结算<br />\r\n7) 系统的维护<br />\r\n<br />\r\n&nbsp;</p>', '1', '215', '299', null, '2017-04-30 00:00:00', '0', '1', '2016-10-17 18:46:23', '2016-10-17 18:46:23');
INSERT INTO `thesis` VALUES ('535', '1', '3', '企业员工培训管理系统的设计与实现', '应用软件开发', '其他', '应用研究', '<p>&nbsp; &nbsp; 随着人类社会的发展，要求每个紧跟时代的人都要不断的进行自我提高。因此，学习与再学习始终伴随着我们，其中有关的培训机构有着为可替代的作用，在这种形势下，如何更好的对培训工作进行管理，就成了我们需要解决的一个问题，因此，开发一套完善的培训管理系统就成不可少了。本题目需要完成功能主要有：<br />\r\n1.&nbsp;员工各种信息的输入，包括员工基本信息、职称、岗位、已经培训的课程和成绩、培训计划等。<br />\r\n2.&nbsp;员工各种信息的查询、修改，包括员工基本信息、职称、岗位、已经培训过的课程和成绩、培训计划等。<br />\r\n3.&nbsp;培训课程信息的输入，包括课时、课程种类等。<br />\r\n4.&nbsp;培训课程信息的查询、修改。<br />\r\n5.&nbsp;企业所有员工培训需求的管理。<br />\r\n6.&nbsp;企业培训计划的制定、修改。<br />\r\n7.&nbsp;培训课程的评价。<br />\r\n8.&nbsp;培训管理系统的使用帮助。<br />\r\n9.&nbsp;教师信息的管理、教师评价。<br />\r\n10.&nbsp;培训资源管理。<br />\r\n11.&nbsp;培训教材管理<br />\r\n12.&nbsp;员工外出培训管理。<br />\r\n13.&nbsp;系统用户管理、权限管理。<br />\r\n<br />\r\n&nbsp;</p>', '1', '215', '306', null, '2017-04-30 00:00:00', '0', '1', '2016-10-17 18:48:41', '2016-10-17 18:48:41');
INSERT INTO `thesis` VALUES ('536', '1', '3', '基于web的旅游推介网站', '应用软件开发', '生产实践', '应用研究', '<p>网站提供了国内外比较冷门的旅游景点的推介，同时还提供一些国内外驴友关于这些景点的相关链接以及一些出行信息的简单推荐。网站将用更加优美的方式呈现给浏览者，让网站浏览者能够在了解景点的同时放松身心。</p>', '1', '214', '445', null, '2016-10-17 00:00:00', '0', '1', '2016-10-17 20:35:35', '2016-10-17 20:35:35');
INSERT INTO `thesis` VALUES ('537', '1', '3', '基于PHP的汽车交流网站', '应用软件开发', '生产实践', '应用研究', '<p>网站提供关于汽车的性能参数等，比如有些人要买车，可以到这个网站参考信息之后，再决定自己需要什么车辆。</p>', '1', '214', '461', null, '2016-10-17 00:00:00', '0', '1', '2016-10-17 20:38:03', '2016-10-17 20:38:03');
INSERT INTO `thesis` VALUES ('538', '1', '3', '基于ASP.NET的烘焙分享网站', '应用软件开发', '生产实践', '应用研究', '<p>网站提供用户的烘焙方面的交流与互动，同时给用户提供一些烘焙教程，介绍烘焙知识，了解信息的平台。</p>', '1', '214', '430', null, '2016-10-17 00:00:00', '0', '1', '2016-10-17 20:39:17', '2016-10-17 20:39:17');
INSERT INTO `thesis` VALUES ('539', '1', '3', '基于改进粒子群算法的多目标优化', '人工智能', '科研项目', '基础研究', '<p>基于改进粒子群算法的多目标优化</p>', '1', '253', '323', null, '2017-04-23 00:00:00', '0', '1', '2016-10-17 20:39:17', '2016-10-17 20:39:17');
INSERT INTO `thesis` VALUES ('540', '1', '3', '基于JAVA的健身社交网站', '应用软件开发', '生产实践', '应用研究', '<p>提供健身和社交于一体的健身网站。在网站中主要提供给用户合理的健身方案和健身指导，并且建立一个用户之间互动的平台分享健身信息</p>', '1', '214', '412', null, '2016-10-17 00:00:00', '0', '1', '2016-10-17 21:43:03', '2016-10-17 21:43:03');
INSERT INTO `thesis` VALUES ('541', '1', '3', '汽车停车位实时管理系统APP的设计与实现', '应用软件开发', '生产实践', '应用研究', '<p><strong>本设计可以自选一个开发平台（Android或IOS）和开发工具（任选），设计并开发一个基于手机APP的车位租赁系统</strong><strong>，该系统的主要功能是：通过使用该APP，车主能够实时查询城市各停车场车位的使用情况，以满足车主能够方便快捷选择停车地点的要求，同时提高停车场对停车位的高效利用和有效管理。该APP要求实现以下主要功能模块：注册及登录模块，车位查询及预订模块，车位借还模块，车位统计模块，车费付费及资讯公告等模块。</strong></p>', '1', '230', '575', null, '2017-04-23 00:00:00', '0', '1', '2016-10-17 23:11:02', '2016-10-17 23:11:02');
INSERT INTO `thesis` VALUES ('542', '1', '3', '小区物业移动服务APP的设计与实现', '应用软件开发', '生产实践', '应用研究', '<p style=\"margin-left: 48px;\"><strong>本设计可以自选一个开发平台（Android或IOS）和开发工具（任选），设计并开发一个基于C/S模式的手机APP的小区物业移动服务系统，系统需要三种角色人员：业主，物业服务人员和管理员。小区业主通过手机客户端APP 访问小区移动服务系统，包括信息浏览、需求申请、在线咨询等；物业服务人员拥有发布通知和公告权限，包括通知公告管理、用户信息管理、业主需求管理、通行证管理、费用管理等；管理员拥有最高权限，管理所有用户和信息。</strong></p>', '1', '230', '562', null, '2017-04-23 00:00:00', '0', '1', '2016-10-17 23:16:31', '2016-10-17 23:16:31');
INSERT INTO `thesis` VALUES ('543', '1', '3', '基于微信的美发预约平台的设计与实现', '应用软件开发', '生产实践', '应用研究', '<p style=\"margin-left:48px\"><strong>采用微信提供的应用开放端口，开发一个基于微信的美发预约系统。系统前台会员模块包括页面浏览功能、交易发布功能、交易管理功能、信息发布功能和注册登录功能。网站后台管理模块包括管理员管理功能、前台会员管理功能和交易信息管理功能。通过该系统可以有效实现预约网站除支付以外的各项基本功能，能满足美发线上预定、线下交易的需求。</strong></p>', '1', '230', '644', null, '2017-04-23 00:00:00', '0', '1', '2016-10-17 23:21:20', '2016-10-17 23:21:20');
INSERT INTO `thesis` VALUES ('544', '1', '3', '基于微信的移动订餐系统的设计与实现', '应用软件开发', '生产实践', '应用研究', '<p><strong>采用微信提供的应用开放端口，开发一个基于微信的移动订餐系统。要求顾客能够进行登录、浏览，下订单，放入购物车等基本功能。管理员可以进行订单管理、订餐管理、系统管理等功能。</strong></p>', '1', '230', '464', null, '2017-04-23 00:00:00', '0', '1', '2016-10-17 23:24:33', '2016-10-17 23:24:33');
INSERT INTO `thesis` VALUES ('545', '1', '3', '基于微信平台的医院信息服务系统的开发与实现', '应用软件开发', '生产实践', '应用研究', '<p style=\"margin-left:56px\"><strong>采用微信提供的应用开放端口，开发一个基于微信的医院信息服务系统。系统调用微信公众平台开放的端口发送消息、响应消息和自定义菜单等接口技术，并通过WebService方式与医院进行数据交互；在系统设计上采用MVC设计模式和Struts2技术框架。系统主要功能包括：预约挂号、科室介绍、医生介绍、检验结果查询、排队查询、留言板等。</strong></p>', '1', '230', '669', null, '2017-04-23 00:00:00', '0', '1', '2016-10-17 23:27:40', '2016-10-17 23:41:40');
INSERT INTO `thesis` VALUES ('546', '1', '3', '口令管理应用的设计与实现', '应用软件开发', '生产实践', '应用研究', '<p>本题要求基于安卓系统设计一个用户口令的管理系统，对所有帐号和口令进行统一管理。APP提供查、添、删、改等基本功能，另外，还应能提供下列功能：</p>\r\n\r\n<p>1） 检查用户口令的强弱程度</p>\r\n\r\n<p>2） 定期提醒用户更改口令</p>\r\n\r\n<p>3） 用户所有口令均需加密之后再存储</p>', '1', '266', null, null, '2017-04-23 00:00:00', '0', '1', '2016-10-18 00:08:54', '2016-10-18 00:08:54');
INSERT INTO `thesis` VALUES ('547', '1', '3', 'SMS短信护盾的设计与实现', '信息安全', '生产实践', '应用研究', '<p>要求基于安卓系统设计并实现一个APP应用，用以加密短信，并实现加密短信的发送和接收。要求如下：</p>\r\n\r\n<p>1.提供选项，让发送方在发送短信前选择是否对短信进行加密。</p>\r\n\r\n<p>2.自动区分短信是否加密处理过，并提示用户是否进行解密。</p>\r\n\r\n<p>3.支持密钥的更新。</p>', '1', '266', '310', null, '2017-04-23 00:00:00', '0', '1', '2016-10-18 00:11:00', '2016-10-18 01:31:01');
INSERT INTO `thesis` VALUES ('548', '1', '3', '基于区块链的在线合同签署系统的设计与实现', '信息安全', '科研项目', '基础研究', '<p>要求基于区块链技术，设计一个私有区块链，并以此设计和实现一个在线电子合同签署系统，实现网上签署合同，确保签署双方的公平性，即双方要么都没有获得对方签名、要么都获得对方签名。该系统不需要用可信第三方。</p>\r\n\r\n<p>本题要求动手能力和自学能力较强，具有挑战性。</p>', '1', '266', '289', null, '2017-04-23 00:00:00', '0', '1', '2016-10-18 00:19:44', '2016-10-18 00:19:44');
INSERT INTO `thesis` VALUES ('549', '1', '3', '快速可搜索加密系统的实现', '信息安全', '科研项目', '基础研究', '<p>本题要求设计并实现一个数据加密系统，可支持密文的快速检索。要求开发出系统原型，以远程服务器为云存储服务器，数据拥有者将数据加密后上传，然后再开展密文检索。</p>\r\n\r\n<p>本题对动手能力和自学能力要求较高，具有挑战性。</p>', '1', '266', '661', null, '2017-04-23 00:00:00', '0', '1', '2016-10-18 00:34:55', '2016-10-18 00:34:55');
INSERT INTO `thesis` VALUES ('550', '1', '3', '无线网络安全分析技术的研究', '信息安全', '科研项目', '基础研究', '<p>对目前无线网络安全的攻击技术展开研究，对比并分析各种攻击方法，指出其优缺点，给出无线网络安全防范措施。</p>\r\n\r\n<p>本题对自学能力要求较高。</p>', '1', '266', '311', null, '2017-04-23 00:00:00', '0', '1', '2016-10-18 00:47:38', '2016-10-18 00:47:38');
INSERT INTO `thesis` VALUES ('551', '1', '3', '简易安全邮件系统的设计与实现', '信息安全', '科研项目', '基础研究', '<p>本题要求设计并实现一个简单的安全电子邮件系统，可支持加密电子邮件的发送和接收，并在其中加入加密邮件的过滤功能，根据邮件的关键字进行过滤搜索。</p>\r\n\r\n<p>本题要求有较高的动手能力和自学能力，具有挑战性。</p>', '1', '266', '331', null, '2017-04-23 00:00:00', '0', '1', '2016-10-18 00:49:39', '2016-10-18 00:49:39');
INSERT INTO `thesis` VALUES ('552', '1', '3', '基于机器视觉的木材缺陷检测系统', '数字图像处理', '生产实践', '基础研究', '<p>利用机器视觉技术，进行木材</p>', '1', '241', '334', null, '2017-04-30 00:00:00', '0', '1', '2016-10-18 00:52:32', '2016-10-18 00:52:32');
INSERT INTO `thesis` VALUES ('553', '1', '3', '安全电子投票系统的设计与实现', '信息安全', '科研项目', '基础研究', '<p>要求设计并实现一个电子投票系统，在其中加入安全机制，确保一人一票，唱票人不知道每个人的投票情况如何，只知道投票最终结果，保障投票的安全性和投票人的隐私性。</p>\r\n\r\n<p>本题要求具有较高的动手能力和自学能力，具有挑战性。</p>', '1', '266', '665', null, '2017-04-23 00:00:00', '0', '1', '2016-10-18 00:53:08', '2016-10-18 00:53:08');
INSERT INTO `thesis` VALUES ('554', '1', '3', '农产品电商系统的设计与实现', '应用软件开发', '生产实践', '应用研究', '<p>要求设计并实现一个有关农产品的电商系统，农民可在系统上销售农产品，也可在上面购买各种生产要素。</p>\r\n\r\n<p>系统开发语言不限。</p>', '1', '266', '288', null, '2017-04-23 00:00:00', '0', '1', '2016-10-18 00:55:17', '2016-10-19 17:57:05');
INSERT INTO `thesis` VALUES ('555', '1', '3', '安全增强型聊天软件的设计与实现', '应用软件开发', '生产实践', '应用研究', '<p>要求设计一个类似于Snapchat的聊天软件，在实现基本的文字聊天功能外，还可发送图片和视频片段；可实现聊天消息的撤回和自动焚毁功能；支持文本消息的加密功能。</p>\r\n\r\n<p>本题要求有较好的动手能力。</p>', '1', '266', '313', null, '2017-04-23 00:00:00', '0', '1', '2016-10-18 01:09:03', '2016-10-18 01:09:03');
INSERT INTO `thesis` VALUES ('556', '1', '3', '党费管理系统的设计与实现', '应用软件开发', '生产实践', '应用研究', '<p>设计并实现一个党费收缴的管理系统，实现党费缴纳记录的增、删、查、改等基本和相应的统计功能；支持人员的工资数据导入；支持党费缴纳情况的统计。</p>\r\n\r\n<p>本题不限编程语言。</p>', '1', '266', '664', null, '2017-04-23 00:00:00', '0', '1', '2016-10-18 01:11:14', '2016-10-18 01:11:14');
INSERT INTO `thesis` VALUES ('557', '1', '3', '基于树莓派的出入监控系统的设计与实现', '应用软件开发', '生产实践', '应用研究', '<p>基于树莓派，设计并实现一个大门出入的监控系统，要求在有人进出时自动拍照记录，包括出入者的照片以及时间等信息。支持对出入者的出入信息进行统计分析。</p>\r\n\r\n<p>本题要求有较好的动手能力和自学能力。</p>', '1', '266', null, null, '2017-04-23 00:00:00', '0', '1', '2016-10-18 01:23:03', '2016-10-18 01:23:03');
INSERT INTO `thesis` VALUES ('558', '1', '3', '车位共享系统的设计与实现', '应用软件开发', '生产实践', '应用研究', '<p>要求设计并实现一个车位共享系统，支持用户在闲时将自己的车位出租，支持用户租借别人的车位。系统应做好用户管理、押金管理、车位管理等，并提供地图导航功能。</p>', '1', '266', '670', null, '2017-04-23 00:00:00', '0', '1', '2016-10-18 01:30:29', '2016-10-18 01:30:29');
INSERT INTO `thesis` VALUES ('559', '1', '3', '连平县特色农产品信息服务平台设计', '应用软件开发', '科研项目', '应用研究', '<p>设计一个特色农产品信息服务平台（网站），主要功能包括：查询、统计、浏览、、交易、订单等。</p>', '1', '255', '301', null, '2017-04-23 00:00:00', '0', '1', '2016-10-18 09:06:45', '2016-10-19 14:24:45');
INSERT INTO `thesis` VALUES ('560', '1', '3', '康宁门店管理系统设计', '应用软件开发', '生产实践', '应用研究', '<p>开发一个MIS系统，对康宁的分店进行信息化管理。</p>', '1', '255', '300', null, '2017-04-23 00:00:00', '0', '1', '2016-10-18 09:13:21', '2016-10-19 20:57:18');
INSERT INTO `thesis` VALUES ('561', '1', '3', '嵌入式环境下基于3G的图像传输研究', '网络技术与应用', '科研项目', '基础研究', '<p>在ARM开发板、嵌入式Linux环境下，研究基于3G的图像传输。</p>\r\n\r\n<p>现有实验设备：ARM9、ARM11各1套，安装嵌入式linux操作系统，3G模块1个，无线AP和无线路由器各2个。</p>\r\n\r\n<p>欢迎对嵌入式感兴趣的同学选题，能够提升嵌入式开发水平！</p>', '1', '255', null, null, '2017-04-23 00:00:00', '0', '1', '2016-10-18 09:14:22', '2016-10-18 09:14:22');
INSERT INTO `thesis` VALUES ('562', '1', '3', 'ZigBee与WiFi的比较研究', '网络技术与应用', '科研项目', '基础研究', '<p>ZigBee和WiFi是两种常用的短距离无线传输技术，通过实验研究二者在传输速率、功耗、能耗、传输效率、传输距离等方面的性能。</p>\r\n\r\n<p>现有ZigBee和WiFi模块若干，以及物联网实验箱若干。欢迎对嵌入式感兴趣的同学选题，能够提升嵌入式开发水平！</p>', '1', '255', null, null, '2017-04-23 00:00:00', '0', '1', '2016-10-18 09:19:37', '2016-10-18 09:19:37');
INSERT INTO `thesis` VALUES ('563', '1', '3', '嵌入式平台下JPEG算法性能研究', '数字图像处理', '科研项目', '基础研究', '<p>JPEG是常用的压缩算法，本课题在ARM开发板和嵌入式Linux下研究JPEG算法的性能，包括压缩时间、压缩比、压缩质量等。</p>\r\n\r\n<p>现有ARM开发板若干，安装嵌入式Linux操作系统，移植了libjpeg函数库。</p>', '1', '255', null, null, '2017-04-23 00:00:00', '0', '1', '2016-10-18 09:23:22', '2016-10-18 09:23:22');
INSERT INTO `thesis` VALUES ('564', '1', '3', '停车场车位预定系统', '应用软件开发', '科研项目', '应用研究', '<p>开发一个停车场车位预定系统APP。</p>', '1', '255', '297', null, '2017-04-23 00:00:00', '0', '1', '2016-10-18 09:27:11', '2016-10-19 18:56:51');
INSERT INTO `thesis` VALUES ('565', '1', '3', '班务管理系统的设计与实现', '应用软件开发', '生产实践', '应用研究', '<p>熟练掌握一种软件开发语言，熟悉软件开发流程，能够进行软件需求分析，并根据需求分析文档进行系统的构建与开发！</p>', '1', '247', '361', null, '2017-03-01 00:00:00', '0', '1', '2016-10-18 10:28:18', '2016-10-18 10:28:18');
INSERT INTO `thesis` VALUES ('566', '1', '3', '学生在线考试系统的设计与实现', '应用软件开发', '生产实践', '应用研究', '<p>熟练掌握一种软件开发语言，熟悉软件开发流程，能够进行软件需求分析，并根据需求分析文档进行系统的构建与开发！</p>', '1', '247', '557', null, '2017-03-01 00:00:00', '0', '1', '2016-10-18 10:29:47', '2016-10-18 10:30:05');
INSERT INTO `thesis` VALUES ('567', '1', '3', 'Android平台个手机游戏开发与实现', '应用软件开发', '生产实践', '应用研究', '<p>熟练掌握Android平台开发流程，能够进行软件需求分析，并根据需求分析文档进行系统的构建与开发！</p>', '1', '247', null, null, '2017-03-01 00:00:00', '0', '1', '2016-10-18 10:31:34', '2016-10-18 10:33:02');
INSERT INTO `thesis` VALUES ('568', '1', '3', '客户关系管理系统的设计与实现', '应用软件开发', '生产实践', '应用研究', '<p>熟练掌握一种软件开发语言，熟悉软件开发流程，能够进行软件需求分析，并根据需求分析文档进行系统的构建与开发！</p>', '1', '247', null, null, '2017-03-01 00:00:00', '0', '1', '2016-10-18 10:35:21', '2016-10-18 10:54:23');
INSERT INTO `thesis` VALUES ('569', '1', '3', '易书网开发与设计', '应用软件开发', '其他', '其他', '<p>基于mybatis架构，mysql数据库、java开发语言；</p>\r\n\r\n<p>开发图书交易、换购电子商务系统。</p>', '1', '278', '541', null, '2017-03-31 00:00:00', '0', '1', '2016-10-18 10:49:16', '2016-10-19 12:58:41');
INSERT INTO `thesis` VALUES ('570', '1', '3', '基于多目标进化算法的音频分类系统', '人工智能', '科研项目', '基础研究', '<p>熟练掌握一种编程语言，能够进行一定的文献查找与阅读。</p>', '1', '247', null, null, '2017-03-01 00:00:00', '0', '1', '2016-10-18 10:51:31', '2016-10-18 10:57:30');
INSERT INTO `thesis` VALUES ('571', '1', '3', '基于多目标进化算法的语言情感识别系统', '人工智能', '科研项目', '基础研究', '<p>熟练掌握一种编程语言，能够进行一定的文献查找与阅读。</p>', '1', '247', null, null, '2017-03-01 00:00:00', '0', '1', '2016-10-18 10:54:04', '2016-10-18 10:57:14');
INSERT INTO `thesis` VALUES ('572', '1', '3', '基于多目标进化算法的股票预测系统', '人工智能', '科研项目', '基础研究', '<p>熟练掌握一种编程语言，能够进行一定的文献查找与阅读能力。</p>', '1', '247', null, null, '2017-03-01 00:00:00', '0', '1', '2016-10-18 10:57:03', '2016-10-18 10:57:03');
INSERT INTO `thesis` VALUES ('573', '1', '3', '多目标进化算法研究', '人工智能', '科研项目', '基础研究', '<p>熟练掌握一种编程语言，能够进行一定的文献查找与阅读。</p>', '1', '247', null, null, '2017-03-01 00:00:00', '0', '1', '2016-10-18 10:59:21', '2016-10-18 10:59:21');
INSERT INTO `thesis` VALUES ('574', '1', '3', '新闻媒体管理信息APP系统设计开发', '应用软件开发', '生产实践', '设计性', '<p>根据传统新闻媒体业务流程（比如南方日报、羊城晚报等），分析业务需求设计相应的功能模块和信息系统架构，并针对每一个模块详细设计数据原型，完成信息系统的数据库设计；采用移动终端开发技术实现该信息系统的APP开发，完成主要应用功能模块，实现</p>', '1', '233', '517', null, '2017-04-18 00:00:00', '0', '1', '2016-10-18 11:16:14', '2016-10-18 11:16:14');
INSERT INTO `thesis` VALUES ('575', '1', '3', 'DHCP在校网应用中的安全问题及对策研究', '网络技术与应用', '其他', '应用研究', '<p><span style=\"background-color:#ffffff; color:#333333\">DHCP(动态主机配置协议)为用户上网提供极大便利,也减轻了 网络管理员分配IP地址的负担.但是,DHCP本身不存在身份认证机制,网络上的主机很容易模拟DHCP服务器或客户机,恶意获得IP访问校园内外的网 络,从而影响正常教学.</span></p>\r\n\r\n<p>要求：</p>\r\n\r\n<p>1、熟悉DNCP原理</p>\r\n\r\n<p>2、了解DHCP安全隐患</p>\r\n\r\n<p>3、给出解决隐患的对策</p>', '1', '218', '653', null, '2017-04-23 00:00:00', '0', '1', '2016-10-18 11:21:59', '2016-10-18 13:16:35');
INSERT INTO `thesis` VALUES ('576', '1', '3', '实验室资产管理RFID信息系统设计开发', '应用软件开发', '生产实践', '应用研究', '<p>根据实验室设备资产管理工作的需求，分析业务流程建立管理信息化模型，学习研究RFID应用技术，并针对实验室繁多的资产设备管理需求，制定可行的基于RFID的实验室资产便捷化管理解决方案，该方案要求满足可行性、可靠性、易用性和较高的性价比；完成该信息系统的设计开发，要求该系统具有较好的用户体验和操作界面，并能在实验室成功试用测试。</p>', '1', '233', '566', null, '2017-04-18 00:00:00', '0', '1', '2016-10-18 11:25:13', '2016-10-18 11:25:13');
INSERT INTO `thesis` VALUES ('577', '1', '3', '农产品质量安全溯源系统移动平台设计与开发', '应用软件开发', '科研项目', '设计性', '<p>研究农产品质量安全溯源流程及关键环节处理技术、了解快速检测机制、生产者和销售者基本需求，结合可用的RFID技术和二维码应用系统，设计出适用于农产品安全溯源的信息系统；移动APP开发技术</p>', '1', '233', '627', null, '2017-04-18 00:00:00', '0', '1', '2016-10-18 11:30:36', '2016-10-18 11:30:36');
INSERT INTO `thesis` VALUES ('578', '1', '3', '畜禽产品质量安全风险预警大数据系统研究', '数据挖掘', '科研项目', '应用研究', '<p>根据畜禽产品安全检测数据，结合大数据思想，建立畜禽产品安全风险模型，并根据往年监测数据（以广东省农业厅每年度的监测数据例），构建安全模型及参数因子，并应用BP神经网络简历模型进行预警预测研究</p>', '1', '233', '580', null, '2017-04-18 00:00:00', '0', '1', '2016-10-18 11:37:45', '2016-10-18 11:37:45');
INSERT INTO `thesis` VALUES ('579', '1', '3', '无线校园网络的ARP 欺骗防范', '网络技术与应用', '其他', '应用研究', '<p>随着现在数字化校园的建设，无线网络的好处更是在高校都带来了很大程度的便捷，但同时出现的APP 欺诈问题是对校园网带来危害。</p>\r\n\r\n<p>要求：</p>\r\n\r\n<p>1、熟悉ARP原理</p>\r\n\r\n<p>2、了解ARP欺骗</p>\r\n\r\n<p>3、了解无线校园网络APP 欺骗方式</p>\r\n\r\n<p>4、针对相应的欺骗方式，提出了相关的防范策略，并实现</p>', '1', '218', '410', null, '2017-04-23 00:00:00', '0', '1', '2016-10-18 13:06:16', '2016-10-18 13:12:46');
INSERT INTO `thesis` VALUES ('580', '1', '3', '基于SDN的DDOS攻击检测', '网络技术与应用', '其他', '应用研究', '<p><span style=\"background-color:#ffffff; color:#333333\">软件定义网络(Software Defined Network, SDN )，是</span><a href=\"http://baike.so.com/doc/324922-344218.html\" style=\"font: 14px/24px arial, sans-serif; color: rgb(19, 110, 194); text-transform: none; text-indent: 28px; letter-spacing: normal; text-decoration: none; word-spacing: 0px; white-space: normal; widows: 1; font-size-adjust: none; font-stretch: normal; background-color: rgb(255, 255, 255); -webkit-text-stroke-width: 0px;\" target=\"_blank\">Emulex</a><span style=\"background-color:#ffffff; color:#333333\">网络一种新型网络创新架构，是网络虚拟化的一种实现方式，其核心技术</span><a href=\"http://baike.so.com/doc/5467711-5705623.html\" style=\"font: 14px/24px arial, sans-serif; color: rgb(19, 110, 194); text-transform: none; text-indent: 28px; letter-spacing: normal; text-decoration: none; word-spacing: 0px; white-space: normal; widows: 1; font-size-adjust: none; font-stretch: normal; background-color: rgb(255, 255, 255); -webkit-text-stroke-width: 0px;\" target=\"_blank\">OpenFlow</a><span style=\"background-color:#ffffff; color:#333333\">通过将网络设备控制面与数据面分离开来，从而实现了网络流量的灵活控制，使网络作为管道变得更加智能。</span></p>\r\n\r\n<p><span style=\"background-color:#ffffff; color:#333333\">要求：</span></p>\r\n\r\n<p><span style=\"background-color:#ffffff; color:#333333\">1、理解SDN</span></p>\r\n\r\n<p>2、熟悉DDOS攻击原理</p>\r\n\r\n<p>3、<span style=\"background-color:#ffffff; color:#333333\">根据DDoS击特性与OpenFlow技术,提出一种基于软件定义网络（SDN）的DDoS攻击检测方法</span></p>', '1', '218', '293', null, '2017-04-23 00:00:00', '0', '1', '2016-10-18 13:35:53', '2016-10-19 11:20:28');
INSERT INTO `thesis` VALUES ('581', '1', '3', '基于半监督分类的情感分析方法', '人工智能', '科研项目', '应用研究', '<p>调研半监督分类方法及情感分析方法的最新进展，并结合特定数据集尝试做一些改进。</p>', '1', '262', '520', null, '2017-04-23 00:00:00', '0', '1', '2016-10-18 13:41:31', '2016-10-18 17:51:40');
INSERT INTO `thesis` VALUES ('582', '1', '3', '口语对话系统中超出领域话语的对话行为识别', '人工智能', '科研项目', '应用研究', '<p>研究短文本分类方法，并应用于限定领域口语对话系统中超出领域话语的对话行为分类。</p>', '1', '262', '622', null, '2017-04-23 00:00:00', '0', '1', '2016-10-18 13:44:03', '2016-10-18 17:29:00');
INSERT INTO `thesis` VALUES ('583', '1', '3', '医院门诊查询系统', '应用软件开发', '生产实践', '应用研究', '<p>《医院门诊查询系统》</p>\r\n\r\n<p>1. 可以开发一个基于移动终端手机APP的软件或者是公共号。</p>\r\n\r\n<p>2. 可以使看病人查询到某个医院的医生出诊时间和预约时间，在线挂号，在线取号，候诊队列，就诊缴费，取报告单等。</p>\r\n\r\n<p>3. 医院介绍可以包括首页，医院介绍，科室介绍，住院服务等。</p>\r\n\r\n<p>4. 我的账户可以包括我的单据，我的就诊卡，订餐服务等。</p>\r\n\r\n<p>5. 一定要在摘要中说明，你的论文中设计的医院门诊查询系统与其他现有的系统相比有什么区别，优势在哪里？！</p>\r\n\r\n<p>6. 建议成绩排名在前50%的同学选该题目。</p>', '1', '279', '362', null, '2017-04-10 00:00:00', '0', '1', '2016-10-18 13:53:28', '2016-10-18 13:53:28');
INSERT INTO `thesis` VALUES ('584', '1', '3', '学生网上选课系统', '应用软件开发', '生产实践', '应用研究', '<p>《学生网上选课系统》</p>\r\n\r\n<p>1. 可以基于手机等移动终端开发一个APP或者公共号。</p>\r\n\r\n<p>2. 学生网上选课系统-可以方便本校学生进行网上选课的功能，并能记录个人大学四年的选课记录。</p>\r\n\r\n<p>3， 一定要与现在使用的网上选课系统进行对比，并作出改进和完善。</p>\r\n\r\n<p>4. 建议成绩排名在前50%的同学选该课题！</p>', '1', '279', '406', null, '2017-04-10 00:00:00', '0', '1', '2016-10-18 13:56:36', '2016-10-18 13:56:36');
INSERT INTO `thesis` VALUES ('585', '1', '3', '学生评奖评优管理子系统', '应用软件开发', '生产实践', '应用研究', '<p>《学生评奖评优管理子系统》</p>\r\n\r\n<p>1. 完成一个学生评奖评优管理子系统的开发。</p>\r\n\r\n<p>2. 该评奖评优的系统一定要做好前期的需求分析。</p>\r\n\r\n<p>3，一定要与现有的其他学生评奖评优的系统做对比，并作出改进。</p>\r\n\r\n<p>4，建议成绩排名在前50%的同学选该课题！</p>', '1', '279', '353', null, '2017-04-10 00:00:00', '0', '1', '2016-10-18 13:59:17', '2016-10-18 13:59:17');
INSERT INTO `thesis` VALUES ('586', '1', '3', '在线购物系统的设计与实现', '应用软件开发', '生产实践', '应用研究', '<p>《在线购物系统的设计与实现》</p>\r\n\r\n<p>1. 设计并开发一个在线购物系统，可以自己选择类别，例如购书系统或者类似京东等。</p>\r\n\r\n<p>2. 自己完成前期的需求分析，并与其他现有的购物系统进行对比，并作出自己的改进。</p>\r\n\r\n<p>3. 建议成绩排名在前50%的同学选该课题。</p>', '1', '279', '482', null, '2017-04-10 00:00:00', '0', '1', '2016-10-18 14:09:11', '2016-10-18 14:09:11');
INSERT INTO `thesis` VALUES ('587', '1', '3', '口语对话系统中的对话行为分类', '人工智能', '科研项目', '应用研究', '<p>对代表性的口语对话系统的语料进行分析，研究对话行为分类方法。</p>', '1', '262', '621', null, '2017-04-23 00:00:00', '0', '1', '2016-10-18 14:12:09', '2016-10-18 17:31:14');
INSERT INTO `thesis` VALUES ('588', '1', '3', '论文投稿系统的设计与实现', '应用软件开发', '生产实践', '应用研究', '<p>《论文投稿系统的设计与实现》</p>\r\n\r\n<p>1. 要求是完成一个英文版的论文投稿系统的设计与实现。</p>\r\n\r\n<p>2， 前期一定要完成需求分析，并与现有的其他论文投稿系统做好对比，并作出改进。</p>\r\n\r\n<p>3. 该系统应该包括基本的账号注册，登录系统，并激活系统。包括论文的投稿各个步骤。</p>\r\n\r\n<p>4. 可以参考现有的IEEE 期刊英文论文投稿系统。</p>\r\n\r\n<p>5.建议成绩排名在前50%的同学选该课题。</p>', '1', '279', '423', null, '2017-04-10 00:00:00', '0', '1', '2016-10-18 14:12:54', '2016-10-18 14:12:54');
INSERT INTO `thesis` VALUES ('589', '1', '3', '基于WEB的图书馆借阅系统的设计与实现', '应用软件开发', '生产实践', '应用研究', '<p>《基于WEB的图书馆借阅系统的设计与实现》</p>\r\n\r\n<p>1. 完成一个基于WEB的图书馆借阅系统的设计与实现。</p>\r\n\r\n<p>2。 前期完成该系统的所有需求分析工作。</p>\r\n\r\n<p>3. 一定与现有的图书馆借阅系统进行对比，并作出自己的改进。</p>\r\n\r\n<p>4. 建议成绩排名在前50%的同学选该课题。</p>', '1', '279', '434', null, '2017-04-10 00:00:00', '0', '1', '2016-10-18 14:15:12', '2016-10-18 14:15:12');
INSERT INTO `thesis` VALUES ('590', '1', '3', '交互式交通事故虚拟理赔助理', '人工智能', '科研项目', '应用研究', '<p>研究交互式虚拟个人助理实现技术，并应用于交通事故理赔业务。</p>', '1', '262', '518', null, '2017-04-23 00:00:00', '0', '1', '2016-10-18 14:16:06', '2016-10-18 17:16:18');
INSERT INTO `thesis` VALUES ('591', '1', '3', '基于深度学习的微博立场分析', '人工智能', '科研项目', '应用研究', '<p>研究卷积神经网络等深度学习框架，并应用于微博立场分析。</p>', '1', '262', '476', null, '2017-04-23 00:00:00', '0', '1', '2016-10-18 14:19:47', '2016-10-18 17:27:39');
INSERT INTO `thesis` VALUES ('592', '1', '3', '基于主成分分析的人脸识别算法', '人工智能', '科研项目', '基础研究', '<p>《基于主成分分析的人脸识别算法》</p>\r\n\r\n<p>1. 完成基于主成分分析的人脸识别算法，并做出改进算法。</p>\r\n\r\n<p>2. 算法实验要求用matlab实现。</p>\r\n\r\n<p>3. 前期可以看一些关于人脸识别与主成分分析PCA的算法介绍。</p>\r\n\r\n<p>4. 建议成绩排名在年级前50%的学生选该课题</p>', '1', '279', '404', null, '2017-04-10 00:00:00', '0', '1', '2016-10-18 14:20:56', '2016-10-18 14:20:56');
INSERT INTO `thesis` VALUES ('593', '1', '3', '基于线性鉴别分析的人脸识别算法的研究', '人工智能', '科研项目', '基础研究', '<p>《基于线性鉴别分析的人脸识别算法的研究》</p>\r\n\r\n<p>1. 该课题需要使用matlab软件实现基于线性鉴别分析的人脸识别算法。</p>\r\n\r\n<p>2. 需要下载两个到三个人脸数据库，老师也可以提供。</p>\r\n\r\n<p>3. 前期需要准备和阅读的资料较多，需要自己在网上查阅与线性鉴别分析LDA算法和人脸识别算法相关的资料</p>\r\n\r\n<p>4. 可以搜索相关的中文和英文论文并阅读实现。</p>\r\n\r\n<p>5. 建议成绩排名在年级前50%的同学选该课题。</p>', '1', '279', '290', null, '2017-04-10 00:00:00', '0', '1', '2016-10-18 14:24:27', '2016-10-18 14:24:27');
INSERT INTO `thesis` VALUES ('594', '1', '3', '基于大数据的铁路旅客流量预测系统', '应用软件开发', '生产实践', '应用研究', '<p>通过日常铁路客运流量情况等数据，对铁路旅客流量进行预测。</p>\r\n\r\n<p>&nbsp;</p>', '1', '241', '303', null, '2017-04-30 00:00:00', '0', '1', '2016-10-18 14:29:17', '2016-10-19 13:02:53');
INSERT INTO `thesis` VALUES ('595', '1', '3', '基于kinect相机的水果识别与定位系统', '应用软件开发', '生产实践', '基础研究', '<p>基于微软XBOX360游戏机里的kinect相机，对水果进行识别和定位。</p>\r\n\r\n<p>欢迎有兴趣的同学加入。</p>\r\n\r\n<p>QQ: 77481028，彭老师</p>', '1', '241', null, null, '2017-04-30 00:00:00', '0', '1', '2016-10-18 14:35:53', '2016-10-18 14:40:32');
INSERT INTO `thesis` VALUES ('596', '1', '3', '蛹虫草种植管理系统', '应用软件开发', '科研项目', '基础研究', '<p>针对蛹虫草的生长周期的特点，开发实现一个蛹虫草的种植管理系统。</p>\r\n\r\n<p><br />\r\nTEL:13527723968&nbsp;&nbsp;&nbsp; email: 632499155@qq.com</p>', '1', '228', null, null, '2017-05-20 00:00:00', '0', '1', '2016-10-18 14:40:35', '2016-10-18 14:40:35');
INSERT INTO `thesis` VALUES ('597', '1', '3', '手游app开发', '应用软件开发', '科研项目', '基础研究', '<p>开发一款手游app,主题可自拟。</p>\r\n\r\n<p><br />\r\nTEL:13527723968&nbsp;&nbsp;&nbsp; email: 632499155@qq.com</p>\r\n\r\n<p>&nbsp;</p>', '1', '228', null, null, '2017-05-20 00:00:00', '0', '1', '2016-10-18 14:42:43', '2016-10-19 18:48:51');
INSERT INTO `thesis` VALUES ('598', '1', '3', '手机休闲游戏设计与实现', '应用软件开发', '科研项目', '基础研究', '<p>设计实现一款手机休闲游戏，如开心消消乐，主题可自拟。</p>\r\n\r\n<p>TEL:13527723968&nbsp;&nbsp;&nbsp; email: 632499155@qq.com</p>', '1', '228', '569', null, '2017-05-20 00:00:00', '0', '1', '2016-10-18 14:43:26', '2016-10-18 14:43:26');
INSERT INTO `thesis` VALUES ('599', '1', '3', '儿童益智游戏设计与实现', '应用软件开发', '科研项目', '基础研究', '<p>设计实现一款儿童益智游戏，如英语音标学习游戏，主题可自拟。</p>\r\n\r\n<p>TEL:13527723968&nbsp;&nbsp;&nbsp; email: 632499155@qq.com</p>', '1', '228', '633', null, '2017-05-20 00:00:00', '0', '1', '2016-10-18 14:44:59', '2016-10-18 14:44:59');
INSERT INTO `thesis` VALUES ('600', '1', '3', '基于安卓的记账工具设计开发', '应用软件开发', '科研项目', '基础研究', '<p>。</p>\r\n\r\n<p>TEL:13527723968&nbsp;&nbsp;&nbsp; email: 632499155@qq.com</p>', '1', '228', '327', null, '2017-05-20 00:00:00', '0', '1', '2016-10-18 14:45:42', '2016-10-19 16:42:52');
INSERT INTO `thesis` VALUES ('601', '1', '3', '基于手机的华农公益众筹平台', '应用软件开发', '科研项目', '基础研究', '<p>针对华南农业大学的公益捐助，开发一个基于手机的教育公益众筹平台。</p>\r\n\r\n<p>TEL:13527723968&nbsp;&nbsp;&nbsp; email: 632499155@qq.com</p>', '1', '228', null, null, '2017-05-20 00:00:00', '0', '1', '2016-10-18 14:46:18', '2016-10-18 14:46:18');
INSERT INTO `thesis` VALUES ('602', '1', '3', '大学生综合测评系统的设计与实现', '应用软件开发', '科研项目', '基础研究', '<p>高校综合测评工作多采用手工录入、人工提交信息的方式，占用了综合测评相关老师和学生的大量时间和精力。针对这种现状，研究高校综合测评工作的业务流程，设计和实现一个基于Web的大学生综合测评系统。</p>\r\n\r\n<p>TEL:13527723968&nbsp;&nbsp;&nbsp; email: 632499155@qq.com</p>', '1', '228', '659', null, '2017-05-20 00:00:00', '0', '1', '2016-10-18 14:46:51', '2016-10-18 14:46:51');
INSERT INTO `thesis` VALUES ('603', '1', '3', '基于手机的小学生课程日历系统', '应用软件开发', '科研项目', '基础研究', '<p>小学生由于年龄小，认知程度有限，经常会遗忘第二天所要上的课程信息，或者忘记课程所要准备的备品信息；另外家长为了孩子的全面发展，会给学生选择兴趣班学习，这些信息也需要进行全面周详的管理。开发一个适用于小学生的课程日历系统，能够帮助家长合理安排时间。</p>\r\n\r\n<p><br />\r\nTEL:13527723968&nbsp;&nbsp;&nbsp; email: 632499155@qq.com</p>', '1', '228', '656', null, '2017-05-20 00:00:00', '0', '1', '2016-10-18 14:47:19', '2016-10-18 14:47:19');
INSERT INTO `thesis` VALUES ('604', '1', '3', '基于手机的在线教辅系统', '应用软件开发', '科研项目', '基础研究', '<p>设计实现一个在线教辅平台，是课堂教学的有益补充，体现个性化学习，可以显著地提高老师和学校的工作效率和学生的学习质量。</p>\r\n\r\n<p><br />\r\nTEL:13527723968&nbsp;&nbsp;&nbsp; email: 632499155@qq.com</p>', '1', '228', null, null, '2017-05-20 00:00:00', '0', '1', '2016-10-18 14:47:50', '2016-10-18 14:47:50');
INSERT INTO `thesis` VALUES ('605', '1', '3', '基于LBS应用的逛街宝系统', '应用软件开发', '科研项目', '基础研究', '<p>结合LBS技术，对用户实现定位、查看周边商店信息，检索购物信息以及评价信息等。</p>\r\n\r\n<p><br />\r\nTEL:13527723968&nbsp;&nbsp;&nbsp; email: 632499155@qq.com</p>', '1', '228', '587', null, '2017-05-20 00:00:00', '0', '1', '2016-10-18 14:48:57', '2016-10-18 14:48:57');
INSERT INTO `thesis` VALUES ('606', '1', '3', '党校培训考试管理系统', '应用软件开发', '科研项目', '基础研究', '<p>目前在高校中大部分党校结业的考试还是采用过去传统的考试方式,这种方式既耗费人力物力又浪费时间。利用计算机相关技术设计开发一个党校培训考试系统，为党校培训工作提供更有力的支撑。</p>\r\n\r\n<p><br />\r\nTEL:13527723968&nbsp;&nbsp;&nbsp; email: 632499155@qq.com<br />\r\n&nbsp;</p>', '1', '228', '473', null, '2017-05-20 00:00:00', '0', '1', '2016-10-18 14:49:26', '2016-10-18 14:49:26');
INSERT INTO `thesis` VALUES ('607', '1', '3', 'DNA三维结构模建', '应用软件开发', '科研项目', '基础研究', '<p>根据用户给定的DNA序列，模建DNA的标准B型三维结构.<br />\r\nTEL:13527723968&nbsp;&nbsp;&nbsp; email: 632499155@qq.com</p>', '1', '228', null, null, '2017-05-20 00:00:00', '0', '1', '2016-10-18 14:51:01', '2016-10-18 14:51:01');
INSERT INTO `thesis` VALUES ('608', '1', '3', 'SQL漏洞检测系统的研究与实现', '网络技术与应用', '其他', '应用研究', '<p><span style=\"background-color:#ffffff; color:#333333\">SQL漏洞就是Web安全中最常见的的一种安全漏洞。随着未来大数据的崛起,Web应用会越来越倾向于以数据为中心,而SQL漏洞问题自然是Web安全研究的重点。所以研究SQL漏洞的检测和防御对Web安全具有重要意义。</span></p>\r\n\r\n<p><span style=\"background-color:#ffffff; color:#333333\">要求：</span></p>\r\n\r\n<p><span style=\"background-color:#ffffff; color:#333333\">1、熟悉SQL漏洞的攻击原理</span></p>\r\n\r\n<p><span style=\"background-color:#ffffff; color:#333333\">2、了解SQL漏洞检测的相关技术，</span></p>\r\n\r\n<p><span style=\"background-color:#ffffff; color:#333333\">3、</span>分析对比<span style=\"background-color:#ffffff; color:#333333\">经典方法和国内外的先进技术的优缺点</span></p>\r\n\r\n<p><span style=\"background-color:#ffffff; color:#333333\">4、设计一种SQL漏洞的检测</span></p>', '1', '218', '648', null, '2017-04-23 00:00:00', '0', '1', '2016-10-18 14:52:22', '2016-10-18 14:52:22');
INSERT INTO `thesis` VALUES ('609', '1', '3', '研究所信息发布系统', '应用软件开发', '生产实践', '设计性', '<p>研究所信息发布系统</p>', '1', '261', null, null, '2017-04-30 00:00:00', '0', '1', '2016-10-18 14:53:38', '2016-10-18 14:53:38');
INSERT INTO `thesis` VALUES ('610', '1', '3', '分布式服务器架构', '应用软件开发', '生产实践', '设计性', '<p>分布式服务器架构</p>', '1', '261', null, null, '2017-04-30 00:00:00', '0', '1', '2016-10-18 14:56:17', '2016-10-18 14:56:51');
INSERT INTO `thesis` VALUES ('611', '1', '3', 'LINUX环境下的防火墙网络安全设计与实现', '网络技术与应用', '其他', '应用研究', '<p><span style=\"background-color:#ffffff; color:#333333\">网络在我们日常生产生活中应用越来越普及,黑客技术也在不断发展,网络在改变我们的生活的同时,我们面临的威胁也越来越大,如何避免网络不受到非法的攻击,保证网络安全是目前必须要解决的一个重大问题。防火墙是保护网络安全的一个重要措施。</span></p>\r\n\r\n<p>要求：</p>\r\n\r\n<p>1、 熟悉网络受到主要攻击</p>\r\n\r\n<p>2、熟悉防火墙工作原理</p>\r\n\r\n<p>3、在linux下，设计并实现软件防火墙，完成对数据库安全防护，，完成对网络监控与监听防止信息泄漏</p>\r\n\r\n<p> </p>\r\n\r\n<p> </p>', '1', '218', '341', null, '2017-04-23 00:00:00', '0', '1', '2016-10-18 15:21:36', '2016-10-18 15:49:03');
INSERT INTO `thesis` VALUES ('612', '1', '3', '基于多目标进化算法的聚类算法研究', '人工智能', '科研项目', '基础研究', '<table cellpadding=\"5\" class=\"form-table\" style=\"width:100%\">\r\n	<tbody>\r\n		<tr>\r\n			<td>&nbsp;</td>\r\n			<td colspan=\"5\">\r\n			<p>熟练掌握一种编程语言，能够进行一定的文献查找与阅读</p>\r\n			</td>\r\n		</tr>\r\n	</tbody>\r\n</table>', '1', '247', null, null, '2017-03-01 00:00:00', '0', '1', '2016-10-18 15:37:58', '2016-10-18 15:39:26');
INSERT INTO `thesis` VALUES ('613', '1', '3', '移动学习平台设计与实现', '应用软件开发', '生产实践', '应用研究', '<p>熟练掌握一种软件开发语言，熟悉软件开发流程，能够进行软件需求分析，并根据需求分析文档进行系统的构建与开发！</p>', '1', '247', null, null, '2017-03-01 00:00:00', '0', '1', '2016-10-18 15:44:46', '2016-10-18 15:45:04');
INSERT INTO `thesis` VALUES ('614', '1', '3', '入侵检测系统设计与实现', '网络技术与应用', '其他', '应用研究', '<p>防火墙在网络安全保障体系中是非常重要的一环． 但有时入侵者会设法绕过防火墙． 而且内部的网络也不是一个安全的环境． 因此，需要在防火墙的后面有另外一道墙，那就是入侵检测。</p>\r\n\r\n<p>要求：</p>\r\n\r\n<p>1、熟悉入侵检测的原理</p>\r\n\r\n<p>2、熟悉IPV6工作</p>\r\n\r\n<p>3、了解IPV6下，系统漏洞</p>\r\n\r\n<p>&nbsp;、IPV6下，设计并实现入侵检测</p>', '1', '218', '307', null, '2017-04-23 00:00:00', '0', '1', '2016-10-18 15:48:03', '2016-10-18 15:48:03');
INSERT INTO `thesis` VALUES ('615', '1', '3', '新生报到系统', '应用软件开发', '生产实践', '基础研究', '', '1', '224', '677', null, '2016-10-18 00:00:00', '0', '1', '2016-10-18 15:51:44', '2016-10-18 15:56:58');
INSERT INTO `thesis` VALUES ('616', '1', '3', '跨平台校内兼职应用', '应用软件开发', '生产实践', '基础研究', '', '1', '224', '678', null, '2016-10-18 00:00:00', '0', '1', '2016-10-18 15:52:37', '2016-10-18 15:52:37');
INSERT INTO `thesis` VALUES ('617', '1', '3', '基于微信二次开发的田间管理信息系统', '应用软件开发', '生产实践', '基础研究', '', '1', '224', '699', null, '2016-10-18 00:00:00', '0', '1', '2016-10-18 15:53:40', '2016-10-18 15:53:40');
INSERT INTO `thesis` VALUES ('618', '1', '3', '基于WEB的房屋出租管理系统', '应用软件开发', '生产实践', '基础研究', '', '1', '224', '700', null, '2016-10-18 00:00:00', '0', '1', '2016-10-18 15:54:17', '2016-10-18 15:54:17');
INSERT INTO `thesis` VALUES ('619', '1', '3', '数字产品交易的电子商务平台', '应用软件开发', '生产实践', '基础研究', '', '1', '224', '701', null, '2016-10-18 00:00:00', '0', '1', '2016-10-18 15:54:50', '2016-10-18 15:54:50');
INSERT INTO `thesis` VALUES ('620', '1', '3', '基于SpringMVC和Hibernate的教材管理子系统的开发', '应用软件开发', '生产实践', '基础研究', '', '1', '224', '723', null, '2016-10-18 00:00:00', '0', '1', '2016-10-18 15:55:31', '2016-10-18 15:55:31');
INSERT INTO `thesis` VALUES ('621', '1', '3', '基于SpringMVC与Hibernate高校迎新系统中内容管理子系统应用', '应用软件开发', '生产实践', '基础研究', '', '1', '224', '724', null, '2016-10-18 00:00:00', '0', '1', '2016-10-18 15:56:10', '2016-10-18 15:56:10');
INSERT INTO `thesis` VALUES ('622', '1', '3', '基于SSM的门店导购系统后端支撑子系统的实现', '应用软件开发', '生产实践', '基础研究', '', '1', '224', '725', null, '2016-10-18 00:00:00', '0', '1', '2016-10-18 15:56:41', '2016-10-18 15:57:20');
INSERT INTO `thesis` VALUES ('623', '1', '3', '基于nodejs和mongodb的在线答题平台的实现', '应用软件开发', '生产实践', '基础研究', '', '1', '224', '741', null, '2016-10-18 00:00:00', '0', '1', '2016-10-18 15:57:52', '2016-10-18 15:57:52');
INSERT INTO `thesis` VALUES ('624', '1', '3', '基于Struts2和Hibernate的酒品商铺管理子系统应用', '应用软件开发', '生产实践', '基础研究', '', '1', '224', '742', null, '2016-10-18 00:00:00', '0', '1', '2016-10-18 15:58:29', '2016-10-18 15:58:29');
INSERT INTO `thesis` VALUES ('625', '1', '3', '基于SpringMVC和Mybatis的新闻评论社交子系统开发', '应用软件开发', '生产实践', '基础研究', '', '1', '224', '743', null, '2016-10-18 00:00:00', '0', '1', '2016-10-18 15:59:02', '2016-10-18 15:59:02');
INSERT INTO `thesis` VALUES ('626', '1', '3', '基于RTP协议的无线视频传输研究', '网络技术与应用', '科研项目', '基础研究', '<p>RTP是实时传输控制协议，主要用在IP网络中传输视频流，具有高速、实时性强的特点。本课题拟采用RTP协议通过WiFi无线网卡传输视频，并研究RTP的传输性能，如丢包率、时延、误码率等。</p>', '1', '255', '626', null, '2017-04-23 00:00:00', '0', '1', '2016-10-18 16:05:39', '2016-10-19 14:26:03');
INSERT INTO `thesis` VALUES ('627', '1', '3', 'OSPF路由协议漏洞分析及防范', '网络技术与应用', '其他', '应用研究', '<p>路由协议安全是网络安全的一个重要组成部分 .OSPF是目前应用广泛的路由协议</p>\r\n\r\n<p>要求：</p>\r\n\r\n<p>1、熟悉ospf工作原理</p>\r\n\r\n<p>2、了解ospf存在的安全漏洞 ,以及可能遭受的攻击 .</p>\r\n\r\n<p>3、,针对这些漏洞提出了新的防范策略</p>', '1', '218', '402', null, '2017-04-23 00:00:00', '0', '1', '2016-10-18 16:12:42', '2016-10-18 16:12:42');
INSERT INTO `thesis` VALUES ('628', '1', '3', '国税协同平台实现', '应用软件开发', '生产实践', '基础研究', '<p>将国税局的各个分散的系统集合成一个协同平台并添加其它新子系统方便用户统一使用。</p>\r\n\r\n<p>主要实现纳税服务子系统，并将其管理模块添加发布的信息展示在个人工作台。在系统权限方面将根据系统的角色管理模块配置的角色进行限定访问系统。系统中将5个子系统分别作为5个权限，每个角色可动态从5个权限中选择；进入每个子系统需要相对应的权限。</p>\r\n\r\n<p>hibernate+Struts2+spring）搭建三层框架，数据库选用mysql。</p>', '1', '224', '866', null, '2016-10-18 00:00:00', '0', '1', '2016-10-18 16:21:46', '2016-10-18 16:21:46');
INSERT INTO `thesis` VALUES ('629', '1', '3', 'BGP协议脆弱性分析与实现', '网络技术与应用', '其他', '应用研究', '<p>BGP协议又称边界网关协议，一般都由网络上的骨干路由器完成边界网关协议路由器的运行。BGP协议扮演着至关重要的通信角色，是边界网关路由器运行的最经典的路由协议。</p>\r\n\r\n<p>要求：</p>\r\n\r\n<p>1、熟悉BGP工作原理</p>\r\n\r\n<p>2、分析并学习BGP脆弱性</p>\r\n\r\n<p>3、设计并实现</p>', '1', '218', '643', null, '2017-04-23 00:00:00', '0', '1', '2016-10-18 16:23:31', '2016-10-18 16:23:31');
INSERT INTO `thesis` VALUES ('630', '1', '3', '基于nodejs的问卷调查系统设计与开发', '应用软件开发', '生产实践', '应用研究', '<p>基于nodejs的问卷调查系统设计与开发</p>', '1', '248', '522', null, '2017-05-01 00:00:00', '0', '1', '2016-10-18 16:30:15', '2016-10-18 16:30:15');
INSERT INTO `thesis` VALUES ('631', '1', '3', '基于ＳＤＮ架构的高性能网络拥塞避免策略', '网络技术与应用', '其他', '应用研究', '<p>：拥塞管理是高性能网络领域的重要研究方向，网络拥塞会对网络的全局性能产生较大影响。现有的拥塞管理多采用分布式拥塞避免策略，能够在一定程度上解决网络的拥塞问题，但其处理过程基于局部信息，不能充分利用网络资源，处理效率偏低。软件定义网络（ＳＤＮ）架构采用集中控制器和多层网络技术，能够较好地获取网络的全局信息。</p>\r\n\r\n<p>要求：</p>\r\n\r\n<p>1、熟悉SDN</p>\r\n\r\n<p>2、了解常用的网络拥塞避免策略</p>\r\n\r\n<p>3、设计一种基于ＳＤＮ架构的全局拥塞避免策略，并实现</p>', '1', '218', '650', null, '2017-04-23 00:00:00', '0', '1', '2016-10-18 16:31:04', '2016-10-18 16:31:04');
INSERT INTO `thesis` VALUES ('632', '1', '3', '基于pageoffice的办公文档展示系统设计与研究', '应用软件开发', '生产实践', '应用研究', '<p>基于pageoffice的办公文档展示系统设计与研究</p>', '1', '248', '528', null, '2017-05-01 00:00:00', '0', '1', '2016-10-18 16:32:57', '2016-10-18 16:32:57');
INSERT INTO `thesis` VALUES ('633', '1', '3', '基于HTML5的游戏开发研究', '应用软件开发', '生产实践', '应用研究', '<p>基于HTML5的游戏开发研究</p>', '1', '248', '594', null, '2017-05-01 00:00:00', '0', '1', '2016-10-18 16:34:35', '2016-10-18 16:34:35');
INSERT INTO `thesis` VALUES ('634', '1', '3', '基于Web的无线传感器网络可视化管理软件开发', '应用软件开发', '科研项目', '应用研究', '<p>为无线传感器网络开发一个可视化管理软件，管理采集的数据，具有可视化功能，包括网络在地图上的可视化、节点拓扑结构可视化、节点采集信息可视化、网络流量可视化等。</p>', '1', '255', null, null, '2017-04-23 00:00:00', '0', '1', '2016-10-18 16:39:15', '2016-10-18 16:40:36');
INSERT INTO `thesis` VALUES ('635', '1', '3', '基于“微课”的移动学习APP', '应用软件开发', '教学改革项目', '应用研究', '<p>教师：杨磊<br />\r\n电话：15918597385 短号：667385<br />\r\nE_mail:yanglei_s@126.com<br />\r\n办公室：信息学院612</p>', '1', '253', null, null, '2017-04-23 00:00:00', '0', '1', '2016-10-18 16:42:38', '2016-10-18 16:42:38');
INSERT INTO `thesis` VALUES ('636', '1', '3', '《数据库技术应用基础》课程学习网站', '应用软件开发', '教学改革项目', '应用研究', '<p>教师：杨磊<br />\r\n电话：15918597385 短号：667385<br />\r\nE_mail:yanglei_s@126.com<br />\r\n办公室：信息学院612</p>', '1', '253', '611', null, '2017-04-23 00:00:00', '0', '1', '2016-10-18 16:43:26', '2016-10-18 16:43:26');
INSERT INTO `thesis` VALUES ('637', '1', '3', '生猪质量安全追溯系统', '应用软件开发', '生产实践', '应用研究', '<p>教师：杨磊<br />\r\n电话：15918597385 短号：667385<br />\r\nE_mail:yanglei_s@126.com<br />\r\n办公室：信息学院612</p>', '1', '253', null, null, '2017-04-23 00:00:00', '0', '1', '2016-10-18 16:44:04', '2016-10-18 16:44:04');
INSERT INTO `thesis` VALUES ('638', '1', '3', '基于SDN 的BGP 路由优化方案', '网络技术与应用', '其他', '应用研究', '<p>边界网关协议（border gateway protocol，BGP）是一种自治系统间的动态路由发现协议，它的基本功能是在自治系统间自动交换无环路的路由信息，通过交换带有自治系统号（AS）序列属性的路径可达信息，构造自治区域的拓扑图，从而消除路由环路并实施用户配置的路由策略。</p>\r\n\r\n<p>要求：</p>\r\n\r\n<p>1、熟悉BGP原理，熟悉SDN知识</p>\r\n\r\n<p>2、分析传统BGP 路由选路机制缺陷</p>\r\n\r\n<p>3、采用SDN 控制技术，完成对BGP优化</p>\r\n\r\n<p>&nbsp;</p>\r\n\r\n<p>&nbsp;</p>\r\n\r\n<p>&nbsp;</p>', '1', '218', '615', null, '2017-04-23 00:00:00', '0', '1', '2016-10-18 16:45:40', '2016-10-18 16:45:40');
INSERT INTO `thesis` VALUES ('639', '1', '3', '基于javaSwing的分布式云存储系统研究与开发', '应用软件开发', '生产实践', '设计性', '<p> </p>\r\n\r\n<p>基于javaSwing的分布式云存储系统研究与开发</p>\r\n\r\n<p>在局域网上搭建一个弱中心的共享备份系统。使用javaSwing来开发。</p>\r\n\r\n<p> </p>\r\n\r\n<p>请先发邮件联系</p>\r\n\r\n<p>李西明</p>\r\n\r\n<p>liximing_cn@163.com</p>\r\n\r\n<p> </p>', '1', '246', null, null, '2017-05-01 00:00:00', '0', '1', '2016-10-18 16:57:02', '2016-10-18 17:36:41');
INSERT INTO `thesis` VALUES ('640', '1', '3', 'Andriod APP', '应用软件开发', '生产实践', '设计性', '<p>Andriod APP</p>', '1', '217', '416', null, '2017-05-20 00:00:00', '0', '1', '2016-10-18 17:21:47', '2016-10-18 17:21:47');
INSERT INTO `thesis` VALUES ('641', '1', '3', '基于node.js的爬虫系统', '应用软件开发', '生产实践', '应用研究', '<p>基于node.js的爬虫系统</p>', '1', '248', '317', null, '2017-05-01 00:00:00', '0', '1', '2016-10-18 17:28:07', '2016-10-18 17:28:07');
INSERT INTO `thesis` VALUES ('642', '1', '3', '基于Python的图形化基因序列比对系统研究与开发', '生物信息学', '生产实践', '应用研究', '<p>使用Biopython库，开发图形界面的序列比对系统，主要是研究blast算法使用。</p>\r\n\r\n<p>参考：</p>\r\n\r\n<p>http://biopython-cn.readthedocs.io/zh_CN/latest/cn/chr01.html</p>\r\n\r\n<p>Biopython工程是一个使用Python来开发计算分子生物学工具的国际团体。 Python是一种面向对象的、解释型的、灵活的语言，在计算机科学中日益流行。Python易学，语法明晰，并且能很容易的使用以C，C++或 者FORTRAN编写的模块实现扩展。</p>\r\n\r\n<p>Biopython官网(<a href=\"http://www.biopython.org/\">http://www.biopython.org</a>)为使用和研究生物信息学的开发者提供了一个在线的 资源库，包括模块、脚本以及一些基于Python的软件的网站链接。一般来讲，Biopython致力于通过创造高质量的和可重复利用的模块及 类，从而使得Python在生物信息学中的应用变得更加容易。Biopython的特点包括解析各种生物信息学格式的文件(BLAST， Clustalw， FASTA， Genbank...)，访问在线的服务器(NCBI，Expasy...)，常见和不那么常见程序的接口(Clustalw， DSSP，MSMS...)，标准的序列类，各 种收集的模块，KD树数据结构等等，还有一些文档。</p>\r\n\r\n<p>基本来说，我们喜欢使用Python来编程，并且希望通过创建高质量、可复用的模块和脚本来使得Python在生物信息学中的应用变得容易。</p>\r\n\r\n<p> </p>\r\n\r\n<p>请先发邮件联系</p>\r\n\r\n<p>李西明</p>\r\n\r\n<p>liximing_cn@163.com</p>', '1', '246', null, null, '2017-05-01 00:00:00', '0', '1', '2016-10-18 17:35:46', '2016-10-18 17:37:31');
INSERT INTO `thesis` VALUES ('643', '1', '3', '文本预处理系统', '应用软件开发', '生产实践', '应用研究', '<p>研发适合第三方软件调用的文本预处理功能的api，具有网络词汇替换、文本错误发现和纠错的功能。</p>', '1', '262', '511', null, '2017-04-23 00:00:00', '0', '1', '2016-10-18 17:57:34', '2016-10-18 17:57:34');
INSERT INTO `thesis` VALUES ('644', '1', '3', '基于统计学习方法的短文本分类', '人工智能', '科研项目', '应用研究', '<p>面向旅游景点的用户评论，采用统计学习放法进行评论分类。</p>', '1', '262', '488', null, '2017-04-23 00:00:00', '0', '1', '2016-10-18 19:20:50', '2016-10-18 19:20:50');
INSERT INTO `thesis` VALUES ('645', '1', '3', '综合实验辅助管理系统', '应用软件开发', '科研项目', '基础研究', '', '1', '269', '687', null, '2017-04-10 00:00:00', '0', '1', '2016-10-18 19:43:55', '2016-10-18 19:43:55');
INSERT INTO `thesis` VALUES ('646', '1', '3', '基于WEB的教学辅助系统', '应用软件开发', '科研项目', '基础研究', '', '1', '269', '688', null, '2017-04-10 00:00:00', '0', '1', '2016-10-18 19:45:03', '2016-10-18 19:45:03');
INSERT INTO `thesis` VALUES ('647', '1', '3', '基于web的科研论文投稿系统', '应用软件开发', '科研项目', '基础研究', '', '1', '269', '705', null, '2017-04-10 00:00:00', '0', '1', '2016-10-18 19:46:11', '2016-10-18 19:46:11');
INSERT INTO `thesis` VALUES ('648', '1', '3', '基于改进的PageRank算法的博客管理与推荐系统', '应用软件开发', '科研项目', '基础研究', '', '1', '269', '755', null, '2017-04-10 00:00:00', '0', '1', '2016-10-18 19:47:28', '2016-10-18 19:47:28');
INSERT INTO `thesis` VALUES ('649', '1', '3', '社区金融服务平台中恵家金融子系统的实现', '应用软件开发', '科研项目', '基础研究', '', '1', '269', '762', null, '2017-04-10 00:00:00', '0', '1', '2016-10-18 19:48:08', '2016-10-18 19:48:08');
INSERT INTO `thesis` VALUES ('650', '1', '3', '篮球裁判员社区应用的Android实现', '应用软件开发', '科研项目', '基础研究', '', '1', '269', '764', null, '2017-04-10 00:00:00', '0', '1', '2016-10-18 19:48:54', '2016-10-18 19:48:54');
INSERT INTO `thesis` VALUES ('651', '1', '3', '学生信息管理系统', '应用软件开发', '科研项目', '基础研究', '', '1', '269', '798', null, '2017-04-10 00:00:00', '0', '1', '2016-10-18 19:49:48', '2016-10-18 19:49:48');
INSERT INTO `thesis` VALUES ('652', '1', '3', '体育门户网站', '应用软件开发', '科研项目', '基础研究', '', '1', '269', '799', null, '2017-04-10 00:00:00', '0', '1', '2016-10-18 19:50:37', '2016-10-18 19:50:37');
INSERT INTO `thesis` VALUES ('653', '1', '3', '基于分布式营销业的数据分析与挖掘', '应用软件开发', '科研项目', '基础研究', '', '1', '269', '800', null, '2017-04-10 00:00:00', '0', '1', '2016-10-18 19:51:54', '2016-10-18 19:51:54');
INSERT INTO `thesis` VALUES ('654', '1', '3', '基于Shiro的游客流量监测系统中系统管理子系统的实现', '应用软件开发', '生产实践', '应用研究', '<p>设计并实现一个Shiro的游客流量监测系统中系统管理子系统</p>', '1', '251', '759', null, '2017-04-10 00:00:00', '0', '1', '2016-10-18 19:53:16', '2016-10-18 20:26:53');
INSERT INTO `thesis` VALUES ('655', '1', '3', '基于jfreechart设计迎新管理系统的统计开发', '应用软件开发', '生产实践', '应用研究', '<p>设计并实现一个jfreechart设计迎新管理系统。</p>', '1', '251', '760', null, '2017-04-10 00:00:00', '0', '1', '2016-10-18 19:54:14', '2016-10-18 20:27:19');
INSERT INTO `thesis` VALUES ('656', '1', '3', '基于nodejs和mongodb的写作阅读平台写作阅读管理的实现', '应用软件开发', '生产实践', '应用研究', '<p>设计并实现一个nodejs和mongodb的写作阅读平台。</p>', '1', '251', '761', null, '2017-04-10 00:00:00', '0', '1', '2016-10-18 19:55:22', '2016-10-18 20:27:35');
INSERT INTO `thesis` VALUES ('657', '1', '3', '基于SSH的在线测试系统的实现', '应用软件开发', '生产实践', '应用研究', '<p>设计并实现一个SSH的在线测试系统。</p>', '1', '251', '795', null, '2017-04-10 00:00:00', '0', '1', '2016-10-18 19:56:13', '2016-10-18 20:27:54');
INSERT INTO `thesis` VALUES ('658', '1', '3', '基于node.js+mongodb的推荐新闻管理子系统的开发', '应用软件开发', '生产实践', '应用研究', '<p>设计并实现一个node.js+mongodb的推荐新闻管理子系统。</p>', '1', '251', '796', null, '2017-04-10 00:00:00', '0', '1', '2016-10-18 19:56:57', '2016-10-18 20:28:10');
INSERT INTO `thesis` VALUES ('659', '1', '3', '基于Linux的即时通讯软件设计与实现', '应用软件开发', '生产实践', '应用研究', '<p>设计并实现一个Linux的即时通讯软件。</p>', '1', '251', '797', null, '2017-04-10 00:00:00', '0', '1', '2016-10-18 19:57:48', '2016-10-18 20:28:26');
INSERT INTO `thesis` VALUES ('660', '1', '3', '基于AngularJS实现的任务交易平台', '应用软件开发', '生产实践', '应用研究', '<p>设计并实现一个AngularJS实现的任务交易平台</p>', '1', '251', '829', null, '2017-04-10 00:00:00', '0', '1', '2016-10-18 19:58:34', '2016-10-18 20:28:40');
INSERT INTO `thesis` VALUES ('661', '1', '3', '个人二手物品交易市场', '应用软件开发', '生产实践', '应用研究', '<p>设计并实现一个个人二手物品交易市场。</p>', '1', '251', '830', null, '2017-04-10 00:00:00', '0', '1', '2016-10-18 19:59:26', '2016-10-18 20:28:53');
INSERT INTO `thesis` VALUES ('662', '1', '3', '基于商业智能的汽车企业客户关系分析', '应用软件开发', '生产实践', '应用研究', '<p>探索基于商业智能的汽车企业客户关系分析。</p>', '1', '251', '831', null, '2017-04-10 00:00:00', '0', '1', '2016-10-18 20:00:06', '2016-10-18 20:29:05');
INSERT INTO `thesis` VALUES ('663', '1', '3', '淘宝店铺YideSimple—安卓端定制APP', '应用软件开发', '生产实践', '应用研究', '<p>设计并实现淘宝店铺YideSimple—安卓端定制APP。</p>', '1', '251', '859', null, '2017-04-10 00:00:00', '0', '1', '2016-10-18 20:00:51', '2016-10-18 20:29:18');
INSERT INTO `thesis` VALUES ('664', '1', '3', '个人财务管理系统', '应用软件开发', '科研项目', '基础研究', '', '1', '269', '801', null, '2017-04-10 00:00:00', '0', '1', '2016-10-18 20:01:22', '2016-10-18 20:01:22');
INSERT INTO `thesis` VALUES ('665', '1', '3', '基于Selenium2的Web自动化测试框架', '应用软件开发', '生产实践', '应用研究', '<p>设计并实现Selenium2的Web自动化测试框架。</p>', '1', '251', '860', null, '2017-04-10 00:00:00', '0', '1', '2016-10-18 20:01:32', '2016-10-18 20:29:31');
INSERT INTO `thesis` VALUES ('666', '1', '3', '药库进出明细管理系统', '应用软件开发', '生产实践', '应用研究', '<p>设计并实现一个药库进出明细管理系统。</p>', '1', '251', '861', null, '2017-04-10 00:00:00', '0', '1', '2016-10-18 20:02:10', '2016-10-18 20:29:45');
INSERT INTO `thesis` VALUES ('667', '1', '3', '软计算方法在股市预测中的应用', '应用软件开发', '科研项目', '基础研究', '', '1', '269', '857', null, '2017-04-10 00:00:00', '0', '1', '2016-10-18 20:02:14', '2016-10-18 20:02:14');
INSERT INTO `thesis` VALUES ('668', '1', '3', '校园BBS论坛', '应用软件开发', '生产实践', '应用研究', '<p>  </p>', '1', '256', '808', null, '2017-04-10 00:00:00', '0', '1', '2016-10-18 20:04:07', '2016-10-18 20:27:48');
INSERT INTO `thesis` VALUES ('669', '1', '3', '企业级财务系统', '应用软件开发', '生产实践', '应用研究', '', '1', '256', '809', null, '2017-04-10 00:00:00', '0', '1', '2016-10-18 20:05:19', '2016-10-18 20:27:10');
INSERT INTO `thesis` VALUES ('670', '1', '3', '基于数据挖掘的耕地质量评价系统', '应用软件开发', '科研项目', '基础研究', '<p>耕地质量评价是当前耕地管理的一个重要问题。本题目拟构建一个耕地质量评价系统，通过土地数据的收集、整理、存储，搭建后台框架；前端提供土地评价的智能模块，基于数据挖掘算法，对上传的土地数据进行等级分类，要求具有良好的人机交互，能够给出决策建议。</p>', '1', '269', '403', null, '2017-04-20 00:00:00', '0', '1', '2016-10-18 20:06:06', '2016-10-18 20:06:06');
INSERT INTO `thesis` VALUES ('671', '1', '3', '在线考试平台', '应用软件开发', '生产实践', '应用研究', '', '1', '256', '811', null, '2017-04-10 00:00:00', '0', '1', '2016-10-18 20:07:21', '2016-10-18 20:26:47');
INSERT INTO `thesis` VALUES ('672', '1', '3', '基于深度学习的动物识别系统', '应用软件开发', '科研项目', '基础研究', '', '1', '256', '825', null, '2017-04-10 00:00:00', '0', '1', '2016-10-18 20:09:10', '2016-10-18 20:26:22');
INSERT INTO `thesis` VALUES ('673', '1', '3', '花卉销售系统', '应用软件开发', '生产实践', '应用研究', '', '1', '256', '834', null, '2017-04-10 00:00:00', '0', '1', '2016-10-18 20:10:44', '2016-10-18 20:25:41');
INSERT INTO `thesis` VALUES ('674', '1', '3', '二维码生成与识别系统', '应用软件开发', '生产实践', '应用研究', '', '1', '256', '835', null, '2017-04-10 00:00:00', '0', '1', '2016-10-18 20:11:56', '2016-10-18 20:25:09');
INSERT INTO `thesis` VALUES ('675', '1', '3', '车辆违章举报系统', '应用软件开发', '生产实践', '应用研究', '', '1', '256', '836', null, '2017-04-10 00:00:00', '0', '1', '2016-10-18 20:13:02', '2016-10-18 20:24:16');
INSERT INTO `thesis` VALUES ('676', '1', '3', '水产品质量溯源管理系统', '应用软件开发', '生产实践', '应用研究', '', '1', '256', '837', null, '2017-04-10 00:00:00', '0', '1', '2016-10-18 20:14:37', '2016-10-18 20:23:32');
INSERT INTO `thesis` VALUES ('677', '1', '3', '华农生活助手app', '应用软件开发', '生产实践', '应用研究', '', '1', '256', '853', null, '2017-04-10 00:00:00', '0', '1', '2016-10-18 20:15:41', '2016-10-18 20:22:53');
INSERT INTO `thesis` VALUES ('678', '1', '3', '酒店服务预订与后台管理系统', '应用软件开发', '生产实践', '应用研究', '', '1', '256', '854', null, '2017-04-10 00:00:00', '0', '1', '2016-10-18 20:16:29', '2016-10-18 20:22:11');
INSERT INTO `thesis` VALUES ('679', '1', '3', '农业大数据采集与分析平台', '数据挖掘', '科研项目', '设计性', '<p>  设计开发一个农业大数据的采集与分析平台。</p>', '1', '207', '405', null, '2017-04-28 00:00:00', '0', '1', '2016-10-18 20:17:12', '2016-10-18 20:27:28');
INSERT INTO `thesis` VALUES ('680', '1', '3', '企业招聘官网', '应用软件开发', '生产实践', '应用研究', '', '1', '256', '855', null, '2017-04-10 00:00:00', '0', '1', '2016-10-18 20:17:38', '2016-10-18 20:20:27');
INSERT INTO `thesis` VALUES ('681', '1', '3', 'React在UI组件开发上的应用', '应用软件开发', '生产实践', '应用研究', '<p>无</p>', '1', '227', '779', null, '2017-04-10 00:00:00', '0', '1', '2016-10-18 20:17:48', '2016-10-18 20:17:48');
INSERT INTO `thesis` VALUES ('682', '1', '3', '基于SSM、SHIRO、MEMCHACH等的视频网站', '应用软件开发', '生产实践', '应用研究', '', '1', '256', '858', null, '2017-04-10 00:00:00', '0', '1', '2016-10-18 20:18:40', '2016-10-18 21:30:05');
INSERT INTO `thesis` VALUES ('683', '1', '3', '物流信息系统项目实施过程及质量管理子系统的实现', '应用软件开发', '生产实践', '应用研究', '<p>无</p>', '1', '227', '780', null, '2017-04-10 00:00:00', '0', '1', '2016-10-18 20:21:02', '2016-10-18 20:21:02');
INSERT INTO `thesis` VALUES ('684', '1', '3', '基于SpringMVC和Hibernate酒文化社交子系统开发', '应用软件开发', '生产实践', '应用研究', '<p>无</p>', '1', '227', '781', null, '2017-04-10 00:00:00', '0', '1', '2016-10-18 20:24:57', '2016-10-18 20:24:57');
INSERT INTO `thesis` VALUES ('685', '1', '3', '酒店信息管理系统', '应用软件开发', '生产实践', '应用研究', '<p>无</p>', '1', '227', '805', null, '2017-04-10 00:00:00', '0', '1', '2016-10-18 20:26:22', '2016-10-18 20:26:22');
INSERT INTO `thesis` VALUES ('686', '1', '3', '视频图像中的运动目标跟踪算法研究与设计', '数字图像处理', '科研项目', '基础研究', '<p>基于现场视频的目标跟踪算法研究与设计，详情要求请联系电话13794412658/682658,邮箱314304334@qq.com</p>', '1', '207', null, null, '2017-04-28 00:00:00', '0', '1', '2016-10-18 20:26:23', '2016-10-18 20:26:23');
INSERT INTO `thesis` VALUES ('687', '1', '3', '团购网站系统', '应用软件开发', '生产实践', '应用研究', '<p>无&nbsp;</p>', '1', '227', '807', null, '2017-04-10 00:00:00', '0', '1', '2016-10-18 20:27:32', '2016-10-18 20:27:32');
INSERT INTO `thesis` VALUES ('688', '1', '3', '背包客交流网站', '应用软件开发', '生产实践', '应用研究', '<p>无</p>', '1', '227', '842', null, '2017-04-10 00:00:00', '0', '1', '2016-10-18 20:28:54', '2016-10-18 20:28:54');
INSERT INTO `thesis` VALUES ('689', '1', '3', '算法知识大全', '应用软件开发', '生产实践', '应用研究', '<p>无</p>', '1', '227', '843', null, '2017-04-10 00:00:00', '0', '1', '2016-10-18 20:29:49', '2016-10-18 20:29:49');
INSERT INTO `thesis` VALUES ('690', '1', '3', '大学生校园活动助手APP', '应用软件开发', '生产实践', '应用研究', '<p>无&nbsp;</p>', '1', '227', '844', null, '2017-04-10 00:00:00', '0', '1', '2016-10-18 20:30:37', '2016-10-18 20:30:37');
INSERT INTO `thesis` VALUES ('691', '1', '3', '精准扶贫信息化平台中帮扶成效评价与大数据分析子系统的开发', '应用软件开发', '生产实践', '应用研究', '', '1', '250', '729', null, '2017-04-09 00:00:00', '0', '1', '2016-10-18 20:31:10', '2016-10-18 20:31:10');
INSERT INTO `thesis` VALUES ('692', '1', '3', '基于Android平台的社会服务管理系统APP应用设计', '应用软件开发', '科研项目', '设计性', '<p>  详情请联系电话13794412658/682658，314304334@qq.com</p>', '1', '207', '443', null, '2017-04-28 00:00:00', '0', '1', '2016-10-18 20:31:41', '2016-10-18 21:09:01');
INSERT INTO `thesis` VALUES ('693', '1', '3', '基于SpringMVC和Mybatis的川报信息管理系统设计与实现', '应用软件开发', '科研项目', '基础研究', '', '1', '250', '730', null, '2017-04-09 00:00:00', '0', '1', '2016-10-18 20:31:59', '2016-10-18 20:31:59');
INSERT INTO `thesis` VALUES ('694', '1', '3', '基于企业账簿报表分析', '应用软件开发', '生产实践', '应用研究', '<p>无</p>', '1', '227', '845', null, '2017-04-10 00:00:00', '0', '1', '2016-10-18 20:32:07', '2016-10-18 20:32:07');
INSERT INTO `thesis` VALUES ('695', '1', '3', '基于SSM的实习实训系统的设计与实现', '应用软件开发', '生产实践', '应用研究', '<p>无&nbsp;</p>', '1', '227', '728', null, '2017-04-10 00:00:00', '0', '1', '2016-10-18 20:33:01', '2016-10-18 20:33:01');
INSERT INTO `thesis` VALUES ('696', '1', '3', '基于Spring MVC恵家E站中惠家新闻子系统的实现', '应用软件开发', '科研项目', '基础研究', '', '1', '250', '731', null, '2017-04-09 00:00:00', '0', '1', '2016-10-18 20:33:01', '2016-10-18 20:33:01');
INSERT INTO `thesis` VALUES ('697', '1', '3', '基于大数据的学生上网行为分析', '应用软件开发', '教学改革项目', '应用研究', '<p>目前已积累上网数据约1千万条，使用上网数据对学生行为进行定义和分析，以期得到较好的分析结果。对分析结果进行展示，编写一个应用系统；辅助一般用户进行学生行为定义与分析、对分析结果进行展示。</p>\r\n\r\n<p>要求：（1）愿意学习大数据管理概念、知识、软件使用</p>\r\n\r\n<p>（2）需要进行应用系统设计与实现</p>', '1', '261', null, null, '2017-04-30 00:00:00', '0', '1', '2016-10-18 20:33:18', '2016-10-18 20:33:18');
INSERT INTO `thesis` VALUES ('698', '1', '3', '基于Android平台的个人绩效APP应用设计', '应用软件开发', '科研项目', '设计性', '<p>详情要求请联系电话13794412658/682658,邮箱314304334@qq.com</p>', '1', '207', '592', null, '2017-04-28 00:00:00', '0', '1', '2016-10-18 20:33:25', '2016-10-18 21:11:19');
INSERT INTO `thesis` VALUES ('699', '1', '3', '基于SSM的推荐新闻管理子系统的开发', '应用软件开发', '科研项目', '基础研究', '', '1', '250', '733', null, '2017-04-09 00:00:00', '0', '1', '2016-10-18 20:33:56', '2016-10-18 20:33:56');
INSERT INTO `thesis` VALUES ('700', '1', '3', '基于struts2的迎新系统中财务与现场迎新管理子系统的开发', '应用软件开发', '生产实践', '应用研究', '<p>无 &nbsp;</p>', '1', '227', '740', null, '2017-04-10 00:00:00', '0', '1', '2016-10-18 20:33:58', '2016-10-18 20:33:58');
INSERT INTO `thesis` VALUES ('701', '1', '3', '基于Mybatis的迎新系统中教务与学生个人信息管理子系统的开发', '应用软件开发', '科研项目', '基础研究', '', '1', '250', '734', null, '2017-04-09 00:00:00', '0', '1', '2016-10-18 20:34:39', '2016-10-18 20:34:39');
INSERT INTO `thesis` VALUES ('702', '1', '3', '精准扶贫信息化平台中精确帮扶、精确管理子系统的实现', '应用软件开发', '科研项目', '基础研究', '', '1', '250', '736', null, '2017-04-09 00:00:00', '0', '1', '2016-10-18 20:35:26', '2016-10-18 20:35:26');
INSERT INTO `thesis` VALUES ('703', '1', '3', '基于SpringMVC的在线培训系统的设计与实现', '应用软件开发', '科研项目', '基础研究', '', '1', '250', '748', null, '2017-04-09 00:00:00', '0', '1', '2016-10-18 20:36:12', '2016-10-18 20:36:12');
INSERT INTO `thesis` VALUES ('704', '1', '3', '基于Intern框架的单元和功能测试', '应用软件开发', '科研项目', '基础研究', '', '1', '250', '749', null, '2017-04-09 00:00:00', '0', '1', '2016-10-18 20:37:08', '2016-10-18 20:37:08');
INSERT INTO `thesis` VALUES ('705', '1', '3', '基于Python的博客等网络资讯平台的爬虫实现', '应用软件开发', '科研项目', '基础研究', '', '1', '250', '750', null, '2017-04-09 00:00:00', '0', '1', '2016-10-18 20:37:53', '2016-10-18 20:37:53');
INSERT INTO `thesis` VALUES ('706', '1', '3', '基于SpringMVC林业电子政务平台内容发布子系统开发', '应用软件开发', '生产实践', '应用研究', '<p>详见任务书</p>', '1', '239', '722', null, '2017-05-04 00:00:00', '0', '1', '2016-10-18 20:38:35', '2016-10-18 20:59:27');
INSERT INTO `thesis` VALUES ('707', '1', '3', '交互式行程规划的约束评价', '人工智能', '科研项目', '应用研究', '<p>针对交互式行程规划中的各潜在约束进行评价，实现解空间复杂度的有效降低。</p>', '1', '205', '436', null, '2017-04-23 00:00:00', '0', '1', '2016-10-18 20:38:37', '2016-10-18 20:38:37');
INSERT INTO `thesis` VALUES ('708', '1', '3', '基于Android的校园二手市场系统', '应用软件开发', '科研项目', '基础研究', '', '1', '250', '751', null, '2017-04-09 00:00:00', '0', '1', '2016-10-18 20:38:41', '2016-10-18 20:38:41');
INSERT INTO `thesis` VALUES ('709', '1', '3', '房屋租售信息网站的设计与实现', '应用软件开发', '生产实践', '设计性', '<p>开发一个用于发布、查询房屋出租、销售信息的网站。</p>\r\n\r\n<p>具体网站功能面谈。</p>\r\n\r\n<p>开发技术不限。</p>', '1', '217', '377', null, '2017-05-20 00:00:00', '0', '1', '2016-10-18 20:39:27', '2016-10-18 22:39:11');
INSERT INTO `thesis` VALUES ('710', '1', '3', '基于Lucene的新闻推荐子系统的设计与实现', '应用软件开发', '生产实践', '应用研究', '<p>详见任务书</p>', '1', '239', '752', null, '2017-05-04 00:00:00', '0', '1', '2016-10-18 20:39:57', '2016-10-18 20:59:07');
INSERT INTO `thesis` VALUES ('711', '1', '3', '基于Struts和Hibernate的社情民意系统中单位管理子系统开发', '应用软件开发', '科研项目', '基础研究', '', '1', '250', '710', null, '2017-04-09 00:00:00', '0', '1', '2016-10-18 20:40:01', '2016-10-18 20:40:01');
INSERT INTO `thesis` VALUES ('712', '1', '3', '个人商品展示购物系统', '应用软件开发', '科研项目', '基础研究', '', '1', '250', '812', null, '2017-04-09 00:00:00', '0', '1', '2016-10-18 20:40:37', '2016-10-18 20:40:37');
INSERT INTO `thesis` VALUES ('713', '1', '3', '基于SSH的酒品在线交易系统的开发', '应用软件开发', '生产实践', '应用研究', '<p>基于SSH的酒品在线交易系统的开发</p>', '1', '257', '769', null, '2017-04-22 00:00:00', '0', '1', '2016-10-18 20:42:15', '2016-10-18 20:42:15');
INSERT INTO `thesis` VALUES ('714', '1', '3', '基于SpringMVC和Hibernate的教材管理系统的设计与实现', '应用软件开发', '生产实践', '应用研究', '<p>基于SpringMVC和Hibernate的教材管理系统的设计与实现</p>', '1', '257', '770', null, '2017-04-22 00:00:00', '0', '1', '2016-10-18 20:43:55', '2016-10-18 20:43:55');
INSERT INTO `thesis` VALUES ('715', '1', '3', 'Intro在Web应用程序中的个性化应用', '应用软件开发', '生产实践', '应用研究', '<p>Intro在Web应用程序中的个性化应用</p>', '1', '257', '784', null, '2017-04-22 00:00:00', '0', '1', '2016-10-18 20:45:46', '2016-10-18 20:45:46');
INSERT INTO `thesis` VALUES ('716', '1', '3', '实时日志监管系统log.io的原理及应用', '应用软件开发', '生产实践', '应用研究', '<p>实时日志监管系统log.io的原理及应用</p>', '1', '257', '785', null, '2017-04-22 00:00:00', '0', '1', '2016-10-18 20:46:53', '2016-10-18 20:46:53');
INSERT INTO `thesis` VALUES ('717', '1', '3', '基于PostCSS的在线做题系统的设计与实现', '应用软件开发', '生产实践', '应用研究', '<p>详见任务说明书</p>', '1', '239', '753', null, '2017-05-04 00:00:00', '0', '1', '2016-10-18 20:47:33', '2016-10-18 20:57:12');
INSERT INTO `thesis` VALUES ('718', '1', '3', 'Android手机音乐播放器', '应用软件开发', '生产实践', '应用研究', '<p>Android手机音乐播放器</p>', '1', '257', '787', null, '2017-04-22 00:00:00', '0', '1', '2016-10-18 20:47:42', '2016-10-18 20:48:15');
INSERT INTO `thesis` VALUES ('719', '1', '3', '基于SSH的社会服务平台的服务订购系统的设计与实现', '应用软件开发', '生产实践', '应用研究', '<p>详看任务说明书</p>', '1', '239', '754', null, '2017-05-04 00:00:00', '0', '1', '2016-10-18 20:49:12', '2016-10-18 20:58:43');
INSERT INTO `thesis` VALUES ('720', '1', '3', '家庭理财系统', '应用软件开发', '生产实践', '应用研究', '<p>家庭理财系统</p>', '1', '257', '802', null, '2017-04-22 00:00:00', '0', '1', '2016-10-18 20:49:22', '2016-10-18 20:50:27');
INSERT INTO `thesis` VALUES ('721', '1', '3', '基于Nodejs的外卖订餐管理平台的设计与实现', '应用软件开发', '生产实践', '应用研究', '<p>详看任务书</p>', '1', '239', '756', null, '2017-05-04 00:00:00', '0', '1', '2016-10-18 20:49:57', '2016-10-18 20:58:15');
INSERT INTO `thesis` VALUES ('722', '1', '3', '门急诊医生工作站子系统', '应用软件开发', '生产实践', '应用研究', '<p>门急诊医生工作站子系统</p>', '1', '257', '803', null, '2017-04-22 00:00:00', '0', '1', '2016-10-18 20:50:10', '2016-10-18 20:50:10');
INSERT INTO `thesis` VALUES ('723', '1', '3', '物资管理系统', '应用软件开发', '生产实践', '应用研究', '<p>开发一个物资管理系统。</p>', '1', '222', '672', null, '2017-04-10 00:00:00', '0', '1', '2016-10-18 20:51:05', '2016-10-18 21:33:51');
INSERT INTO `thesis` VALUES ('724', '1', '3', '基于二维码的物料展示系统', '应用软件开发', '生产实践', '应用研究', '<p>基于二维码的物料展示系统</p>', '1', '257', '804', null, '2017-04-22 00:00:00', '0', '1', '2016-10-18 20:51:30', '2016-10-18 20:51:30');
INSERT INTO `thesis` VALUES ('725', '1', '3', 'SQL语言在线测试网站的设计与开发', '应用软件开发', '生产实践', '应用研究', '<p>目的：设计一个SQL语言在线测试的网站，以供学习者练习或测验</p>\r\n\r\n<p>功能：1. 管理员出题（建立数据库、设计题目、给出对应的正确输出结果）</p>\r\n\r\n<p>&nbsp; &nbsp; 2. 测试者做题（查看题目、提交SQL代码、查看运行正确与否）</p>', '1', '270', '658', null, '2017-05-01 00:00:00', '0', '1', '2016-10-18 20:52:17', '2016-10-18 20:52:17');
INSERT INTO `thesis` VALUES ('726', '1', '3', '汽车订票网站', '应用软件开发', '生产实践', '应用研究', '<p>设计开发一个汽车订票网站。</p>', '1', '222', '702', null, '2017-04-10 00:00:00', '0', '1', '2016-10-18 20:52:21', '2016-10-18 21:34:17');
INSERT INTO `thesis` VALUES ('727', '1', '3', '论坛用户行为分析系统', '应用软件开发', '生产实践', '应用研究', '<p>论坛用户行为分析系统</p>', '1', '257', '846', null, '2017-04-22 00:00:00', '0', '1', '2016-10-18 20:52:30', '2016-10-18 20:52:30');
INSERT INTO `thesis` VALUES ('728', '1', '3', '传统长博客管理系统', '应用软件开发', '生产实践', '应用研究', '<p>设计并开发一个博客系统。</p>', '1', '222', '692', null, '2017-04-10 00:00:00', '0', '1', '2016-10-18 20:53:26', '2016-10-18 21:34:53');
INSERT INTO `thesis` VALUES ('729', '1', '3', '基于SpringMVC+Spring+Mybatis租房信息网站', '应用软件开发', '生产实践', '应用研究', '<p>基于SpringMVC+Spring+Mybatis租房信息网站</p>', '1', '257', '847', null, '2017-04-22 00:00:00', '0', '1', '2016-10-18 20:53:42', '2016-10-18 20:53:42');
INSERT INTO `thesis` VALUES ('730', '1', '3', '大规模图数据的典型算法分析', '大数据', '其他', '基础研究', '<p>图是典型的数据结构，在实际应用有很广泛的应用背景，最典型的算法包括节点之间的最短路径，节点度分布计算等。</p>\r\n\r\n<p>本题目要求将图的典型算法扩展到分布式环境下，要求再Hadoop环境下实现大规模图数据的最短路径、网络直径、节点度分布、节点度序列、聚类算法等。</p>\r\n\r\n<p>http://snap.stanford.edu/data/index.html</p>', '1', '242', '337', null, '2017-05-10 00:00:00', '0', '1', '2016-10-18 20:53:52', '2016-10-18 20:53:52');
INSERT INTO `thesis` VALUES ('731', '1', '3', '学生成绩管理系统', '应用软件开发', '生产实践', '应用研究', '<p>学生成绩管理系统</p>', '1', '257', '848', null, '2017-04-22 00:00:00', '0', '1', '2016-10-18 20:54:26', '2016-10-18 20:54:26');
INSERT INTO `thesis` VALUES ('732', '1', '3', '图书借阅系统', '应用软件开发', '生产实践', '应用研究', '<p>开发一个图书借阅系统。</p>', '1', '222', '693', null, '2017-04-10 00:00:00', '0', '1', '2016-10-18 20:54:41', '2016-10-18 21:37:00');
INSERT INTO `thesis` VALUES ('733', '1', '3', '基于UNITY3D的游戏', '应用软件开发', '生产实践', '应用研究', '<p>基于UNITY3D的游戏</p>', '1', '257', '856', null, '2017-04-22 00:00:00', '0', '1', '2016-10-18 20:55:38', '2016-10-18 20:55:38');
INSERT INTO `thesis` VALUES ('734', '1', '3', '商场营销管理系统', '应用软件开发', '生产实践', '应用研究', '<p>设计并开发一个商场营销管理系统。</p>', '1', '222', '694', null, '2017-04-10 00:00:00', '0', '1', '2016-10-18 20:56:04', '2016-10-18 21:38:16');
INSERT INTO `thesis` VALUES ('735', '1', '3', '基于泛二次元的兴趣爱好分享的轻博客', '应用软件开发', '其他', '应用研究', '<p>开发一个基于泛二次元的兴趣爱好分享的轻博客系统。</p>', '1', '222', '695', null, '2017-04-10 00:00:00', '0', '1', '2016-10-18 20:57:24', '2016-10-18 21:39:42');
INSERT INTO `thesis` VALUES ('736', '1', '3', '在线学习平台的应用实践', '应用软件开发', '生产实践', '应用研究', '', '1', '222', '706', null, '2017-04-10 00:00:00', '0', '1', '2016-10-18 20:58:14', '2016-10-18 21:40:20');
INSERT INTO `thesis` VALUES ('737', '1', '3', '基于Ember的MVC 模式在Web客户端上的应用', '应用软件开发', '其他', '应用研究', '', '1', '222', '707', null, '2017-04-10 00:00:00', '0', '1', '2016-10-18 20:58:56', '2016-10-18 21:41:02');
INSERT INTO `thesis` VALUES ('739', '1', '3', '基于SpringMVC与Mybatis酒品金融投资设和社交子系统应用', '应用软件开发', '生产实践', '应用研究', '', '1', '222', '708', null, '2017-04-10 00:00:00', '0', '1', '2016-10-18 21:00:45', '2016-10-18 21:41:37');
INSERT INTO `thesis` VALUES ('740', '1', '3', '基于AJAX的企业图书文档管理子系统的实现', '应用软件开发', '生产实践', '应用研究', '', '1', '222', '709', null, '2017-04-10 00:00:00', '0', '1', '2016-10-18 21:01:58', '2016-10-18 21:42:05');
INSERT INTO `thesis` VALUES ('741', '1', '3', '基于移动端的PAD门店导购系统的实现', '应用软件开发', '生产实践', '应用研究', '<p>详见任务说明书</p>', '1', '239', '757', null, '2017-05-04 00:00:00', '0', '1', '2016-10-18 21:06:44', '2016-10-18 21:06:44');
INSERT INTO `thesis` VALUES ('742', '1', '3', '校园出租屋管理系统', '应用软件开发', '生产实践', '应用研究', '<p>1、选题学生最好不要有清考科目，能独立完成程序和论文；</p>\r\n\r\n<p>2、开发环境和工具不限；</p>', '1', '211', '576', null, '2017-04-19 00:00:00', '0', '1', '2016-10-18 21:07:22', '2016-10-19 13:05:23');
INSERT INTO `thesis` VALUES ('743', '1', '3', '基于android系统的程序在线学习app', '应用软件开发', '生产实践', '应用研究', '<p>详见任务说明书</p>', '1', '239', '685', null, '2017-05-04 00:00:00', '0', '1', '2016-10-18 21:07:54', '2016-10-19 16:43:41');
INSERT INTO `thesis` VALUES ('744', '1', '3', '通用WEB调查表的自动生成', '应用软件开发', '生产实践', '应用研究', '<p>1、选题学生最好不要有清考科目，能独立完成程序和论文；</p>\r\n\r\n<p>2、开发环境和工具不限；</p>', '1', '211', '304', null, '2017-04-19 00:00:00', '0', '1', '2016-10-18 21:08:36', '2016-10-19 13:03:39');
INSERT INTO `thesis` VALUES ('745', '1', '3', '编辑部管理系统', '应用软件开发', '生产实践', '应用研究', '<p>1、选题学生最好不要有清考科目，能独立完成程序和论文；</p>\r\n\r\n<p>2、开发环境和工具不限；</p>', '1', '211', '363', null, '2017-04-19 00:00:00', '0', '1', '2016-10-18 21:09:22', '2016-10-19 17:02:28');
INSERT INTO `thesis` VALUES ('746', '1', '3', '旅游线路管理系统', '应用软件开发', '生产实践', '应用研究', '<p>1、选题学生最好不要有清考科目，能独立完成程序和论文；</p>\r\n\r\n<p>2、开发环境和工具不限；</p>', '1', '211', '441', null, '2017-04-19 00:00:00', '0', '1', '2016-10-18 21:09:59', '2016-10-19 15:56:49');
INSERT INTO `thesis` VALUES ('747', '1', '3', '基于Iphone平台的社会服务管理系统APP应用设计', '应用软件开发', '科研项目', '设计性', '<p>详情请联系13794412658/682658，314304334@qq.com</p>', '1', '207', null, null, '2017-04-28 00:00:00', '0', '1', '2016-10-18 21:10:29', '2016-10-18 21:10:29');
INSERT INTO `thesis` VALUES ('748', '1', '3', '网站用户行为分析', '应用软件开发', '生产实践', '应用研究', '<p>1、选题学生最好不要有清考科目，能独立完成程序和论文；</p>\r\n\r\n<p>2、开发环境和工具不限；</p>', '1', '211', '579', null, '2017-04-19 00:00:00', '0', '1', '2016-10-18 21:10:32', '2016-10-19 16:23:31');
INSERT INTO `thesis` VALUES ('750', '1', '3', '通用个人网站生成系统', '应用软件开发', '科研项目', '基础研究', '<p>1、选题学生最好不要有清考科目，能独立完成程序和论文；</p>\r\n\r\n<p>2、开发环境和工具不限；</p>', '1', '211', '298', null, '2017-04-19 00:00:00', '0', '1', '2016-10-18 21:11:45', '2016-10-19 13:04:26');
INSERT INTO `thesis` VALUES ('751', '1', '3', '基于Spring＋SpringMVC＋Mybatis的影评网站', '应用软件开发', '生产实践', '应用研究', '<p>基于Spring＋SpringMVC＋Mybatis的影评网站</p>', '1', '275', '816', null, '2017-04-10 00:00:00', '0', '1', '2016-10-18 21:11:58', '2016-10-18 21:22:03');
INSERT INTO `thesis` VALUES ('753', '1', '3', '基于Andriod手机的校园导航系统的设计与实现', '应用软件开发', '生产实践', '应用研究', '<p>详见任务书</p>', '1', '239', '763', null, '2017-05-04 00:00:00', '0', '1', '2016-10-18 21:12:18', '2016-10-18 21:12:18');
INSERT INTO `thesis` VALUES ('754', '1', '3', '建设用地数据收集与存储', '应用软件开发', '科研项目', '基础研究', '<p>利用爬虫对广州市建设用地相关资料进行收集，按政策法规、技术标准、项目资料等主题组织数据存储，使用hdfs和hbase对数据进行存储，设计存储方案，方便数据存储更新、提高数据查询效率。</p>\r\n\r\n<p>要求获取数据达到TB级</p>\r\n\r\n<p>已有条件：1.&nbsp;使用scrpy框架进行爬虫配置，有同学进行过类似工作。</p>\r\n\r\n<p>2. 提供数据爬取网站及数据详细要求</p>\r\n\r\n<p>3. 已配置Hbase服务器、mapreduce工作环境</p>\r\n\r\n<p>要求：1. 从网上爬取数据比较枯燥</p>\r\n\r\n<p>2. 愿意自学数据仓库、大数据相关知识及软件用法&nbsp;</p>', '1', '261', null, null, '2017-04-30 00:00:00', '0', '1', '2016-10-18 21:12:49', '2016-10-18 21:12:49');
INSERT INTO `thesis` VALUES ('755', '1', '3', '基于Hibernate的物流信息系统的设计与实现', '应用软件开发', '生产实践', '应用研究', '<p>详见任务说明书</p>', '1', '239', '765', null, '2017-05-04 00:00:00', '0', '1', '2016-10-18 21:13:19', '2016-10-18 21:13:19');
INSERT INTO `thesis` VALUES ('756', '1', '3', '农技通应用APP设计', '应用软件开发', '科研项目', '设计性', '<p>详情要求请联系电话13794412658/682658,邮箱314304334@qq.com</p>', '1', '207', '431', null, '2017-04-28 00:00:00', '0', '1', '2016-10-18 21:13:35', '2016-10-18 21:13:35');
INSERT INTO `thesis` VALUES ('757', '1', '3', '基于Node.js的移动端校园社交系统', '应用软件开发', '生产实践', '应用研究', '<p>基于Node.js的移动端校园社交系统</p>', '1', '275', '817', null, '2017-04-10 00:00:00', '0', '1', '2016-10-18 21:14:17', '2016-10-18 21:22:26');
INSERT INTO `thesis` VALUES ('758', '1', '3', '作业提交和批改系统', '应用软件开发', '生产实践', '应用研究', '<p>1、选题学生最好不要有清考科目，能独立完成程序和论文；</p>\r\n\r\n<p>2、开发环境和工具不限；</p>', '1', '211', '651', null, '2017-04-19 00:00:00', '0', '1', '2016-10-18 21:14:23', '2016-10-19 16:23:06');
INSERT INTO `thesis` VALUES ('759', '1', '3', '基于微信公众号的微商城', '应用软件开发', '生产实践', '应用研究', '<p>基于微信公众号的微商城</p>', '1', '275', '822', null, '2017-04-10 00:00:00', '0', '1', '2016-10-18 21:15:13', '2016-10-18 21:22:15');
INSERT INTO `thesis` VALUES ('760', '1', '3', '农业大数据网络爬虫算法研究与设计', '应用软件开发', '科研项目', '基础研究', '<p>详情要求请联系电话13794412658/682658,邮箱314304334@qq.com</p>', '1', '207', null, null, '2017-04-28 00:00:00', '0', '1', '2016-10-18 21:15:46', '2016-10-18 21:15:46');
INSERT INTO `thesis` VALUES ('761', '1', '3', '社区金融服务平台的设计与实现', '应用软件开发', '生产实践', '应用研究', '<p>详见任务说明书</p>', '1', '239', '766', null, '2017-05-04 00:00:00', '0', '1', '2016-10-18 21:16:00', '2016-10-18 21:16:00');
INSERT INTO `thesis` VALUES ('762', '1', '3', '企业内部服务平台的设计与实现', '应用软件开发', '生产实践', '应用研究', '<p>详见任务说明书</p>', '1', '239', '776', null, '2017-05-04 00:00:00', '0', '1', '2016-10-18 21:17:24', '2016-10-19 16:45:32');
INSERT INTO `thesis` VALUES ('763', '1', '3', '试卷自动生成系统', '应用软件开发', '生产实践', '应用研究', '<p>1、选题学生最好不要有清考科目，能独立完成程序和论文；</p>\r\n\r\n<p>2、开发环境和工具不限；</p>', '1', '211', '649', null, '2017-04-19 00:00:00', '0', '1', '2016-10-18 21:18:02', '2016-10-18 21:28:34');
INSERT INTO `thesis` VALUES ('764', '1', '3', '基于B/S结构的创业投资运菅系统的设计与实现', '应用软件开发', '生产实践', '应用研究', '<p style=\"margin-left:56px\"><strong>本系统要求采用MVC架构及B/S结构开发（开发语言及数据库可自定）。系统分为创业者，投资人及管理人员三种角色。对于创业者与投资人，主要功能包括：注册及登录，上传及修改资料，发送消息，查看回复消息，创建编辑创意项目及项目评论与项目动态浏览等功能。对于管理人员主要功能包括：系统登录，用户组织管理，网站管理，信息管理等功能。</strong></p>', '1', '230', '582', null, '2017-04-23 00:00:00', '0', '1', '2016-10-18 21:18:59', '2016-10-18 21:18:59');
INSERT INTO `thesis` VALUES ('765', '1', '3', '基于SSH技术的在线学习APP的设计与实现', '应用软件开发', '生产实践', '应用研究', '<p>详见任务书</p>', '1', '239', '684', null, '2017-05-04 00:00:00', '0', '1', '2016-10-18 21:19:23', '2016-10-19 16:46:56');
INSERT INTO `thesis` VALUES ('766', '1', '3', '基于多传感器感知的数据管理平台设计', '应用软件开发', '科研项目', '设计性', '<p>详情要求请联系电话13794412658/682658,邮箱314304334@qq.com</p>', '1', '207', null, null, '2017-04-28 00:00:00', '0', '1', '2016-10-18 21:21:41', '2016-10-18 21:21:41');
INSERT INTO `thesis` VALUES ('767', '1', '3', '电子化作业管理APP设计', '应用软件开发', '科研项目', '设计性', '<p>详情要求请联系电话13794412658/682658,邮箱314304334@qq.com</p>', '1', '207', null, null, '2017-04-28 00:00:00', '0', '1', '2016-10-18 21:22:23', '2016-10-18 21:32:27');
INSERT INTO `thesis` VALUES ('768', '1', '3', '手机微网站发布平台', '应用软件开发', '科研项目', '设计性', '<p>详情要求请联系电话13794412658/682658,邮箱314304334@qq.com</p>', '1', '207', '598', null, '2017-04-28 00:00:00', '0', '1', '2016-10-18 21:25:03', '2016-10-18 21:25:03');
INSERT INTO `thesis` VALUES ('769', '1', '3', '大数据算法在学生行为分析中的应用', '大数据', '科研项目', '基础研究', '<p>学习大数据分类、聚类算法，对上网数据进行处理，获取学生行为模式。<br />\r\n<br />\r\n已知条件：已获取约1千万条路由器记录数据，已使用elstic search 进行存储，可进行初步数据访问。<br />\r\n要求：学习Mahout中的开源算法，对我们的数据集进行分析，形成学生行为模式。</p>', '1', '261', null, null, '2017-04-30 00:00:00', '0', '1', '2016-10-18 21:25:54', '2016-10-18 21:25:54');
INSERT INTO `thesis` VALUES ('770', '1', '3', '社区金融服务平台中恵家健康子系统的开发', '应用软件开发', '生产实践', '应用研究', '', '1', '222', '746', null, '2017-04-10 00:00:00', '0', '1', '2016-10-18 21:26:07', '2016-10-18 21:42:29');
INSERT INTO `thesis` VALUES ('771', '1', '3', '基于Unity3D的2D纵版飞行射击游戏', '应用软件开发', '其他', '应用研究', '', '1', '222', '747', null, '2017-04-10 00:00:00', '0', '1', '2016-10-18 21:27:37', '2016-10-18 21:42:54');
INSERT INTO `thesis` VALUES ('772', '1', '3', '个性化朋友圈推送APP设计', '应用软件开发', '科研项目', '设计性', '<p>详情要求请联系电话13794412658/682658,邮箱314304334@qq.com</p>', '1', '207', null, null, '2017-04-28 00:00:00', '0', '1', '2016-10-18 21:29:56', '2016-10-18 21:29:56');
INSERT INTO `thesis` VALUES ('773', '1', '3', '智能问答系统设计', '应用软件开发', '科研项目', '设计性', '<p>详情要求请联系电话13794412658/682658,邮箱314304334@qq.com</p>', '1', '207', null, null, '2017-04-28 00:00:00', '0', '1', '2016-10-18 21:34:11', '2016-10-18 21:34:11');
INSERT INTO `thesis` VALUES ('774', '1', '3', '基于微信公众号的语音问答系统', '应用软件开发', '生产实践', '应用研究', '<p>基于微信公众号的语音问答系统</p>', '1', '275', '625', null, '2017-05-20 00:00:00', '0', '1', '2016-10-18 21:37:38', '2016-10-19 19:19:31');
INSERT INTO `thesis` VALUES ('775', '1', '3', '宠物健康管家APP设计与开发', '应用软件开发', '科研项目', '应用研究', '<p>现在越来越多人选择在家里养宠物，但是由于工作忙，照料宠物的时间很少。随着移动互联网和传感器的兴起，在宠物身上佩戴具有定位功能、身体指标监控的传感器，人可以在手机端随时查看宠物的位置、宠物的健康状态，以实现对宠物的健康管理。</p>', '1', '864', null, null, '2017-03-10 00:00:00', '0', '1', '2016-10-18 21:46:50', '2016-10-18 21:46:50');
INSERT INTO `thesis` VALUES ('776', '1', '3', '基于Unity3D的VR游戏开发', '应用软件开发', '科研项目', '基础研究', '<p>基于Unity3D的VR游戏开发</p>', '1', '205', '542', null, '2017-04-15 00:00:00', '0', '1', '2016-10-18 21:48:54', '2016-10-18 21:48:54');
INSERT INTO `thesis` VALUES ('777', '1', '3', '汽车车牌识别的应用', '应用软件开发', '科研项目', '基础研究', '<p>本项目是广州卡趴网络科技有限公司&ldquo;互助停车&rdquo;研究项目，可提供实习就业机会。</p>', '1', '205', null, null, '2017-04-15 00:00:00', '0', '1', '2016-10-18 21:50:22', '2016-10-18 21:50:22');
INSERT INTO `thesis` VALUES ('778', '1', '3', '基于Android的移动终端车牌识别系统', '应用软件开发', '科研项目', '基础研究', '<p>本项目是广州卡趴网络科技有限公司&ldquo;互助停车&rdquo;项目的研究性项目，可提供实习、就业计划。</p>', '1', '205', null, null, '2017-04-15 00:00:00', '0', '1', '2016-10-18 21:51:28', '2016-10-18 21:51:28');
INSERT INTO `thesis` VALUES ('779', '1', '3', '微信公众号消息管理系统', '应用软件开发', '生产实践', '应用研究', '<p>微信公众号消息管理系统</p>', '1', '275', '591', null, '2017-05-20 00:00:00', '0', '1', '2016-10-18 21:53:39', '2016-10-19 19:20:04');
INSERT INTO `thesis` VALUES ('780', '1', '3', '电子商务交易平台', '应用软件开发', '生产实践', '应用研究', '<p>电子商务交易平台</p>', '1', '275', '815', null, '2017-04-10 00:00:00', '0', '1', '2016-10-18 21:54:43', '2016-10-18 21:54:43');
INSERT INTO `thesis` VALUES ('781', '1', '3', '饕餮津城电子订餐系统', '应用软件开发', '生产实践', '应用研究', '<p>饕餮津城电子订餐系统</p>', '1', '275', '821', null, '2017-04-10 00:00:00', '0', '1', '2016-10-18 21:55:41', '2016-10-18 21:55:41');
INSERT INTO `thesis` VALUES ('782', '1', '3', '健身房管理系统', '应用软件开发', '生产实践', '应用研究', '<p>健身房管理系统</p>', '1', '275', '839', null, '2014-04-10 00:00:00', '0', '1', '2016-10-18 21:58:29', '2016-10-18 21:58:29');
INSERT INTO `thesis` VALUES ('783', '1', '3', '基于websocket的在线聊天系统', '应用软件开发', '生产实践', '应用研究', '<p>基于websocket的在线聊天系统</p>', '1', '275', '593', null, '2017-05-20 00:00:00', '0', '1', '2016-10-18 22:02:02', '2016-10-19 19:19:56');
INSERT INTO `thesis` VALUES ('785', '1', '3', '物流信息管理系统的设计与实现', '应用软件开发', '生产实践', '应用研究', '<p><strong>本设计可以自选一个开发工具，开发一个物流信息管理系统。要求系统能够实现：仓储管理、分拣管理、配送管理、绩效管理、设备管理、车辆管理及系统管理等模块。</strong></p>', '1', '230', '577', null, '2017-04-23 00:00:00', '0', '1', '2016-10-18 22:16:43', '2016-10-18 22:16:43');
INSERT INTO `thesis` VALUES ('786', '1', '3', '基于Cocos2d-x引擎的RPG类手机游戏的设计与实现', '应用软件开发', '生产实践', '应用研究', '<p><strong>本设计要求采用支持多平台的 2D 手机Cocos2d-x框架，开发一款PRG(Role-Playing Game)角色扮演类手机游戏。可自行设计剧情和角色，要求能够实现游戏登录，设置，运行等基本功能。</strong></p>', '1', '230', '435', null, '2017-04-23 00:00:00', '0', '1', '2016-10-18 22:18:32', '2016-10-18 22:18:32');
INSERT INTO `thesis` VALUES ('787', '1', '3', '基于Unity3D引擎的手机游戏的设计与实现', '应用软件开发', '生产实践', '应用研究', '<p style=\"margin-left:56px\"><strong>本设计要求利用Unity3D 游戏引擎，利用Unity3D 简单易上手、跨平台、丰富的组件等特性，开发一个轻量级的手机游戏。可自行设计游戏内容，完成脚本配置，经过测试，能够实现游戏设置，运行等基本功能。</strong></p>\r\n\r\n<p style=\"margin-left:56px\">&nbsp;</p>', '1', '230', '647', null, '2017-04-23 00:00:00', '0', '1', '2016-10-18 22:21:08', '2016-10-18 22:21:08');
INSERT INTO `thesis` VALUES ('788', '1', '3', '手机游戏的设计与实现', '应用软件开发', '生产实践', '应用研究', '<p><strong>本设计可以自选一个开发平台（Android或IOS）和开发工具（任选），也可以自选一个游戏引擎（如：Cocos2d-x引擎或Unity3d游戏引擎等），设计并开发一款手机游戏，通过对游戏内容和游戏规则的设计，组建一个完整的手机游戏，实现游戏的运行，游戏设置，数据存储等基本功能。</strong></p>', '1', '230', '630', null, '2017-04-23 00:00:00', '0', '1', '2016-10-18 22:22:54', '2016-10-18 22:22:54');
INSERT INTO `thesis` VALUES ('789', '1', '3', '在线音乐试听网站的设计与实现', '应用软件开发', '生产实践', '应用研究', '<p style=\"margin-left:56px\"><strong>本设计要求自选一个开发工具，开发一个能够在线试听音乐的网站。</strong><strong>网站设计要求三种角色人员：一般浏览用户，注册用户和管理员，前台要求实现音乐搜索，音乐试听，音乐排行及娱乐新闻及音乐介绍等功能；后台要求能够实现文件上传，文件编辑，文件分类及系统管理等功能。</strong></p>', '1', '230', '500', null, '2017-04-23 00:00:00', '0', '1', '2016-10-18 22:24:51', '2016-10-18 22:24:51');
INSERT INTO `thesis` VALUES ('790', '1', '3', '订票与选座APP设计与实现', '应用软件开发', '生产实践', '应用研究', '<p>【任务】<br />\r\n1. 实现汽车、火车、飞机等交通工具车票浏览和预订；</p>\r\n\r\n<p>2. 实现在线选座功能。&nbsp;</p>\r\n\r\n<p>【要求】<br />\r\n1. 使用Android或IOS进行开发<br />\r\n2. 数据库根据自身情况进行选择</p>\r\n\r\n<p>【联系方式】<br />\r\n手机：13760732070<br />\r\nemail：wangct@scau.edu.cn</p>', '1', '265', '605', null, '2017-04-23 00:00:00', '0', '1', '2016-10-18 22:25:22', '2016-10-18 22:25:22');
INSERT INTO `thesis` VALUES ('791', '1', '3', '社交网站的设计与实现', '应用软件开发', '生产实践', '应用研究', '<p style=\"margin-left:56px\"><strong>本设计可以自选一个开发工具，开发一个社交网站。</strong><strong>网站功能是为朋友们设计一个聚会场所。即本身是网站，提供给用户的是应用服务，</strong><strong>可以将好友聚到一起，相互沟通关照，并结交新的朋友。注册之后的用户随时发表一下心情，将自己所关注的事情共享在自己的日志文件里，同时可以查看到其他用户所发表的日志，并可以留言，当该用户看到这个留言时可以对该留言进行回复。网站要求实现：账户管理、好友管理、日志管理及信息回复等功能。</strong></p>', '1', '230', '486', null, '2017-04-23 00:00:00', '0', '1', '2016-10-18 22:26:47', '2016-10-18 22:26:47');
INSERT INTO `thesis` VALUES ('792', '1', '3', '图书馆荐书系统的设计与开发', '应用软件开发', '生产实践', '应用研究', '<p>目的：方便学生向图书馆推荐最新图书</p>\r\n\r\n<p>功能：1. 学生登录，录入推荐图书信息</p>\r\n\r\n<p>&nbsp; &nbsp; 2. 已经推荐的图书，可以进行投票，页面显示投票最高的若干图书</p>', '1', '270', '572', null, '2017-05-01 00:00:00', '0', '1', '2016-10-18 22:29:04', '2016-10-18 22:29:04');
INSERT INTO `thesis` VALUES ('793', '1', '3', '基于微信公众号的营销系统设计与实现', '应用软件开发', '生产实践', '应用研究', '<p>【任务】<br />\r\n1. 自动通过别人的微信群邀请添加微信群</p>\r\n\r\n<p>2. 指定微信群自动邀请微信好友</p>\r\n\r\n<p>3. 微信信息定时、批量转发至微信群，不限量</p>\r\n\r\n<p>4. 微信群消息匹配并添加相应好友</p>\r\n\r\n<p>【要求】<br />\r\n1. 利用微信公众号<br />\r\n2. 编程语言及数据库根据自身情况进行选择</p>\r\n\r\n<p>【联系方式】<br />\r\n手机：13760732070<br />\r\nemail：wangct@scau.edu.cn</p>', '1', '265', '526', null, '2017-04-23 00:00:00', '0', '1', '2016-10-18 22:29:13', '2016-10-19 14:56:24');
INSERT INTO `thesis` VALUES ('794', '1', '3', '基于MRF的加密灰度图像压缩算法仿真实现', '信息安全', '科研项目', '基础研究', '<p>【任务】<br />\r\n1. 利用马尔科夫随机场提升灰度图像压缩性能&nbsp;</p>\r\n\r\n<p>【要求】<br />\r\n1. 使用Matlab或C</p>\r\n\r\n<p>【联系方式】<br />\r\n手机：13760732070<br />\r\nemail：wangct@scau.edu.cn</p>', '1', '265', null, null, '2017-04-23 00:00:00', '0', '1', '2016-10-18 22:32:24', '2016-10-18 22:32:24');
INSERT INTO `thesis` VALUES ('795', '1', '3', '基于Material Design的Web应用实现', '应用软件开发', '生产实践', '基础研究', '<p>基于Material Design的Web应用实现</p>', '1', '277', '771', null, '2017-04-10 00:00:00', '0', '1', '2016-10-18 22:32:51', '2016-10-18 22:32:51');
INSERT INTO `thesis` VALUES ('796', '1', '3', '校园二手物品交易平台的设计与开发', '应用软件开发', '生产实践', '应用研究', '<p>目的：促进校园内图书等物品有效流通，提高物品使用效率，节能环保</p>\r\n\r\n<p>功能：1. 学生登录，录入/删除二手物品信息</p>\r\n\r\n<p>    2. 查询二手物品，线下交易</p>\r\n\r\n<p> </p>', '1', '270', '585', null, '2017-05-01 00:00:00', '0', '1', '2016-10-18 22:32:55', '2016-10-18 23:02:41');
INSERT INTO `thesis` VALUES ('797', '1', '3', '基于Android的业委会管理APP', '应用软件开发', '生产实践', '应用研究', '<p>【任务】<br />\r\n1. 通过APP管理小区业委会的内部相关事务、财务等</p>\r\n\r\n<p>2. 通过APP管理小区的公共事务、通告消息等&nbsp;</p>\r\n\r\n<p>【要求】<br />\r\n1. 使用Android平台<br />\r\n2. 数据库根据自身情况进行选择</p>\r\n\r\n<p>【联系方式】<br />\r\n手机：13760732070<br />\r\nemail：wangct@scau.edu.cn</p>', '1', '265', '632', null, '2017-04-23 00:00:00', '0', '1', '2016-10-18 22:35:09', '2016-10-19 15:30:09');
INSERT INTO `thesis` VALUES ('798', '1', '3', 'dojo DateTextBox在Web系统的国际化应用', '应用软件开发', '生产实践', '基础研究', '<p>dojo DateTextBox在Web系统的国际化应用</p>', '1', '277', '772', null, '2017-04-10 00:00:00', '0', '1', '2016-10-18 22:35:12', '2016-10-18 22:35:12');
INSERT INTO `thesis` VALUES ('799', '1', '3', '响应式网页框架的设计与实现', '应用软件开发', '生产实践', '基础研究', '<p>响应式网页框架的设计与实现</p>', '1', '277', '773', null, '2017-04-10 00:00:00', '0', '1', '2016-10-18 22:36:18', '2016-10-18 22:36:18');
INSERT INTO `thesis` VALUES ('800', '1', '3', '基于安卓的茶叶追溯系统', '应用软件开发', '科研项目', '基础研究', '<p>建立基于移动终端的茶叶种植、加工、销售的监管与追溯</p>', '1', '223', null, null, '2017-04-23 00:00:00', '0', '1', '2016-10-18 22:36:40', '2016-10-18 22:36:40');
INSERT INTO `thesis` VALUES ('801', '1', '3', '基于SSM的企业工资管理子系统的实现', '应用软件开发', '生产实践', '基础研究', '<p>基于SSM的企业工资管理子系统的实现</p>', '1', '277', '788', null, '2017-04-10 00:00:00', '0', '1', '2016-10-18 22:37:08', '2016-10-18 22:37:08');
INSERT INTO `thesis` VALUES ('802', '1', '3', '基于SSH恵家 E 站中金恵家与加盟合作子系统的开发', '应用软件开发', '生产实践', '基础研究', '<p>基于SSH恵家 E 站中金恵家与加盟合作子系统的开发</p>', '1', '277', '790', null, '2017-04-10 00:00:00', '0', '1', '2016-10-18 22:37:51', '2016-10-18 22:37:51');
INSERT INTO `thesis` VALUES ('803', '1', '3', '新浪微博app', '应用软件开发', '生产实践', '基础研究', '<p>新浪微博app</p>', '1', '277', '824', null, '2017-04-10 00:00:00', '0', '1', '2016-10-18 22:38:45', '2016-10-18 22:38:45');
INSERT INTO `thesis` VALUES ('804', '1', '3', 'OracleRAC集群运维策略分析', '应用软件开发', '生产实践', '基础研究', '<p>OracleRAC集群运维策略分析</p>', '1', '277', '832', null, '2017-04-10 00:00:00', '0', '1', '2016-10-18 22:39:24', '2016-10-18 22:39:24');
INSERT INTO `thesis` VALUES ('805', '1', '3', '基于SpringMVC+Spring+Mybatis电子产品销售网站', '应用软件开发', '生产实践', '基础研究', '<p>基于SpringMVC+Spring+Mybatis电子产品销售网站</p>', '1', '277', '833', null, '2017-04-10 00:00:00', '0', '1', '2016-10-18 22:40:05', '2016-10-18 22:40:05');
INSERT INTO `thesis` VALUES ('806', '1', '3', '基于iOS的茶叶追溯系统', '应用软件开发', '科研项目', '基础研究', '<p>建立基于苹果移动终端的茶叶种植、加工、销售的监管与追溯</p>', '1', '223', null, null, '2017-04-23 00:00:00', '0', '1', '2016-10-18 22:40:17', '2016-10-18 22:40:17');
INSERT INTO `thesis` VALUES ('807', '1', '3', '肺部病灶区域分割研究', '数字图像处理', '科研项目', '基础研究', '<p>(1) 简介：近年来，由于环境污染等因素的影响，肺结核以及肺癌发病率逐步上升。对肺部CT图像的分析研究对肺癌的早期发现和早期治疗具有重要意义。目前，对肺部病灶区域的检测主要集中在对肺部结节的检测上，因此，准确地分割检测出肺部结节是进行分析研究的首要任务。</p>\r\n\r\n<p>(2) 要求: 利用图像处理技术，对CT图像中的区域进行精确分割和定位。</p>\r\n\r\n<p>(3) 所需具备的基础:Matlab或者任何编程语言基础。</p>', '1', '219', null, null, '2017-04-23 00:00:00', '0', '1', '2016-10-18 22:40:45', '2016-10-18 22:53:14');
INSERT INTO `thesis` VALUES ('808', '1', '3', '商品交易系统之商家管理子系统', '应用软件开发', '生产实践', '基础研究', '<p>商品交易系统之商家管理子系统</p>', '1', '277', '850', null, '2017-04-10 00:00:00', '0', '1', '2016-10-18 22:40:51', '2016-10-18 22:40:51');
INSERT INTO `thesis` VALUES ('809', '1', '3', '国内独立游戏开发交流网', '应用软件开发', '生产实践', '基础研究', '<p>国内独立游戏开发交流网</p>', '1', '277', '851', null, '2017-04-10 00:00:00', '0', '1', '2016-10-18 22:41:24', '2016-10-18 22:41:24');
INSERT INTO `thesis` VALUES ('810', '1', '3', '基于物联网的茶叶追溯系统', '应用软件开发', '科研项目', '基础研究', '<p>建立基于物联网的茶叶种植、加工、销售的监管与追溯</p>', '1', '223', null, null, '2017-04-23 00:00:00', '0', '1', '2016-10-18 22:41:38', '2016-10-18 22:41:38');
INSERT INTO `thesis` VALUES ('811', '1', '3', '在线音乐网站', '应用软件开发', '生产实践', '基础研究', '<p>在线音乐网站</p>', '1', '277', '852', null, '2017-04-10 00:00:00', '0', '1', '2016-10-18 22:42:09', '2016-10-18 22:42:09');
INSERT INTO `thesis` VALUES ('812', '1', '3', '全景图像拼接方法研究', '数字图像处理', '科研项目', '基础研究', '<p>(1) 简介：基于图像建模和绘制的虚拟环境构造是近年来虚拟现实技术研究的热点，其中基于序列图像的全景图像拼接技术研究是虚拟环境临场感的一个关键因素。</p>\r\n\r\n<p>(2) 要求: 以普通照相机拍摄的序列图像为基础,通过适当的图像处理方法将相邻两幅序列图像拼接在一起，使得拼接后的图像自然、逼真。</p>\r\n\r\n<p>(3) 所需具备的基础:&nbsp;Matlab或者任何编程语言基础。</p>\r\n\r\n<p>&nbsp;</p>', '1', '219', null, null, '2017-04-23 00:00:00', '0', '1', '2016-10-18 22:42:37', '2016-10-18 22:52:42');
INSERT INTO `thesis` VALUES ('813', '1', '3', '基于内容的图像检索技术研究', '数字图像处理', '科研项目', '基础研究', '<p>(1) 简介：传统的图像检索是基于文本的，即通过图片的名称、文字信息和索引关系来实现查询功能。然而图像往往包含较多的信息量。因此按照图像内容本身来搜索，具有很高的使用价值。</p>\r\n\r\n<p>(2) 要求: 允许用户输入一张图片，给出各个图片的相似度。</p>\r\n\r\n<p>(3) 所需具备的基础:&nbsp;&nbsp;Matlab或者任何编程语言基础。</p>', '1', '219', null, null, '2017-04-23 00:00:00', '0', '1', '2016-10-18 22:43:51', '2016-10-18 22:51:56');
INSERT INTO `thesis` VALUES ('814', '1', '3', '基于图像处理的蔬菜害虫识别系统', '应用软件开发', '科研项目', '基础研究', '<p>应用数字图像处理技术识别蔬菜害虫</p>', '1', '223', null, null, '2017-04-23 00:00:00', '0', '1', '2016-10-18 22:44:08', '2016-10-18 22:44:08');
INSERT INTO `thesis` VALUES ('815', '1', '3', '基于图像的答题卡识别技术研究', '数字图像处理', '科研项目', '基础研究', '<p>(1) 简介：为简化阅卷过程，减少人为错误发生，使用图像识别技术对学生的答题卡进行答案识别，进而计算出分数。</p>\r\n\r\n<p>(2) 要求: 输入一张答题卡，定位和检测学生的答案。</p>\r\n\r\n<p>(3) 所需具备的基础: Matlab或者任何编程语言基础。</p>', '1', '219', null, null, '2017-04-23 00:00:00', '0', '1', '2016-10-18 22:44:57', '2016-10-18 22:51:30');
INSERT INTO `thesis` VALUES ('816', '1', '3', '网站数字验证码识别技术的研究', '数字图像处理', '科研项目', '基础研究', '<p>(1) 简介：为了提高网站的安全性，防止机器人攻击，许多网站增设了一个验证码测试。运用图像处理和模式识别方法对数字验证码进行识别。</p>\r\n\r\n<p>(2) 要求: 输入一张数字验证码图片，识别出数字内容。</p>\r\n\r\n<p>(3) 所需具备的基础:&nbsp;Matlab或者任何编程语言基础。</p>\r\n\r\n<p>&nbsp;</p>\r\n\r\n<p>&nbsp;</p>', '1', '219', '600', null, '2017-04-23 00:00:00', '0', '1', '2016-10-18 22:46:07', '2016-10-18 22:50:46');
INSERT INTO `thesis` VALUES ('817', '1', '3', '蔬菜害虫视频监控网络系统设计研究', '应用软件开发', '科研项目', '基础研究', '', '1', '223', null, null, '2017-04-23 00:00:00', '0', '1', '2016-10-18 22:47:12', '2016-10-18 22:47:12');
INSERT INTO `thesis` VALUES ('818', '1', '3', 'PCA算法的研究与应用', '大数据', '科研项目', '基础研究', '<p>(1) 简介：PCA算法即主成分分析算法，是一种统计方法。通过正交变换将一组可能存在相关性的变量转换为一组线性不相关的变量，转换后的这组变量叫主成分。</p>\r\n\r\n<p>(2) 要求: 熟悉掌握PCA算法，实现一个PCA算法的应用。</p>\r\n\r\n<p>(3) 所需具备的基础:&nbsp; Matlab或者任何编程语言基础。</p>', '1', '219', '340', null, '2017-04-23 00:00:00', '0', '1', '2016-10-18 22:47:13', '2016-10-18 22:47:13');
INSERT INTO `thesis` VALUES ('819', '1', '3', 'PSO算法的研究与实现', '数据挖掘', '科研项目', '基础研究', '<p>(1) 简介： PSO即粒子群优化算法。是一种有效的全局寻优算法。通过群体中粒子间的合作与竞争产生的群体智能来指导优化搜索。</p>\r\n\r\n<p>(2) 要求: 熟悉掌握PSO算法，实现一个PSO算法的应用。</p>\r\n\r\n<p>(3) 所需具备的基础: Matlab或者任何编程语言基础。</p>', '1', '219', null, null, '2017-04-23 00:00:00', '0', '1', '2016-10-18 22:48:08', '2016-10-18 22:48:08');
INSERT INTO `thesis` VALUES ('820', '1', '3', 'SA算法的研究与实现', '数据挖掘', '科研项目', '基础研究', '<p>(1) 简介：SA即模拟退火算法。模拟退火算法是通过赋予搜索过程一种时变且最终趋于零的概率突跳性，从而可有效避免陷入局部极小并最终趋于全局最优的串行结构的优化算法。</p>\r\n\r\n<p>(2) 要求: 熟悉掌握SA算法，实现一个SA算法的应用。</p>\r\n\r\n<p>(3) 所需具备的基础:&nbsp;Matlab或者任何编程语言基础。</p>', '1', '219', null, null, '2017-04-23 00:00:00', '0', '1', '2016-10-18 22:49:20', '2016-10-18 22:49:20');
INSERT INTO `thesis` VALUES ('821', '1', '3', '物流车辆调度管理系统', '应用软件开发', '生产实践', '基础研究', '<p>物流车辆调度管理系统是针对物流公司内部的车辆、人员、路线、货物等的管理系统，还包括任务指派和货物跟踪功能。也就是车辆、人员、路线的CRUD操作，还有路线的生成、任务的指派、货物信息的追踪。实现技术没有限制，短信联系13640707241</p>', '1', '277', null, null, '2017-04-10 00:00:00', '0', '1', '2016-10-18 22:50:37', '2016-10-18 22:50:37');
INSERT INTO `thesis` VALUES ('822', '1', '3', '蔬菜害虫预警预报系统设计研究', '应用软件开发', '科研项目', '基础研究', '', '1', '223', null, null, '2017-04-23 00:00:00', '0', '1', '2016-10-18 22:52:29', '2016-10-18 22:52:29');
INSERT INTO `thesis` VALUES ('823', '1', '3', '基于安卓的茶叶生产管理系统设计研究', '应用软件开发', '科研项目', '基础研究', '', '1', '223', null, null, '2017-04-23 00:00:00', '0', '1', '2016-10-18 22:54:25', '2016-10-18 22:54:25');
INSERT INTO `thesis` VALUES ('824', '1', '3', '定时提醒桌面小工具的设计与开发', '应用软件开发', '生产实践', '应用研究', '<p>目的：定时提醒工作人员休息，以防过度用眼</p>\r\n\r\n<p>功能：1. 设置提醒方式、时间</p>\r\n\r\n<p>&nbsp; &nbsp; 2. 定时弹出桌面工具，提示工作人员休息</p>', '1', '270', '571', null, '2017-05-01 00:00:00', '0', '1', '2016-10-18 22:55:03', '2016-10-18 22:55:03');
INSERT INTO `thesis` VALUES ('825', '1', '3', '基于ios的茶叶生产管理系统设计研究', '应用软件开发', '科研项目', '基础研究', '', '1', '223', null, null, '2017-04-23 00:00:00', '0', '1', '2016-10-18 22:56:39', '2016-10-18 22:56:39');
INSERT INTO `thesis` VALUES ('826', '1', '3', '酒店在线点菜系统的设计与开发', '应用软件开发', '生产实践', '应用研究', '<p>目的：酒店菜谱无纸化，实现在线点餐，节约等待时间</p>\r\n\r\n<p>功能：1. 管理员录入菜品（名称、介绍、价格）</p>\r\n\r\n<p>    2. 顾客登录系统，自助点餐</p>', '1', '270', '583', null, '2017-05-01 00:00:00', '0', '1', '2016-10-18 23:02:14', '2016-10-18 23:03:56');
INSERT INTO `thesis` VALUES ('827', '1', '3', '基于Java 的茶叶溯源系统', '应用软件开发', '科研项目', '基础研究', '', '1', '223', null, null, '2017-04-23 00:00:00', '0', '1', '2016-10-18 23:02:34', '2016-10-18 23:02:34');
INSERT INTO `thesis` VALUES ('828', '1', '3', '基于大数据的数据检索引擎系统', '大数据', '生产实践', '应用研究', '<p>对当前数据量大时响应时间慢、没办法实时查询的情况进行解决，基于大数据的数据检索引擎系统</p>', '1', '241', '333', null, '2017-04-30 00:00:00', '0', '1', '2016-10-18 23:13:47', '2016-10-18 23:13:47');
INSERT INTO `thesis` VALUES ('829', '1', '3', '畜禽产品质量安全追溯可信第三方平台设计开发', '应用软件开发', '科研项目', '应用研究', '<p>调研畜牧业基本养殖条件，对动物产品的养殖流程及关键环节进行整理提炼，可追溯的可信第三方信息管理平台，能够满足畜禽产品养殖、物流仓储、销售等环节数据采集汇总需求，并支持生产者、销售者、监管部门和消费者不同角色的相应操作权限；使用PHP+SQL进行系统开发，能实现上述主要功能模块，要求完成系统设计开发并测试及试用。</p>\r\n\r\n<p>&nbsp;</p>', '1', '233', null, null, '2017-04-18 00:00:00', '0', '1', '2016-10-18 23:17:53', '2016-10-18 23:17:53');
INSERT INTO `thesis` VALUES ('830', '1', '3', '基于RFID的实验室设备管理APP系统', '应用软件开发', '生产实践', '设计性', '<p>学习RFID系统应用技术及功能，调研实验室资产设备管理的业务需求，根据需求整理管理流程和主要功能模块，与团队配合实现管理信息数据库设计，并采用Android开发技术实现实验室资产设备管理信息的APP系统开发，最后测试并试用。</p>', '1', '233', '618', null, '2017-05-20 00:00:00', '0', '1', '2016-10-19 11:23:09', '2016-10-19 11:23:09');
INSERT INTO `thesis` VALUES ('831', '2', '2', '基于Web的农业文本信息自动抽取方法', '设计类', '导师出题', '毕业论文', '<p>目前Web上的网页信息呈现模式主要是为了方便用户的浏览，然而却也导致应用程序无法直接解析和利用这些网页数据作进一步的分析。Web信息抽取主要是为了自动识别网页中的正文内容，从网络上半结构化的HTML页面中提取网页正文信息，去掉无关的冗余信息（如导航栏、广告推荐等），从而将解析到的文本信息用于数据的分析、查询统计及结构化展示等。</p>', '1', '18', '189', null, '2017-03-31 00:00:00', '0', '1', '2016-10-19 11:50:12', '2016-10-19 11:50:12');
INSERT INTO `thesis` VALUES ('832', '1', '3', '社区医院综合管理信息系统的设计', '应用软件开发', '生产实践', '应用研究', '<p>本系统根据E-R数据模型进行数据库表详细设计，基于Java EE平台，搭建SSH框架，使用Struts2框架把数据与逻辑分开，采用Hibernate框架对持久层进行支撑，再使用Spring框架对Struts2框架与Hibernate框架进行整合，降低系统各层间的耦合，使系统的维护与扩展更方便，编写代码实现社区医院综合管理。</p>', '1', '238', null, null, '2017-05-20 00:00:00', '0', '1', '2016-10-19 14:43:39', '2016-10-19 14:43:39');
INSERT INTO `thesis` VALUES ('833', '1', '3', '校园易物app开发', '应用软件开发', '科研项目', '应用研究', '<p>同学们可以在手机app上发布求购信息和出售信息，公布商品的文字描述、图片和推销视频。该易物app实用性较强。</p>', '1', '864', '561', null, '2017-04-20 00:00:00', '0', '1', '2016-10-19 15:00:39', '2016-10-19 15:00:39');
INSERT INTO `thesis` VALUES ('834', '1', '3', '预算管理系统的设计与实现', '应用软件开发', '生产实践', '应用研究', '<p>根据包括报表管理，指标管理，预算模型，预算分析，流程管理，消息管理，系统管理等，功能间彼此独立，数据间逻辑关系密切。系统采用B/S模式，</p>', '1', '238', null, null, '2017-05-20 00:00:00', '0', '1', '2016-10-19 15:02:44', '2016-10-19 15:02:44');
INSERT INTO `thesis` VALUES ('835', '1', '3', '小型就业管理信息系统的设计与实现', '应用软件开发', '科研项目', '基础研究', '<p>小型就业系统主要功能有：学生基本信息和就业信息管理，简历管理，企业信息管理，招聘信息管理，招聘会管理，就业指导信息管理，事务通知管理，用户管理，院系管理，采用基于Java EE平台的MyEclipse开发工具与框架Struts2+ Hibernate3实现该</p>', '1', '238', '417', null, '2017-05-20 00:00:00', '0', '1', '2016-10-19 15:05:17', '2016-10-19 15:05:17');
INSERT INTO `thesis` VALUES ('836', '1', '3', '基于Unity3d的手机游戏设计', '应用软件开发', '生产实践', '基础研究', '<p>研究Unity3D技术并设计实现手机游戏，游戏内容描述：生存类游戏，玩家需在一个地图中躲避或者击杀向他袭击而来的怪物，当玩家受到攻击时玩家生命值会减少，玩家生命值为0时游戏结束。</p>', '1', '220', '534', null, '2017-04-23 00:00:00', '0', '1', '2016-10-19 15:10:52', '2016-10-19 15:11:42');
INSERT INTO `thesis` VALUES ('837', '1', '3', '找不同手机益智游戏开发', '应用软件开发', '科研项目', '应用研究', '<p>开发一款手机游戏，游戏显示两张相似的图片，要求用户找出两张图片中几个不同的地方，全部找对，游戏晋级，否则，游戏重来。</p>', '1', '864', '483', null, '2017-05-20 00:00:00', '0', '1', '2016-10-19 15:13:09', '2016-10-19 15:13:09');
INSERT INTO `thesis` VALUES ('838', '1', '3', '钓鱼爱好者app开发', '应用软件开发', '科研项目', '应用研究', '<p>这是一款基于地图应用的app。钓鱼爱好者加入该app，可以分享新发现的钓鱼地点，将该钓鱼地点加入地图中并进行标识，同时推送给该钓鱼地点附近的爱好者；钓鱼爱好者还可以以图片的形式发布今天的钓鱼成果，并可标价出售一些鱼给其他爱好者。</p>', '1', '864', '429', null, '2017-05-20 00:00:00', '0', '1', '2016-10-19 15:20:55', '2016-10-19 15:21:55');
INSERT INTO `thesis` VALUES ('839', '1', '3', '高校学生档案信息管理系统', '应用软件开发', '其他', '设计性', '<p>使用任何类型编程语言，实现一款网络版或单机版的档案信息管理系统，可以对高校学生的档案进行电子化管理，具体包括档案信息录入，档案多条件查询，档案分析等。数据库可以使用Access 或 SQL Server等。</p>', '1', '862', null, null, '2017-04-13 00:00:00', '0', '1', '2016-10-19 15:23:08', '2016-10-19 15:23:08');
INSERT INTO `thesis` VALUES ('840', '1', '3', '基于JSP的 高校人机交互课程学生考勤管理系统', '应用软件开发', '生产实践', '基础研究', '<p>开发环境是Eclipse、MyEclipse的，为JSP/JAVA程序；</p>\r\n\r\n<p>实现自动点名，核查及平时成绩核算</p>', '1', '245', '552', null, '2017-05-20 00:00:00', '0', '1', '2016-10-19 15:26:07', '2016-10-19 15:26:07');
INSERT INTO `thesis` VALUES ('841', '1', '3', '图书信息管理系统设计与实现', '应用软件开发', '生产实践', '应用研究', '<p>【任务】<br />\r\n1. 实现图书管图书信息的浏览、增删查改等功能 </p>\r\n\r\n<p>【要求】<br />\r\n1. 使用Java或C#<br />\r\n2. 数据库根据自身情况进行选择</p>\r\n\r\n<p>【联系方式】<br />\r\n手机：13760732070<br />\r\nemail：wangct@scau.edu.cn</p>', '1', '265', '510', null, '2017-04-23 00:00:00', '0', '1', '2016-10-19 15:26:26', '2016-10-19 15:29:43');
INSERT INTO `thesis` VALUES ('842', '1', '3', '图片标记系统的设计与实现', '应用软件开发', '其他', '设计性', '<p>设计一款图片标记软件，系统可以读入多种格式的图片，然后对图片的物体进行矩形框的标注，并将标注信息进行存储。矩形框进行标记时，由于不同问题的大小不一致，故要求系统能提供可变的矩形框，供用户进行调整。</p>', '1', '862', null, null, '2017-04-23 00:00:00', '0', '1', '2016-10-19 15:31:01', '2016-10-19 15:31:01');
INSERT INTO `thesis` VALUES ('843', '1', '3', '基于JSP的 人机交互教学网站的设计与实现', '应用软件开发', '生产实践', '基础研究', '<p>双语教学的人机交互课程教学网站开发，包括课件制作，成绩统计，课后作业审查</p>\r\n\r\n<p>开发环境是Eclipse、MyEclipse的，为JSP/JAVA程序</p>', '1', '245', '553', null, '2017-05-20 00:00:00', '0', '1', '2016-10-19 15:32:33', '2016-10-19 15:32:33');
INSERT INTO `thesis` VALUES ('844', '1', '3', '多种题型在线考试系统设计与实现', '应用软件开发', '生产实践', '基础研究', '<p>多题型在线考试系统，包括题库抽题，防止作弊成绩统计以及试卷分析</p>', '1', '245', null, null, '2017-05-20 00:00:00', '0', '1', '2016-10-19 15:36:53', '2016-10-19 15:36:53');
INSERT INTO `thesis` VALUES ('845', '1', '3', '小型旅馆管理系统', '应用软件开发', '其他', '设计性', '<p>实现一款小型旅馆的管理系统，可以满足一般小型旅馆的日程管理需要。完成的功能：客房类型管理、客房（房间）管理、客房查询、客户查询、客户入住和客户结算。</p>\r\n\r\n<p>。可以实现对旅馆房间入住情况的可视化显示。</p>', '1', '862', null, null, '2017-04-23 00:00:00', '0', '1', '2016-10-19 15:37:37', '2016-10-19 15:37:37');
INSERT INTO `thesis` VALUES ('846', '1', '3', '基于深度学习的加密灰度图像压缩算法', '应用软件开发', '科研项目', '基础研究', '<p>【任务】<br />\r\n1. 利用深度学习实现加密灰度图像的压缩与重构&nbsp;</p>\r\n\r\n<p>【要求】<br />\r\n1. 使用Matlab、C或Python</p>\r\n\r\n<p>【联系方式】<br />\r\n手机：13760732070<br />\r\nemail：wangct@scau.edu.cn</p>', '1', '265', null, null, '2017-04-23 00:00:00', '0', '1', '2016-10-19 15:37:39', '2016-10-19 15:37:39');
INSERT INTO `thesis` VALUES ('847', '1', '3', '基于Qt的手机游戏开发', '应用软件开发', '科研项目', '基础研究', '<p>Qt, OpenCV</p>', '1', '245', null, null, '2017-05-20 00:00:00', '0', '1', '2016-10-19 15:38:15', '2016-10-19 15:38:15');
INSERT INTO `thesis` VALUES ('848', '1', '3', '基于语义网的电子购物网站的设计与实现', '应用软件开发', '生产实践', '基础研究', '<p>新型网络下的购物网站</p>', '1', '245', '570', null, '2017-05-20 00:00:00', '0', '1', '2016-10-19 15:39:57', '2016-10-19 15:39:57');
INSERT INTO `thesis` VALUES ('849', '1', '3', '跨平台网络游戏的开发与实现', '应用软件开发', '生产实践', '基础研究', '<p>Android, iphone, ipad跨平台游戏</p>', '1', '245', null, null, '2017-05-20 00:00:00', '0', '1', '2016-10-19 15:42:08', '2016-10-19 15:42:08');
INSERT INTO `thesis` VALUES ('850', '1', '3', '员工工资管理系统', '应用软件开发', '其他', '其他', '<p>设计一个小型企业的工资管理系统，由计算机代替人工执行一系列诸如增加新员工，删除旧员工，工资查询，统计等操作。编程语言不限，数据库语言不限。</p>', '1', '862', null, null, '2017-04-23 00:00:00', '0', '1', '2016-10-19 15:43:36', '2016-10-19 16:00:15');
INSERT INTO `thesis` VALUES ('851', '1', '3', '基于Android 的个性化推荐商品网站的设计与实现', '应用软件开发', '生产实践', '基础研究', '<p>个性化商品的推荐和对比</p>', '1', '245', null, null, '2017-05-20 00:00:00', '0', '1', '2016-10-19 15:45:21', '2016-10-19 15:45:21');
INSERT INTO `thesis` VALUES ('852', '1', '3', '交互式网上自动答疑系统的设计与实现', '应用软件开发', '生产实践', '基础研究', '<p>关键字匹配，友好的人机交互界面</p>', '1', '245', null, null, '2017-05-20 00:00:00', '0', '1', '2016-10-19 15:48:52', '2016-10-19 15:48:52');
INSERT INTO `thesis` VALUES ('853', '1', '3', '公司门户网站建设', '应用软件开发', '其他', '其他', '<p>开发一个公司的门户网站，包括公司简介、公司产品的介绍、公司招聘信息管理、公司新闻管理等基本模块。编程语言和数据库不限。</p>', '1', '862', null, null, '2017-04-23 00:00:00', '0', '1', '2016-10-19 15:53:45', '2016-10-19 15:53:45');
INSERT INTO `thesis` VALUES ('854', '1', '3', '图书馆图书自动分类模型的设计与实现', '应用软件开发', '生产实践', '基础研究', '<p>书名，二维码或条形码，书摘中关键词寻找和匹配</p>', '1', '245', null, null, '2017-05-20 00:00:00', '0', '1', '2016-10-19 15:58:11', '2016-10-19 15:58:11');
INSERT INTO `thesis` VALUES ('855', '1', '3', '网上求职招聘系统', '应用软件开发', '其他', '设计性', '<p>开发一款网络版的网上求职系统，求职者可以进行注册，在线填写自己的简历，并按条件查询由招聘人员发布的招聘信息。招聘人员可以发布招聘信息，筛选符合一定条件的应聘人员，并进行简历查看。</p>', '1', '862', null, null, '2017-05-20 00:00:00', '0', '1', '2016-10-19 15:58:32', '2016-10-19 16:00:03');
INSERT INTO `thesis` VALUES ('856', '1', '3', '图书馆无人值班自动管理系统', '应用软件开发', '生产实践', '基础研究', '<p>图书馆管理系统</p>', '1', '245', '555', null, '2017-05-20 00:00:00', '0', '1', '2016-10-19 16:01:10', '2016-10-19 16:01:10');
INSERT INTO `thesis` VALUES ('857', '1', '3', '房产销售网站', '应用软件开发', '其他', '设计性', '<p>开发一个专门销售房产的销售网站，需要卖房产的人可以注册，并上传图文房产信息，需要购买房子的人，可以查询特定条件下的房产信息。实现语言和数据库不限。</p>', '1', '862', null, null, '2017-04-23 00:00:00', '0', '1', '2016-10-19 16:08:36', '2016-10-19 16:08:36');
INSERT INTO `thesis` VALUES ('859', '1', '3', '基于微信公众号的防作弊考勤系统', '应用软件开发', '生产实践', '应用研究', '<p>基于微信公众号的防作弊考勤系统</p>', '0', '275', null, null, '2017-05-20 00:00:00', '0', '1', '2016-10-19 19:19:07', '2016-10-19 19:19:07');
INSERT INTO `thesis` VALUES ('860', '1', '3', '在线培训管理系统的设计与实现', '应用软件开发', '生产实践', '设计性', '<p>本项目可以采用Tapestry、Spring、Hibernate组合框架，实现了在线培训管理系统。通过对教师、学员、培训管理者、培训决策者的相关需求分析，构建教学、学习、管理与决策的互动模式。从需求定义、培训安排、培训实施、培训评估与培训统计的全过程管理，实现了传统面授和网上培训相结合的混合式培训方式。<br />\r\n&nbsp;</p>', '0', '276', null, null, '2017-04-20 00:00:00', '0', '1', '2016-10-19 21:13:17', '2016-10-19 21:13:17');
INSERT INTO `thesis` VALUES ('861', '1', '3', '基于微信的图书管理系统的设计与实现', '应用软件开发', '生产实践', '设计性', '<p>&nbsp;微信公众平台是一个开放的平台,同时微信公众平台开放了其API接口,任何机构都可以开发并构建基于开放接口的第三方服务平台,实现和机构应用的无缝对接。本项目旨在运用微信公众平台的API接口开发功能，设计和实现基于微信的图书馆服务系统，为用户提供快捷方便的图书馆相关信息查询服务。<br />\r\n&nbsp;</p>', '0', '276', null, null, '2017-04-20 00:00:00', '0', '1', '2016-10-19 21:21:22', '2016-10-19 21:21:22');
INSERT INTO `thesis` VALUES ('862', '1', '3', '证件照的质量预检测系统的设计与实现', '应用软件开发', '生产实践', '设计性', '<p>近几年，随着电子政务的推进,网上证件照制作开始进入公众视野。一般证件照的制作流程是拍摄、裁剪、色彩优化和背景替换。如果用户拍摄的照片存在背景杂乱、映像模糊、有噪点或者曝光不均匀等问题时会对证件照制作带来麻烦或根本得不到合格的证件照,因此需要预先对用户拍摄的照片质量进行检测,如果质量太差应及时反馈给用户以便其重新拍摄。</p>', '0', '276', null, null, '2017-04-20 00:00:00', '0', '1', '2016-10-19 21:39:00', '2016-10-19 21:39:00');
INSERT INTO `thesis` VALUES ('863', '1', '3', '基于Android 的智能考勤系统的设计与实现', '应用软件开发', '生产实践', '设计性', '<p>目前对学生进行考勤管理主要是以纸张记录考勤情况的方式，它既不能避免学生代替点名答到现象的发生，又浪费了大量的课堂教学时间。随着信息技术的高速发展，智能手机早已成为学生的必备品之一。根据手机地址的唯一性，设计了一套基于Android的智能考勤系统，通过智能手机来进行学生的课堂考勤管理，对于加强学生考勤管理，提高学生到课率和教学质量有着重要意义。<br />\r\n&nbsp;</p>', '0', '276', null, null, '2017-04-20 00:00:00', '0', '1', '2016-10-19 21:52:37', '2016-10-19 21:52:37');
INSERT INTO `thesis` VALUES ('864', '1', '3', '自行车自助借还系统的设计与实现', '应用软件开发', '生产实践', '设计性', '<p>近几年，很多一线城市纷纷推出了绿色出行计划，用绿色环保低碳的出行方式取代汽车。其中，比较有成效的当属公共自行车。大量的自行车借还点，极大方便了市民的出行，同时起到了节能减排的作用。然而，自行车的借还不便，是目前正面临的另外一个需要解决的问题。本项目旨在提出一种新型的智能公共自行车借还系统，优化传统借/还车模式。例如：还车一方可直接把车&ldquo;还给&rdquo;需借车一方，需借车一方可以直接从需还车一方&ldquo;借取&rdquo;车辆，借/还车无需通过车站；当车站车满时，还车者有&ldquo;桩&rdquo;可还；当车站无车时，借车者有车可借，实现了借/还需求互补，也进一步简化了自行车的借还程序。</p>', '0', '276', null, null, '2017-04-20 00:00:00', '0', '1', '2016-10-19 22:23:57', '2016-10-19 22:23:57');
INSERT INTO `thesis` VALUES ('865', '1', '3', '奖贷助学金管理系统设计与实现', '应用软件开发', '生产实践', '应用研究', '<p>【任务】<br />\r\n1.实现奖学金、助学金、贷款等方面的管理</p>\r\n\r\n<p>2.实现奖学金电子化评定&nbsp;</p>\r\n\r\n<p>【要求】<br />\r\n1. 使用Java或C#<br />\r\n2. 数据库根据自身情况进行选择</p>\r\n\r\n<p>【联系方式】<br />\r\n手机：13760732070<br />\r\nemail：wangct@scau.edu.cn</p>', '0', '265', '666', null, '2017-04-23 00:00:00', '0', '1', '2016-10-19 22:26:09', '2016-10-19 22:26:09');
INSERT INTO `thesis` VALUES ('866', '2', '4', '我本人', '论文类', '导师课题', '毕业论文', '<table border=\"1\" cellpadding=\"1\" cellspacing=\"1\" style=\"width:500px\">\r\n	<tbody>\r\n		<tr>\r\n			<td>&nbsp;</td>\r\n			<td>&nbsp;</td>\r\n		</tr>\r\n		<tr>\r\n			<td>&nbsp;</td>\r\n			<td>&nbsp;</td>\r\n		</tr>\r\n		<tr>\r\n			<td>&nbsp;</td>\r\n			<td>&nbsp;</td>\r\n		</tr>\r\n	</tbody>\r\n</table>\r\n\r\n<p>&nbsp;</p>', '1', '6', '29', '19', '2017-08-02 00:00:00', '0', '1', '2017-08-01 15:07:25', '2017-08-18 17:16:34');
INSERT INTO `thesis` VALUES ('868', '2', '4', '222222222', '设计类', '导师课题', '毕业论文', '<p>111111111111</p>', '1', '6', null, null, '2017-08-02 00:00:00', '0', '1', '2017-08-10 21:40:09', '2017-08-11 22:01:30');
INSERT INTO `thesis` VALUES ('869', null, null, '', '', '', '', null, '0', null, null, null, null, '0', null, null, null);
INSERT INTO `thesis` VALUES ('870', null, null, '', '', '', '', null, '0', null, null, null, null, '0', null, null, null);
INSERT INTO `thesis` VALUES ('871', null, null, '', '', '', '', null, '0', null, null, null, null, '0', null, null, null);
INSERT INTO `thesis` VALUES ('872', null, null, '', '', '', '', null, '0', null, null, null, null, '0', null, null, null);
INSERT INTO `thesis` VALUES ('873', '2', '2', '1111', '设计类', '导师课题', '毕业论文', '<p>11111</p>', '1', '6', null, null, '2017-03-31 00:00:00', '0', '1', '2017-10-13 10:06:55', '2017-10-13 10:06:55');

-- ----------------------------
-- Table structure for title
-- ----------------------------
DROP TABLE IF EXISTS `title`;
CREATE TABLE `title` (
  `id` bigint(10) NOT NULL AUTO_INCREMENT,
  `name` varchar(255) DEFAULT '' COMMENT '职称名称',
  `level` varchar(255) DEFAULT NULL COMMENT '职称级别',
  `valid` tinyint(1) DEFAULT NULL COMMENT '是否可用（也即是否删除）',
  `cdate` datetime DEFAULT NULL COMMENT '创建时间',
  `mdate` datetime DEFAULT NULL COMMENT '更新时间',
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=8 DEFAULT CHARSET=utf8;

-- ----------------------------
-- Records of title
-- ----------------------------
INSERT INTO `title` VALUES ('1', '讲师', '中级', '1', '2016-08-26 14:46:32', '2016-08-26 14:46:32');
INSERT INTO `title` VALUES ('2', '实验师', '中级', '1', '2016-08-26 14:46:32', '2016-08-26 14:46:32');
INSERT INTO `title` VALUES ('3', '副教授', '副高级', '1', '2016-08-26 14:46:45', '2016-08-26 14:46:45');
INSERT INTO `title` VALUES ('4', '高级实验师', '副高级', '1', '2016-08-26 14:46:45', '2016-08-26 14:46:45');
INSERT INTO `title` VALUES ('5', '教授', '高级', '1', '2016-08-26 14:46:56', '2016-08-26 14:46:56');
INSERT INTO `title` VALUES ('6', '大白菜', '初级', '1', '2017-07-31 22:24:39', '2017-07-31 22:24:39');
INSERT INTO `title` VALUES ('7', '小白菜', '初级', '1', '2017-08-02 11:03:59', '2017-08-02 11:03:59');

-- ----------------------------
-- Table structure for upload
-- ----------------------------
DROP TABLE IF EXISTS `upload`;
CREATE TABLE `upload` (
  `path` varchar(200) DEFAULT NULL,
  `studentid` bigint(10) DEFAULT NULL,
  `teacherid` bigint(10) DEFAULT NULL,
  `projectid` bigint(10) DEFAULT NULL,
  `cdate` datetime DEFAULT NULL,
  `mdate` datetime DEFAULT NULL,
  `thesisid` bigint(10) DEFAULT NULL,
  `id` bigint(10) NOT NULL AUTO_INCREMENT,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=17 DEFAULT CHARSET=utf8;

-- ----------------------------
-- Records of upload
-- ----------------------------
INSERT INTO `upload` VALUES ('F:\\thesis\\target\\thesis\\upload/信息管理系/2017/建军节/我本人/1504577945226形式与政策.doc', '29', '6', '4', '2017-09-05 10:19:05', '2017-09-05 10:19:05', '866', '1');
INSERT INTO `upload` VALUES ('F:\\thesis\\target\\thesis\\upload/信息管理系/2017/2017年信管专业论文工作/校园二手交易系统的设计与实现/1505833399479需求分析.docx', '38', '18', '1', '2017-09-19 22:55:41', '2017-09-19 23:03:19', '187', '3');
INSERT INTO `upload` VALUES ('F:\\thesis\\target\\thesis\\upload/信息管理系/2017/2017年工业工程专业论文工作/电子企业物流配送绩效评价研究/1506529153856并行编程模式 [2015.2]_试读版 PDF电子书下载 带书签目录.pdf', '180', '4', '2', '2017-09-28 00:19:14', '2017-09-28 00:19:14', '3', '4');
INSERT INTO `upload` VALUES ('F:\\thesis\\target\\thesis\\upload/计算机科学与工程系/2017/2017届计算机科学与工程系毕业论文/基于AngularJS和Laravel的电影社区网站/阿里巴巴Java开发手册(正式版).pdf', '407', '214', '3', '2017-09-29 20:39:19', '2017-10-07 14:02:54', '371', '5');
INSERT INTO `upload` VALUES ('F:\\thesis\\target\\thesis\\upload/计算机科学与工程系/2017/2017届计算机科学与工程系毕业论文/新生报到系统/1506691690538（1）16位5级流水无cache实验CPU课程设计实验要求.pdf', '677', '224', '3', '2017-09-29 21:28:11', '2017-09-29 21:28:11', '615', '6');
INSERT INTO `upload` VALUES ('F:\\thesis\\target\\thesis\\upload/计算机科学与工程系/2017/2017届计算机科学与工程系毕业论文/基于spring+springMVC+mybatis的航空机票预订系统/1506697236241用BDF文件的方法来构建adder4.pdf', '676', '260', '3', '2017-09-29 22:23:09', '2017-09-29 23:00:36', '300', '13');
INSERT INTO `upload` VALUES ('F:\\thesis\\target\\thesis\\upload/信息管理系/2017/2017年工业工程专业论文工作/基于机器视觉的自然环境下绿色荔枝的识别研究/1506746471894用BDF文件的方法来构建adder4.pdf', '150', '12', '2', '2017-09-30 12:41:12', '2017-09-30 12:41:12', '85', '15');
INSERT INTO `upload` VALUES ('F:\\thesis\\target\\thesis\\upload/计算机科学与工程系/2017/2017届计算机科学与工程系毕业论文/网站用户行为分析系统/1507354052247阿里巴巴Java开发手册(正式版).pdf', '283', '220', '3', '2017-10-07 13:27:32', '2017-10-07 13:27:32', '457', '16');

-- ----------------------------
-- Table structure for user
-- ----------------------------
DROP TABLE IF EXISTS `user`;
CREATE TABLE `user` (
  `id` bigint(10) NOT NULL AUTO_INCREMENT,
  `orgid` bigint(10) DEFAULT NULL COMMENT '所属组织机构',
  `username` varchar(255) NOT NULL COMMENT '用户名字',
  `password` varchar(255) NOT NULL COMMENT '用户密码',
  `account` varchar(255) NOT NULL COMMENT '用户的账号',
  `type` varchar(255) NOT NULL COMMENT 'type 用来区别学生与其他用户0代表学生，1代表教师，2代表管理员',
  `valid` tinyint(1) DEFAULT NULL COMMENT '是否可用（也即是否删除）',
  `cdate` datetime DEFAULT NULL COMMENT '创建时间',
  `mdate` datetime DEFAULT NULL COMMENT '更新时间',
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=879 DEFAULT CHARSET=utf8;

-- ----------------------------
-- Records of user
-- ----------------------------
INSERT INTO `user` VALUES ('1', '0', '管理员', 'E10ADC3949BA59ABBE56E057F20F883E', 'admin', '超级管理员', '1', '2015-10-29 00:00:00', '2017-10-08 22:45:42');
INSERT INTO `user` VALUES ('870', '0', '大白菜', 'E10ADC3949BA59ABBE56E057F20F883E', '大白菜', '超级管理员', '1', '2017-07-31 20:15:53', '2017-07-31 20:15:53');

-- ----------------------------
-- Table structure for user_info
-- ----------------------------
DROP TABLE IF EXISTS `user_info`;
CREATE TABLE `user_info` (
  `id` bigint(10) NOT NULL AUTO_INCREMENT,
  `uid` bigint(10) NOT NULL COMMENT '用户ID',
  `orgid` bigint(10) DEFAULT NULL COMMENT '所属组织机构',
  `gender` varchar(255) DEFAULT '' COMMENT '性别',
  `phone` varchar(255) DEFAULT NULL COMMENT '联系电话',
  `email` varchar(255) DEFAULT NULL COMMENT '电子邮件',
  `inscomm` varchar(255) DEFAULT NULL COMMENT '即时通信工具号',
  `room` varchar(255) DEFAULT NULL COMMENT '办公地点或宿舍地址',
  `tid` bigint(10) DEFAULT NULL COMMENT '职称ID',
  `major` varchar(255) DEFAULT NULL COMMENT '专业',
  `clazz` varchar(255) DEFAULT NULL COMMENT '班级',
  `grade` varchar(255) DEFAULT NULL COMMENT '年级',
  `valid` tinyint(1) DEFAULT NULL COMMENT '是否可用（也即是否删除）',
  `cdate` datetime DEFAULT NULL COMMENT '创建时间',
  `mdate` datetime DEFAULT NULL COMMENT '更新时间',
  PRIMARY KEY (`id`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

-- ----------------------------
-- Records of user_info
-- ----------------------------

-- ----------------------------
-- Table structure for user_role
-- ----------------------------
DROP TABLE IF EXISTS `user_role`;
CREATE TABLE `user_role` (
  `uid` bigint(10) NOT NULL COMMENT '代表一个用户',
  `rid` bigint(10) NOT NULL COMMENT '代表一个角色'
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

-- ----------------------------
-- Records of user_role
-- ----------------------------
INSERT INTO `user_role` VALUES ('1', '1');
INSERT INTO `user_role` VALUES ('2', '20');
INSERT INTO `user_role` VALUES ('4', '21');
INSERT INTO `user_role` VALUES ('5', '21');
INSERT INTO `user_role` VALUES ('7', '21');
INSERT INTO `user_role` VALUES ('8', '21');
INSERT INTO `user_role` VALUES ('9', '21');
INSERT INTO `user_role` VALUES ('10', '21');
INSERT INTO `user_role` VALUES ('11', '21');
INSERT INTO `user_role` VALUES ('12', '21');
INSERT INTO `user_role` VALUES ('13', '21');
INSERT INTO `user_role` VALUES ('14', '21');
INSERT INTO `user_role` VALUES ('15', '21');
INSERT INTO `user_role` VALUES ('16', '21');
INSERT INTO `user_role` VALUES ('17', '21');
INSERT INTO `user_role` VALUES ('18', '21');
INSERT INTO `user_role` VALUES ('19', '21');
INSERT INTO `user_role` VALUES ('20', '21');
INSERT INTO `user_role` VALUES ('21', '21');
INSERT INTO `user_role` VALUES ('22', '21');
INSERT INTO `user_role` VALUES ('23', '21');
INSERT INTO `user_role` VALUES ('25', '21');
INSERT INTO `user_role` VALUES ('26', '21');
INSERT INTO `user_role` VALUES ('27', '21');
INSERT INTO `user_role` VALUES ('28', '21');
INSERT INTO `user_role` VALUES ('30', '22');
INSERT INTO `user_role` VALUES ('31', '22');
INSERT INTO `user_role` VALUES ('32', '22');
INSERT INTO `user_role` VALUES ('33', '22');
INSERT INTO `user_role` VALUES ('34', '22');
INSERT INTO `user_role` VALUES ('35', '22');
INSERT INTO `user_role` VALUES ('36', '22');
INSERT INTO `user_role` VALUES ('37', '22');
INSERT INTO `user_role` VALUES ('38', '22');
INSERT INTO `user_role` VALUES ('39', '22');
INSERT INTO `user_role` VALUES ('40', '22');
INSERT INTO `user_role` VALUES ('41', '22');
INSERT INTO `user_role` VALUES ('42', '22');
INSERT INTO `user_role` VALUES ('43', '22');
INSERT INTO `user_role` VALUES ('44', '22');
INSERT INTO `user_role` VALUES ('45', '22');
INSERT INTO `user_role` VALUES ('46', '22');
INSERT INTO `user_role` VALUES ('47', '22');
INSERT INTO `user_role` VALUES ('48', '22');
INSERT INTO `user_role` VALUES ('49', '22');
INSERT INTO `user_role` VALUES ('50', '22');
INSERT INTO `user_role` VALUES ('51', '22');
INSERT INTO `user_role` VALUES ('52', '22');
INSERT INTO `user_role` VALUES ('53', '22');
INSERT INTO `user_role` VALUES ('54', '22');
INSERT INTO `user_role` VALUES ('55', '22');
INSERT INTO `user_role` VALUES ('56', '22');
INSERT INTO `user_role` VALUES ('57', '22');
INSERT INTO `user_role` VALUES ('58', '22');
INSERT INTO `user_role` VALUES ('59', '22');
INSERT INTO `user_role` VALUES ('60', '22');
INSERT INTO `user_role` VALUES ('61', '22');
INSERT INTO `user_role` VALUES ('62', '22');
INSERT INTO `user_role` VALUES ('63', '22');
INSERT INTO `user_role` VALUES ('64', '22');
INSERT INTO `user_role` VALUES ('65', '22');
INSERT INTO `user_role` VALUES ('66', '22');
INSERT INTO `user_role` VALUES ('67', '22');
INSERT INTO `user_role` VALUES ('68', '22');
INSERT INTO `user_role` VALUES ('69', '22');
INSERT INTO `user_role` VALUES ('70', '22');
INSERT INTO `user_role` VALUES ('71', '22');
INSERT INTO `user_role` VALUES ('72', '22');
INSERT INTO `user_role` VALUES ('73', '22');
INSERT INTO `user_role` VALUES ('74', '22');
INSERT INTO `user_role` VALUES ('75', '22');
INSERT INTO `user_role` VALUES ('76', '22');
INSERT INTO `user_role` VALUES ('77', '22');
INSERT INTO `user_role` VALUES ('78', '22');
INSERT INTO `user_role` VALUES ('79', '22');
INSERT INTO `user_role` VALUES ('81', '22');
INSERT INTO `user_role` VALUES ('82', '22');
INSERT INTO `user_role` VALUES ('83', '22');
INSERT INTO `user_role` VALUES ('84', '22');
INSERT INTO `user_role` VALUES ('85', '22');
INSERT INTO `user_role` VALUES ('86', '22');
INSERT INTO `user_role` VALUES ('87', '22');
INSERT INTO `user_role` VALUES ('88', '22');
INSERT INTO `user_role` VALUES ('89', '22');
INSERT INTO `user_role` VALUES ('90', '22');
INSERT INTO `user_role` VALUES ('91', '22');
INSERT INTO `user_role` VALUES ('92', '22');
INSERT INTO `user_role` VALUES ('93', '22');
INSERT INTO `user_role` VALUES ('94', '22');
INSERT INTO `user_role` VALUES ('95', '22');
INSERT INTO `user_role` VALUES ('96', '22');
INSERT INTO `user_role` VALUES ('97', '22');
INSERT INTO `user_role` VALUES ('98', '22');
INSERT INTO `user_role` VALUES ('99', '22');
INSERT INTO `user_role` VALUES ('100', '22');
INSERT INTO `user_role` VALUES ('101', '22');
INSERT INTO `user_role` VALUES ('102', '22');
INSERT INTO `user_role` VALUES ('103', '22');
INSERT INTO `user_role` VALUES ('104', '22');
INSERT INTO `user_role` VALUES ('105', '22');
INSERT INTO `user_role` VALUES ('106', '22');
INSERT INTO `user_role` VALUES ('107', '22');
INSERT INTO `user_role` VALUES ('108', '22');
INSERT INTO `user_role` VALUES ('109', '22');
INSERT INTO `user_role` VALUES ('110', '22');
INSERT INTO `user_role` VALUES ('111', '22');
INSERT INTO `user_role` VALUES ('112', '22');
INSERT INTO `user_role` VALUES ('113', '22');
INSERT INTO `user_role` VALUES ('114', '22');
INSERT INTO `user_role` VALUES ('115', '22');
INSERT INTO `user_role` VALUES ('116', '22');
INSERT INTO `user_role` VALUES ('117', '22');
INSERT INTO `user_role` VALUES ('118', '22');
INSERT INTO `user_role` VALUES ('119', '22');
INSERT INTO `user_role` VALUES ('120', '22');
INSERT INTO `user_role` VALUES ('121', '22');
INSERT INTO `user_role` VALUES ('122', '22');
INSERT INTO `user_role` VALUES ('123', '22');
INSERT INTO `user_role` VALUES ('124', '22');
INSERT INTO `user_role` VALUES ('125', '22');
INSERT INTO `user_role` VALUES ('126', '22');
INSERT INTO `user_role` VALUES ('127', '22');
INSERT INTO `user_role` VALUES ('128', '22');
INSERT INTO `user_role` VALUES ('129', '22');
INSERT INTO `user_role` VALUES ('130', '22');
INSERT INTO `user_role` VALUES ('131', '22');
INSERT INTO `user_role` VALUES ('132', '22');
INSERT INTO `user_role` VALUES ('133', '22');
INSERT INTO `user_role` VALUES ('134', '22');
INSERT INTO `user_role` VALUES ('135', '22');
INSERT INTO `user_role` VALUES ('136', '22');
INSERT INTO `user_role` VALUES ('137', '22');
INSERT INTO `user_role` VALUES ('138', '22');
INSERT INTO `user_role` VALUES ('139', '22');
INSERT INTO `user_role` VALUES ('140', '22');
INSERT INTO `user_role` VALUES ('141', '22');
INSERT INTO `user_role` VALUES ('142', '22');
INSERT INTO `user_role` VALUES ('143', '22');
INSERT INTO `user_role` VALUES ('144', '22');
INSERT INTO `user_role` VALUES ('145', '22');
INSERT INTO `user_role` VALUES ('146', '22');
INSERT INTO `user_role` VALUES ('147', '22');
INSERT INTO `user_role` VALUES ('148', '22');
INSERT INTO `user_role` VALUES ('149', '22');
INSERT INTO `user_role` VALUES ('150', '22');
INSERT INTO `user_role` VALUES ('151', '22');
INSERT INTO `user_role` VALUES ('152', '22');
INSERT INTO `user_role` VALUES ('153', '22');
INSERT INTO `user_role` VALUES ('154', '22');
INSERT INTO `user_role` VALUES ('155', '22');
INSERT INTO `user_role` VALUES ('156', '22');
INSERT INTO `user_role` VALUES ('157', '22');
INSERT INTO `user_role` VALUES ('158', '22');
INSERT INTO `user_role` VALUES ('159', '22');
INSERT INTO `user_role` VALUES ('160', '22');
INSERT INTO `user_role` VALUES ('161', '22');
INSERT INTO `user_role` VALUES ('162', '22');
INSERT INTO `user_role` VALUES ('163', '22');
INSERT INTO `user_role` VALUES ('164', '22');
INSERT INTO `user_role` VALUES ('165', '22');
INSERT INTO `user_role` VALUES ('166', '22');
INSERT INTO `user_role` VALUES ('167', '22');
INSERT INTO `user_role` VALUES ('168', '22');
INSERT INTO `user_role` VALUES ('169', '22');
INSERT INTO `user_role` VALUES ('170', '22');
INSERT INTO `user_role` VALUES ('171', '22');
INSERT INTO `user_role` VALUES ('172', '22');
INSERT INTO `user_role` VALUES ('173', '22');
INSERT INTO `user_role` VALUES ('174', '22');
INSERT INTO `user_role` VALUES ('175', '22');
INSERT INTO `user_role` VALUES ('176', '22');
INSERT INTO `user_role` VALUES ('177', '22');
INSERT INTO `user_role` VALUES ('178', '22');
INSERT INTO `user_role` VALUES ('179', '22');
INSERT INTO `user_role` VALUES ('180', '22');
INSERT INTO `user_role` VALUES ('181', '22');
INSERT INTO `user_role` VALUES ('182', '22');
INSERT INTO `user_role` VALUES ('183', '22');
INSERT INTO `user_role` VALUES ('184', '22');
INSERT INTO `user_role` VALUES ('185', '22');
INSERT INTO `user_role` VALUES ('186', '22');
INSERT INTO `user_role` VALUES ('187', '22');
INSERT INTO `user_role` VALUES ('188', '22');
INSERT INTO `user_role` VALUES ('189', '22');
INSERT INTO `user_role` VALUES ('190', '22');
INSERT INTO `user_role` VALUES ('191', '22');
INSERT INTO `user_role` VALUES ('192', '22');
INSERT INTO `user_role` VALUES ('193', '22');
INSERT INTO `user_role` VALUES ('194', '22');
INSERT INTO `user_role` VALUES ('195', '22');
INSERT INTO `user_role` VALUES ('196', '22');
INSERT INTO `user_role` VALUES ('197', '22');
INSERT INTO `user_role` VALUES ('198', '22');
INSERT INTO `user_role` VALUES ('199', '22');
INSERT INTO `user_role` VALUES ('3', '20');
INSERT INTO `user_role` VALUES ('201', '20');
INSERT INTO `user_role` VALUES ('202', '21');
INSERT INTO `user_role` VALUES ('203', '21');
INSERT INTO `user_role` VALUES ('204', '21');
INSERT INTO `user_role` VALUES ('205', '21');
INSERT INTO `user_role` VALUES ('206', '21');
INSERT INTO `user_role` VALUES ('207', '21');
INSERT INTO `user_role` VALUES ('208', '21');
INSERT INTO `user_role` VALUES ('209', '21');
INSERT INTO `user_role` VALUES ('210', '21');
INSERT INTO `user_role` VALUES ('212', '21');
INSERT INTO `user_role` VALUES ('213', '21');
INSERT INTO `user_role` VALUES ('215', '21');
INSERT INTO `user_role` VALUES ('216', '21');
INSERT INTO `user_role` VALUES ('217', '21');
INSERT INTO `user_role` VALUES ('218', '21');
INSERT INTO `user_role` VALUES ('219', '21');
INSERT INTO `user_role` VALUES ('220', '21');
INSERT INTO `user_role` VALUES ('222', '21');
INSERT INTO `user_role` VALUES ('223', '21');
INSERT INTO `user_role` VALUES ('224', '21');
INSERT INTO `user_role` VALUES ('225', '21');
INSERT INTO `user_role` VALUES ('226', '21');
INSERT INTO `user_role` VALUES ('227', '21');
INSERT INTO `user_role` VALUES ('228', '21');
INSERT INTO `user_role` VALUES ('229', '21');
INSERT INTO `user_role` VALUES ('230', '21');
INSERT INTO `user_role` VALUES ('231', '21');
INSERT INTO `user_role` VALUES ('232', '21');
INSERT INTO `user_role` VALUES ('233', '21');
INSERT INTO `user_role` VALUES ('234', '21');
INSERT INTO `user_role` VALUES ('237', '21');
INSERT INTO `user_role` VALUES ('238', '21');
INSERT INTO `user_role` VALUES ('239', '21');
INSERT INTO `user_role` VALUES ('240', '21');
INSERT INTO `user_role` VALUES ('241', '21');
INSERT INTO `user_role` VALUES ('242', '21');
INSERT INTO `user_role` VALUES ('243', '21');
INSERT INTO `user_role` VALUES ('244', '21');
INSERT INTO `user_role` VALUES ('245', '21');
INSERT INTO `user_role` VALUES ('246', '21');
INSERT INTO `user_role` VALUES ('247', '21');
INSERT INTO `user_role` VALUES ('248', '21');
INSERT INTO `user_role` VALUES ('249', '21');
INSERT INTO `user_role` VALUES ('250', '21');
INSERT INTO `user_role` VALUES ('252', '21');
INSERT INTO `user_role` VALUES ('253', '21');
INSERT INTO `user_role` VALUES ('254', '21');
INSERT INTO `user_role` VALUES ('255', '21');
INSERT INTO `user_role` VALUES ('256', '21');
INSERT INTO `user_role` VALUES ('257', '21');
INSERT INTO `user_role` VALUES ('258', '21');
INSERT INTO `user_role` VALUES ('259', '21');
INSERT INTO `user_role` VALUES ('260', '21');
INSERT INTO `user_role` VALUES ('261', '21');
INSERT INTO `user_role` VALUES ('262', '21');
INSERT INTO `user_role` VALUES ('263', '21');
INSERT INTO `user_role` VALUES ('264', '21');
INSERT INTO `user_role` VALUES ('265', '21');
INSERT INTO `user_role` VALUES ('266', '21');
INSERT INTO `user_role` VALUES ('267', '21');
INSERT INTO `user_role` VALUES ('268', '21');
INSERT INTO `user_role` VALUES ('269', '21');
INSERT INTO `user_role` VALUES ('270', '21');
INSERT INTO `user_role` VALUES ('271', '21');
INSERT INTO `user_role` VALUES ('272', '21');
INSERT INTO `user_role` VALUES ('273', '21');
INSERT INTO `user_role` VALUES ('274', '21');
INSERT INTO `user_role` VALUES ('275', '21');
INSERT INTO `user_role` VALUES ('276', '21');
INSERT INTO `user_role` VALUES ('277', '21');
INSERT INTO `user_role` VALUES ('278', '21');
INSERT INTO `user_role` VALUES ('279', '21');
INSERT INTO `user_role` VALUES ('281', '22');
INSERT INTO `user_role` VALUES ('282', '22');
INSERT INTO `user_role` VALUES ('283', '22');
INSERT INTO `user_role` VALUES ('284', '22');
INSERT INTO `user_role` VALUES ('285', '22');
INSERT INTO `user_role` VALUES ('286', '22');
INSERT INTO `user_role` VALUES ('287', '22');
INSERT INTO `user_role` VALUES ('288', '22');
INSERT INTO `user_role` VALUES ('289', '22');
INSERT INTO `user_role` VALUES ('290', '22');
INSERT INTO `user_role` VALUES ('291', '22');
INSERT INTO `user_role` VALUES ('292', '22');
INSERT INTO `user_role` VALUES ('293', '22');
INSERT INTO `user_role` VALUES ('294', '22');
INSERT INTO `user_role` VALUES ('295', '22');
INSERT INTO `user_role` VALUES ('296', '22');
INSERT INTO `user_role` VALUES ('297', '22');
INSERT INTO `user_role` VALUES ('298', '22');
INSERT INTO `user_role` VALUES ('299', '22');
INSERT INTO `user_role` VALUES ('300', '22');
INSERT INTO `user_role` VALUES ('301', '22');
INSERT INTO `user_role` VALUES ('302', '22');
INSERT INTO `user_role` VALUES ('303', '22');
INSERT INTO `user_role` VALUES ('304', '22');
INSERT INTO `user_role` VALUES ('305', '22');
INSERT INTO `user_role` VALUES ('306', '22');
INSERT INTO `user_role` VALUES ('307', '22');
INSERT INTO `user_role` VALUES ('308', '22');
INSERT INTO `user_role` VALUES ('309', '22');
INSERT INTO `user_role` VALUES ('310', '22');
INSERT INTO `user_role` VALUES ('311', '22');
INSERT INTO `user_role` VALUES ('312', '22');
INSERT INTO `user_role` VALUES ('313', '22');
INSERT INTO `user_role` VALUES ('314', '22');
INSERT INTO `user_role` VALUES ('315', '22');
INSERT INTO `user_role` VALUES ('316', '22');
INSERT INTO `user_role` VALUES ('317', '22');
INSERT INTO `user_role` VALUES ('318', '22');
INSERT INTO `user_role` VALUES ('319', '22');
INSERT INTO `user_role` VALUES ('320', '22');
INSERT INTO `user_role` VALUES ('321', '22');
INSERT INTO `user_role` VALUES ('322', '22');
INSERT INTO `user_role` VALUES ('323', '22');
INSERT INTO `user_role` VALUES ('324', '22');
INSERT INTO `user_role` VALUES ('325', '22');
INSERT INTO `user_role` VALUES ('326', '22');
INSERT INTO `user_role` VALUES ('327', '22');
INSERT INTO `user_role` VALUES ('328', '22');
INSERT INTO `user_role` VALUES ('329', '22');
INSERT INTO `user_role` VALUES ('330', '22');
INSERT INTO `user_role` VALUES ('331', '22');
INSERT INTO `user_role` VALUES ('332', '22');
INSERT INTO `user_role` VALUES ('333', '22');
INSERT INTO `user_role` VALUES ('334', '22');
INSERT INTO `user_role` VALUES ('335', '22');
INSERT INTO `user_role` VALUES ('336', '22');
INSERT INTO `user_role` VALUES ('337', '22');
INSERT INTO `user_role` VALUES ('338', '22');
INSERT INTO `user_role` VALUES ('339', '22');
INSERT INTO `user_role` VALUES ('340', '22');
INSERT INTO `user_role` VALUES ('341', '22');
INSERT INTO `user_role` VALUES ('342', '22');
INSERT INTO `user_role` VALUES ('343', '22');
INSERT INTO `user_role` VALUES ('344', '22');
INSERT INTO `user_role` VALUES ('345', '22');
INSERT INTO `user_role` VALUES ('346', '22');
INSERT INTO `user_role` VALUES ('347', '22');
INSERT INTO `user_role` VALUES ('348', '22');
INSERT INTO `user_role` VALUES ('349', '22');
INSERT INTO `user_role` VALUES ('350', '22');
INSERT INTO `user_role` VALUES ('351', '22');
INSERT INTO `user_role` VALUES ('352', '22');
INSERT INTO `user_role` VALUES ('353', '22');
INSERT INTO `user_role` VALUES ('354', '22');
INSERT INTO `user_role` VALUES ('355', '22');
INSERT INTO `user_role` VALUES ('356', '22');
INSERT INTO `user_role` VALUES ('357', '22');
INSERT INTO `user_role` VALUES ('358', '22');
INSERT INTO `user_role` VALUES ('359', '22');
INSERT INTO `user_role` VALUES ('360', '22');
INSERT INTO `user_role` VALUES ('361', '22');
INSERT INTO `user_role` VALUES ('362', '22');
INSERT INTO `user_role` VALUES ('363', '22');
INSERT INTO `user_role` VALUES ('364', '22');
INSERT INTO `user_role` VALUES ('365', '22');
INSERT INTO `user_role` VALUES ('366', '22');
INSERT INTO `user_role` VALUES ('367', '22');
INSERT INTO `user_role` VALUES ('368', '22');
INSERT INTO `user_role` VALUES ('369', '22');
INSERT INTO `user_role` VALUES ('370', '22');
INSERT INTO `user_role` VALUES ('371', '22');
INSERT INTO `user_role` VALUES ('372', '22');
INSERT INTO `user_role` VALUES ('373', '22');
INSERT INTO `user_role` VALUES ('374', '22');
INSERT INTO `user_role` VALUES ('375', '22');
INSERT INTO `user_role` VALUES ('376', '22');
INSERT INTO `user_role` VALUES ('377', '22');
INSERT INTO `user_role` VALUES ('378', '22');
INSERT INTO `user_role` VALUES ('379', '22');
INSERT INTO `user_role` VALUES ('380', '22');
INSERT INTO `user_role` VALUES ('381', '22');
INSERT INTO `user_role` VALUES ('382', '22');
INSERT INTO `user_role` VALUES ('383', '22');
INSERT INTO `user_role` VALUES ('384', '22');
INSERT INTO `user_role` VALUES ('385', '22');
INSERT INTO `user_role` VALUES ('386', '22');
INSERT INTO `user_role` VALUES ('387', '22');
INSERT INTO `user_role` VALUES ('388', '22');
INSERT INTO `user_role` VALUES ('389', '22');
INSERT INTO `user_role` VALUES ('390', '22');
INSERT INTO `user_role` VALUES ('391', '22');
INSERT INTO `user_role` VALUES ('392', '22');
INSERT INTO `user_role` VALUES ('394', '22');
INSERT INTO `user_role` VALUES ('395', '22');
INSERT INTO `user_role` VALUES ('396', '22');
INSERT INTO `user_role` VALUES ('397', '22');
INSERT INTO `user_role` VALUES ('398', '22');
INSERT INTO `user_role` VALUES ('399', '22');
INSERT INTO `user_role` VALUES ('400', '22');
INSERT INTO `user_role` VALUES ('401', '22');
INSERT INTO `user_role` VALUES ('402', '22');
INSERT INTO `user_role` VALUES ('403', '22');
INSERT INTO `user_role` VALUES ('404', '22');
INSERT INTO `user_role` VALUES ('405', '22');
INSERT INTO `user_role` VALUES ('406', '22');
INSERT INTO `user_role` VALUES ('407', '22');
INSERT INTO `user_role` VALUES ('408', '22');
INSERT INTO `user_role` VALUES ('409', '22');
INSERT INTO `user_role` VALUES ('410', '22');
INSERT INTO `user_role` VALUES ('411', '22');
INSERT INTO `user_role` VALUES ('412', '22');
INSERT INTO `user_role` VALUES ('413', '22');
INSERT INTO `user_role` VALUES ('414', '22');
INSERT INTO `user_role` VALUES ('415', '22');
INSERT INTO `user_role` VALUES ('416', '22');
INSERT INTO `user_role` VALUES ('417', '22');
INSERT INTO `user_role` VALUES ('418', '22');
INSERT INTO `user_role` VALUES ('419', '22');
INSERT INTO `user_role` VALUES ('420', '22');
INSERT INTO `user_role` VALUES ('421', '22');
INSERT INTO `user_role` VALUES ('422', '22');
INSERT INTO `user_role` VALUES ('423', '22');
INSERT INTO `user_role` VALUES ('424', '22');
INSERT INTO `user_role` VALUES ('425', '22');
INSERT INTO `user_role` VALUES ('426', '22');
INSERT INTO `user_role` VALUES ('427', '22');
INSERT INTO `user_role` VALUES ('428', '22');
INSERT INTO `user_role` VALUES ('429', '22');
INSERT INTO `user_role` VALUES ('430', '22');
INSERT INTO `user_role` VALUES ('431', '22');
INSERT INTO `user_role` VALUES ('432', '22');
INSERT INTO `user_role` VALUES ('433', '22');
INSERT INTO `user_role` VALUES ('434', '22');
INSERT INTO `user_role` VALUES ('435', '22');
INSERT INTO `user_role` VALUES ('436', '22');
INSERT INTO `user_role` VALUES ('437', '22');
INSERT INTO `user_role` VALUES ('438', '22');
INSERT INTO `user_role` VALUES ('439', '22');
INSERT INTO `user_role` VALUES ('440', '22');
INSERT INTO `user_role` VALUES ('441', '22');
INSERT INTO `user_role` VALUES ('442', '22');
INSERT INTO `user_role` VALUES ('443', '22');
INSERT INTO `user_role` VALUES ('444', '22');
INSERT INTO `user_role` VALUES ('445', '22');
INSERT INTO `user_role` VALUES ('446', '22');
INSERT INTO `user_role` VALUES ('447', '22');
INSERT INTO `user_role` VALUES ('448', '22');
INSERT INTO `user_role` VALUES ('449', '22');
INSERT INTO `user_role` VALUES ('450', '22');
INSERT INTO `user_role` VALUES ('451', '22');
INSERT INTO `user_role` VALUES ('452', '22');
INSERT INTO `user_role` VALUES ('453', '22');
INSERT INTO `user_role` VALUES ('454', '22');
INSERT INTO `user_role` VALUES ('455', '22');
INSERT INTO `user_role` VALUES ('456', '22');
INSERT INTO `user_role` VALUES ('457', '22');
INSERT INTO `user_role` VALUES ('458', '22');
INSERT INTO `user_role` VALUES ('459', '22');
INSERT INTO `user_role` VALUES ('460', '22');
INSERT INTO `user_role` VALUES ('461', '22');
INSERT INTO `user_role` VALUES ('462', '22');
INSERT INTO `user_role` VALUES ('463', '22');
INSERT INTO `user_role` VALUES ('464', '22');
INSERT INTO `user_role` VALUES ('465', '22');
INSERT INTO `user_role` VALUES ('466', '22');
INSERT INTO `user_role` VALUES ('467', '22');
INSERT INTO `user_role` VALUES ('468', '22');
INSERT INTO `user_role` VALUES ('471', '22');
INSERT INTO `user_role` VALUES ('472', '22');
INSERT INTO `user_role` VALUES ('473', '22');
INSERT INTO `user_role` VALUES ('474', '22');
INSERT INTO `user_role` VALUES ('475', '22');
INSERT INTO `user_role` VALUES ('476', '22');
INSERT INTO `user_role` VALUES ('477', '22');
INSERT INTO `user_role` VALUES ('478', '22');
INSERT INTO `user_role` VALUES ('479', '22');
INSERT INTO `user_role` VALUES ('480', '22');
INSERT INTO `user_role` VALUES ('481', '22');
INSERT INTO `user_role` VALUES ('482', '22');
INSERT INTO `user_role` VALUES ('483', '22');
INSERT INTO `user_role` VALUES ('484', '22');
INSERT INTO `user_role` VALUES ('485', '22');
INSERT INTO `user_role` VALUES ('486', '22');
INSERT INTO `user_role` VALUES ('487', '22');
INSERT INTO `user_role` VALUES ('488', '22');
INSERT INTO `user_role` VALUES ('489', '22');
INSERT INTO `user_role` VALUES ('490', '22');
INSERT INTO `user_role` VALUES ('491', '22');
INSERT INTO `user_role` VALUES ('492', '22');
INSERT INTO `user_role` VALUES ('493', '22');
INSERT INTO `user_role` VALUES ('494', '22');
INSERT INTO `user_role` VALUES ('495', '22');
INSERT INTO `user_role` VALUES ('496', '22');
INSERT INTO `user_role` VALUES ('497', '22');
INSERT INTO `user_role` VALUES ('498', '22');
INSERT INTO `user_role` VALUES ('499', '22');
INSERT INTO `user_role` VALUES ('500', '22');
INSERT INTO `user_role` VALUES ('501', '22');
INSERT INTO `user_role` VALUES ('502', '22');
INSERT INTO `user_role` VALUES ('503', '22');
INSERT INTO `user_role` VALUES ('504', '22');
INSERT INTO `user_role` VALUES ('505', '22');
INSERT INTO `user_role` VALUES ('506', '22');
INSERT INTO `user_role` VALUES ('507', '22');
INSERT INTO `user_role` VALUES ('508', '22');
INSERT INTO `user_role` VALUES ('509', '22');
INSERT INTO `user_role` VALUES ('510', '22');
INSERT INTO `user_role` VALUES ('511', '22');
INSERT INTO `user_role` VALUES ('512', '22');
INSERT INTO `user_role` VALUES ('513', '22');
INSERT INTO `user_role` VALUES ('514', '22');
INSERT INTO `user_role` VALUES ('515', '22');
INSERT INTO `user_role` VALUES ('516', '22');
INSERT INTO `user_role` VALUES ('517', '22');
INSERT INTO `user_role` VALUES ('518', '22');
INSERT INTO `user_role` VALUES ('519', '22');
INSERT INTO `user_role` VALUES ('520', '22');
INSERT INTO `user_role` VALUES ('521', '22');
INSERT INTO `user_role` VALUES ('522', '22');
INSERT INTO `user_role` VALUES ('523', '22');
INSERT INTO `user_role` VALUES ('524', '22');
INSERT INTO `user_role` VALUES ('525', '22');
INSERT INTO `user_role` VALUES ('526', '22');
INSERT INTO `user_role` VALUES ('527', '22');
INSERT INTO `user_role` VALUES ('528', '22');
INSERT INTO `user_role` VALUES ('529', '22');
INSERT INTO `user_role` VALUES ('530', '22');
INSERT INTO `user_role` VALUES ('531', '22');
INSERT INTO `user_role` VALUES ('532', '22');
INSERT INTO `user_role` VALUES ('533', '22');
INSERT INTO `user_role` VALUES ('534', '22');
INSERT INTO `user_role` VALUES ('535', '22');
INSERT INTO `user_role` VALUES ('536', '22');
INSERT INTO `user_role` VALUES ('537', '22');
INSERT INTO `user_role` VALUES ('538', '22');
INSERT INTO `user_role` VALUES ('539', '22');
INSERT INTO `user_role` VALUES ('540', '22');
INSERT INTO `user_role` VALUES ('541', '22');
INSERT INTO `user_role` VALUES ('542', '22');
INSERT INTO `user_role` VALUES ('543', '22');
INSERT INTO `user_role` VALUES ('544', '22');
INSERT INTO `user_role` VALUES ('545', '22');
INSERT INTO `user_role` VALUES ('546', '22');
INSERT INTO `user_role` VALUES ('547', '22');
INSERT INTO `user_role` VALUES ('548', '22');
INSERT INTO `user_role` VALUES ('549', '22');
INSERT INTO `user_role` VALUES ('550', '22');
INSERT INTO `user_role` VALUES ('551', '22');
INSERT INTO `user_role` VALUES ('552', '22');
INSERT INTO `user_role` VALUES ('553', '22');
INSERT INTO `user_role` VALUES ('554', '22');
INSERT INTO `user_role` VALUES ('555', '22');
INSERT INTO `user_role` VALUES ('556', '22');
INSERT INTO `user_role` VALUES ('557', '22');
INSERT INTO `user_role` VALUES ('558', '22');
INSERT INTO `user_role` VALUES ('559', '22');
INSERT INTO `user_role` VALUES ('560', '22');
INSERT INTO `user_role` VALUES ('561', '22');
INSERT INTO `user_role` VALUES ('562', '22');
INSERT INTO `user_role` VALUES ('563', '22');
INSERT INTO `user_role` VALUES ('564', '22');
INSERT INTO `user_role` VALUES ('565', '22');
INSERT INTO `user_role` VALUES ('566', '22');
INSERT INTO `user_role` VALUES ('567', '22');
INSERT INTO `user_role` VALUES ('568', '22');
INSERT INTO `user_role` VALUES ('569', '22');
INSERT INTO `user_role` VALUES ('570', '22');
INSERT INTO `user_role` VALUES ('571', '22');
INSERT INTO `user_role` VALUES ('572', '22');
INSERT INTO `user_role` VALUES ('573', '22');
INSERT INTO `user_role` VALUES ('574', '22');
INSERT INTO `user_role` VALUES ('575', '22');
INSERT INTO `user_role` VALUES ('577', '22');
INSERT INTO `user_role` VALUES ('578', '22');
INSERT INTO `user_role` VALUES ('579', '22');
INSERT INTO `user_role` VALUES ('580', '22');
INSERT INTO `user_role` VALUES ('581', '22');
INSERT INTO `user_role` VALUES ('582', '22');
INSERT INTO `user_role` VALUES ('583', '22');
INSERT INTO `user_role` VALUES ('584', '22');
INSERT INTO `user_role` VALUES ('585', '22');
INSERT INTO `user_role` VALUES ('586', '22');
INSERT INTO `user_role` VALUES ('587', '22');
INSERT INTO `user_role` VALUES ('588', '22');
INSERT INTO `user_role` VALUES ('590', '22');
INSERT INTO `user_role` VALUES ('591', '22');
INSERT INTO `user_role` VALUES ('592', '22');
INSERT INTO `user_role` VALUES ('593', '22');
INSERT INTO `user_role` VALUES ('594', '22');
INSERT INTO `user_role` VALUES ('595', '22');
INSERT INTO `user_role` VALUES ('596', '22');
INSERT INTO `user_role` VALUES ('597', '22');
INSERT INTO `user_role` VALUES ('598', '22');
INSERT INTO `user_role` VALUES ('599', '22');
INSERT INTO `user_role` VALUES ('600', '22');
INSERT INTO `user_role` VALUES ('601', '22');
INSERT INTO `user_role` VALUES ('602', '22');
INSERT INTO `user_role` VALUES ('603', '22');
INSERT INTO `user_role` VALUES ('604', '22');
INSERT INTO `user_role` VALUES ('605', '22');
INSERT INTO `user_role` VALUES ('606', '22');
INSERT INTO `user_role` VALUES ('607', '22');
INSERT INTO `user_role` VALUES ('608', '22');
INSERT INTO `user_role` VALUES ('609', '22');
INSERT INTO `user_role` VALUES ('610', '22');
INSERT INTO `user_role` VALUES ('611', '22');
INSERT INTO `user_role` VALUES ('612', '22');
INSERT INTO `user_role` VALUES ('613', '22');
INSERT INTO `user_role` VALUES ('614', '22');
INSERT INTO `user_role` VALUES ('615', '22');
INSERT INTO `user_role` VALUES ('616', '22');
INSERT INTO `user_role` VALUES ('617', '22');
INSERT INTO `user_role` VALUES ('618', '22');
INSERT INTO `user_role` VALUES ('619', '22');
INSERT INTO `user_role` VALUES ('620', '22');
INSERT INTO `user_role` VALUES ('621', '22');
INSERT INTO `user_role` VALUES ('622', '22');
INSERT INTO `user_role` VALUES ('623', '22');
INSERT INTO `user_role` VALUES ('624', '22');
INSERT INTO `user_role` VALUES ('625', '22');
INSERT INTO `user_role` VALUES ('626', '22');
INSERT INTO `user_role` VALUES ('627', '22');
INSERT INTO `user_role` VALUES ('628', '22');
INSERT INTO `user_role` VALUES ('629', '22');
INSERT INTO `user_role` VALUES ('630', '22');
INSERT INTO `user_role` VALUES ('631', '22');
INSERT INTO `user_role` VALUES ('632', '22');
INSERT INTO `user_role` VALUES ('633', '22');
INSERT INTO `user_role` VALUES ('634', '22');
INSERT INTO `user_role` VALUES ('635', '22');
INSERT INTO `user_role` VALUES ('636', '22');
INSERT INTO `user_role` VALUES ('637', '22');
INSERT INTO `user_role` VALUES ('638', '22');
INSERT INTO `user_role` VALUES ('639', '22');
INSERT INTO `user_role` VALUES ('640', '22');
INSERT INTO `user_role` VALUES ('641', '22');
INSERT INTO `user_role` VALUES ('642', '22');
INSERT INTO `user_role` VALUES ('643', '22');
INSERT INTO `user_role` VALUES ('644', '22');
INSERT INTO `user_role` VALUES ('645', '22');
INSERT INTO `user_role` VALUES ('646', '22');
INSERT INTO `user_role` VALUES ('647', '22');
INSERT INTO `user_role` VALUES ('648', '22');
INSERT INTO `user_role` VALUES ('649', '22');
INSERT INTO `user_role` VALUES ('650', '22');
INSERT INTO `user_role` VALUES ('651', '22');
INSERT INTO `user_role` VALUES ('652', '22');
INSERT INTO `user_role` VALUES ('653', '22');
INSERT INTO `user_role` VALUES ('654', '22');
INSERT INTO `user_role` VALUES ('655', '22');
INSERT INTO `user_role` VALUES ('656', '22');
INSERT INTO `user_role` VALUES ('657', '22');
INSERT INTO `user_role` VALUES ('658', '22');
INSERT INTO `user_role` VALUES ('659', '22');
INSERT INTO `user_role` VALUES ('660', '22');
INSERT INTO `user_role` VALUES ('661', '22');
INSERT INTO `user_role` VALUES ('662', '22');
INSERT INTO `user_role` VALUES ('663', '22');
INSERT INTO `user_role` VALUES ('664', '22');
INSERT INTO `user_role` VALUES ('665', '22');
INSERT INTO `user_role` VALUES ('666', '22');
INSERT INTO `user_role` VALUES ('667', '22');
INSERT INTO `user_role` VALUES ('668', '22');
INSERT INTO `user_role` VALUES ('669', '22');
INSERT INTO `user_role` VALUES ('670', '22');
INSERT INTO `user_role` VALUES ('671', '22');
INSERT INTO `user_role` VALUES ('672', '22');
INSERT INTO `user_role` VALUES ('673', '22');
INSERT INTO `user_role` VALUES ('674', '22');
INSERT INTO `user_role` VALUES ('675', '22');
INSERT INTO `user_role` VALUES ('676', '22');
INSERT INTO `user_role` VALUES ('677', '22');
INSERT INTO `user_role` VALUES ('678', '22');
INSERT INTO `user_role` VALUES ('679', '22');
INSERT INTO `user_role` VALUES ('680', '22');
INSERT INTO `user_role` VALUES ('681', '22');
INSERT INTO `user_role` VALUES ('682', '22');
INSERT INTO `user_role` VALUES ('683', '22');
INSERT INTO `user_role` VALUES ('684', '22');
INSERT INTO `user_role` VALUES ('685', '22');
INSERT INTO `user_role` VALUES ('686', '22');
INSERT INTO `user_role` VALUES ('687', '22');
INSERT INTO `user_role` VALUES ('688', '22');
INSERT INTO `user_role` VALUES ('689', '22');
INSERT INTO `user_role` VALUES ('690', '22');
INSERT INTO `user_role` VALUES ('691', '22');
INSERT INTO `user_role` VALUES ('692', '22');
INSERT INTO `user_role` VALUES ('693', '22');
INSERT INTO `user_role` VALUES ('694', '22');
INSERT INTO `user_role` VALUES ('695', '22');
INSERT INTO `user_role` VALUES ('696', '22');
INSERT INTO `user_role` VALUES ('697', '22');
INSERT INTO `user_role` VALUES ('698', '22');
INSERT INTO `user_role` VALUES ('699', '22');
INSERT INTO `user_role` VALUES ('700', '22');
INSERT INTO `user_role` VALUES ('701', '22');
INSERT INTO `user_role` VALUES ('702', '22');
INSERT INTO `user_role` VALUES ('703', '22');
INSERT INTO `user_role` VALUES ('704', '22');
INSERT INTO `user_role` VALUES ('705', '22');
INSERT INTO `user_role` VALUES ('706', '22');
INSERT INTO `user_role` VALUES ('707', '22');
INSERT INTO `user_role` VALUES ('708', '22');
INSERT INTO `user_role` VALUES ('709', '22');
INSERT INTO `user_role` VALUES ('710', '22');
INSERT INTO `user_role` VALUES ('711', '22');
INSERT INTO `user_role` VALUES ('712', '22');
INSERT INTO `user_role` VALUES ('713', '22');
INSERT INTO `user_role` VALUES ('714', '22');
INSERT INTO `user_role` VALUES ('715', '22');
INSERT INTO `user_role` VALUES ('716', '22');
INSERT INTO `user_role` VALUES ('717', '22');
INSERT INTO `user_role` VALUES ('718', '22');
INSERT INTO `user_role` VALUES ('719', '22');
INSERT INTO `user_role` VALUES ('720', '22');
INSERT INTO `user_role` VALUES ('721', '22');
INSERT INTO `user_role` VALUES ('722', '22');
INSERT INTO `user_role` VALUES ('723', '22');
INSERT INTO `user_role` VALUES ('724', '22');
INSERT INTO `user_role` VALUES ('725', '22');
INSERT INTO `user_role` VALUES ('726', '22');
INSERT INTO `user_role` VALUES ('727', '22');
INSERT INTO `user_role` VALUES ('728', '22');
INSERT INTO `user_role` VALUES ('729', '22');
INSERT INTO `user_role` VALUES ('730', '22');
INSERT INTO `user_role` VALUES ('731', '22');
INSERT INTO `user_role` VALUES ('732', '22');
INSERT INTO `user_role` VALUES ('733', '22');
INSERT INTO `user_role` VALUES ('734', '22');
INSERT INTO `user_role` VALUES ('735', '22');
INSERT INTO `user_role` VALUES ('736', '22');
INSERT INTO `user_role` VALUES ('737', '22');
INSERT INTO `user_role` VALUES ('738', '22');
INSERT INTO `user_role` VALUES ('739', '22');
INSERT INTO `user_role` VALUES ('740', '22');
INSERT INTO `user_role` VALUES ('742', '22');
INSERT INTO `user_role` VALUES ('743', '22');
INSERT INTO `user_role` VALUES ('744', '22');
INSERT INTO `user_role` VALUES ('745', '22');
INSERT INTO `user_role` VALUES ('746', '22');
INSERT INTO `user_role` VALUES ('747', '22');
INSERT INTO `user_role` VALUES ('748', '22');
INSERT INTO `user_role` VALUES ('749', '22');
INSERT INTO `user_role` VALUES ('750', '22');
INSERT INTO `user_role` VALUES ('751', '22');
INSERT INTO `user_role` VALUES ('752', '22');
INSERT INTO `user_role` VALUES ('753', '22');
INSERT INTO `user_role` VALUES ('754', '22');
INSERT INTO `user_role` VALUES ('755', '22');
INSERT INTO `user_role` VALUES ('756', '22');
INSERT INTO `user_role` VALUES ('757', '22');
INSERT INTO `user_role` VALUES ('758', '22');
INSERT INTO `user_role` VALUES ('759', '22');
INSERT INTO `user_role` VALUES ('760', '22');
INSERT INTO `user_role` VALUES ('761', '22');
INSERT INTO `user_role` VALUES ('762', '22');
INSERT INTO `user_role` VALUES ('763', '22');
INSERT INTO `user_role` VALUES ('764', '22');
INSERT INTO `user_role` VALUES ('765', '22');
INSERT INTO `user_role` VALUES ('766', '22');
INSERT INTO `user_role` VALUES ('767', '22');
INSERT INTO `user_role` VALUES ('768', '22');
INSERT INTO `user_role` VALUES ('769', '22');
INSERT INTO `user_role` VALUES ('770', '22');
INSERT INTO `user_role` VALUES ('771', '22');
INSERT INTO `user_role` VALUES ('772', '22');
INSERT INTO `user_role` VALUES ('773', '22');
INSERT INTO `user_role` VALUES ('774', '22');
INSERT INTO `user_role` VALUES ('775', '22');
INSERT INTO `user_role` VALUES ('776', '22');
INSERT INTO `user_role` VALUES ('777', '22');
INSERT INTO `user_role` VALUES ('778', '22');
INSERT INTO `user_role` VALUES ('779', '22');
INSERT INTO `user_role` VALUES ('780', '22');
INSERT INTO `user_role` VALUES ('781', '22');
INSERT INTO `user_role` VALUES ('782', '22');
INSERT INTO `user_role` VALUES ('783', '22');
INSERT INTO `user_role` VALUES ('784', '22');
INSERT INTO `user_role` VALUES ('785', '22');
INSERT INTO `user_role` VALUES ('786', '22');
INSERT INTO `user_role` VALUES ('787', '22');
INSERT INTO `user_role` VALUES ('788', '22');
INSERT INTO `user_role` VALUES ('789', '22');
INSERT INTO `user_role` VALUES ('790', '22');
INSERT INTO `user_role` VALUES ('791', '22');
INSERT INTO `user_role` VALUES ('792', '22');
INSERT INTO `user_role` VALUES ('793', '22');
INSERT INTO `user_role` VALUES ('794', '22');
INSERT INTO `user_role` VALUES ('795', '22');
INSERT INTO `user_role` VALUES ('796', '22');
INSERT INTO `user_role` VALUES ('797', '22');
INSERT INTO `user_role` VALUES ('798', '22');
INSERT INTO `user_role` VALUES ('799', '22');
INSERT INTO `user_role` VALUES ('800', '22');
INSERT INTO `user_role` VALUES ('801', '22');
INSERT INTO `user_role` VALUES ('802', '22');
INSERT INTO `user_role` VALUES ('803', '22');
INSERT INTO `user_role` VALUES ('804', '22');
INSERT INTO `user_role` VALUES ('805', '22');
INSERT INTO `user_role` VALUES ('806', '22');
INSERT INTO `user_role` VALUES ('807', '22');
INSERT INTO `user_role` VALUES ('808', '22');
INSERT INTO `user_role` VALUES ('809', '22');
INSERT INTO `user_role` VALUES ('810', '22');
INSERT INTO `user_role` VALUES ('811', '22');
INSERT INTO `user_role` VALUES ('812', '22');
INSERT INTO `user_role` VALUES ('813', '22');
INSERT INTO `user_role` VALUES ('814', '22');
INSERT INTO `user_role` VALUES ('815', '22');
INSERT INTO `user_role` VALUES ('816', '22');
INSERT INTO `user_role` VALUES ('817', '22');
INSERT INTO `user_role` VALUES ('818', '22');
INSERT INTO `user_role` VALUES ('819', '22');
INSERT INTO `user_role` VALUES ('820', '22');
INSERT INTO `user_role` VALUES ('821', '22');
INSERT INTO `user_role` VALUES ('822', '22');
INSERT INTO `user_role` VALUES ('823', '22');
INSERT INTO `user_role` VALUES ('824', '22');
INSERT INTO `user_role` VALUES ('825', '22');
INSERT INTO `user_role` VALUES ('826', '22');
INSERT INTO `user_role` VALUES ('827', '22');
INSERT INTO `user_role` VALUES ('828', '22');
INSERT INTO `user_role` VALUES ('829', '22');
INSERT INTO `user_role` VALUES ('830', '22');
INSERT INTO `user_role` VALUES ('831', '22');
INSERT INTO `user_role` VALUES ('832', '22');
INSERT INTO `user_role` VALUES ('833', '22');
INSERT INTO `user_role` VALUES ('834', '22');
INSERT INTO `user_role` VALUES ('835', '22');
INSERT INTO `user_role` VALUES ('836', '22');
INSERT INTO `user_role` VALUES ('837', '22');
INSERT INTO `user_role` VALUES ('838', '22');
INSERT INTO `user_role` VALUES ('839', '22');
INSERT INTO `user_role` VALUES ('840', '22');
INSERT INTO `user_role` VALUES ('841', '22');
INSERT INTO `user_role` VALUES ('842', '22');
INSERT INTO `user_role` VALUES ('843', '22');
INSERT INTO `user_role` VALUES ('844', '22');
INSERT INTO `user_role` VALUES ('845', '22');
INSERT INTO `user_role` VALUES ('846', '22');
INSERT INTO `user_role` VALUES ('847', '22');
INSERT INTO `user_role` VALUES ('848', '22');
INSERT INTO `user_role` VALUES ('849', '22');
INSERT INTO `user_role` VALUES ('850', '22');
INSERT INTO `user_role` VALUES ('851', '22');
INSERT INTO `user_role` VALUES ('852', '22');
INSERT INTO `user_role` VALUES ('853', '22');
INSERT INTO `user_role` VALUES ('854', '22');
INSERT INTO `user_role` VALUES ('855', '22');
INSERT INTO `user_role` VALUES ('856', '22');
INSERT INTO `user_role` VALUES ('857', '22');
INSERT INTO `user_role` VALUES ('858', '22');
INSERT INTO `user_role` VALUES ('859', '22');
INSERT INTO `user_role` VALUES ('860', '22');
INSERT INTO `user_role` VALUES ('861', '22');
INSERT INTO `user_role` VALUES ('862', '21');
INSERT INTO `user_role` VALUES ('863', '22');
INSERT INTO `user_role` VALUES ('864', '21');
INSERT INTO `user_role` VALUES ('865', '22');
INSERT INTO `user_role` VALUES ('867', '22');
INSERT INTO `user_role` VALUES ('214', '21');
INSERT INTO `user_role` VALUES ('236', '21');
INSERT INTO `user_role` VALUES ('251', '21');
INSERT INTO `user_role` VALUES ('393', '22');
INSERT INTO `user_role` VALUES ('576', '22');
INSERT INTO `user_role` VALUES ('211', '21');
INSERT INTO `user_role` VALUES ('280', '22');
INSERT INTO `user_role` VALUES ('866', '22');
INSERT INTO `user_role` VALUES ('866', '21');
INSERT INTO `user_role` VALUES ('871', '20');
INSERT INTO `user_role` VALUES ('872', '20');
INSERT INTO `user_role` VALUES ('872', '21');
INSERT INTO `user_role` VALUES ('872', '22');
INSERT INTO `user_role` VALUES ('873', '22');
INSERT INTO `user_role` VALUES ('874', '22');
INSERT INTO `user_role` VALUES ('875', '22');
INSERT INTO `user_role` VALUES ('24', '21');
INSERT INTO `user_role` VALUES ('877', '22');
INSERT INTO `user_role` VALUES ('878', '20');
INSERT INTO `user_role` VALUES ('876', '20');
INSERT INTO `user_role` VALUES ('80', '22');
INSERT INTO `user_role` VALUES ('29', '22');
INSERT INTO `user_role` VALUES ('741', '22');
INSERT INTO `user_role` VALUES ('741', '1');
INSERT INTO `user_role` VALUES ('741', '20');
INSERT INTO `user_role` VALUES ('741', '21');
INSERT INTO `user_role` VALUES ('6', '20');

-- ----------------------------
-- View structure for student
-- ----------------------------
DROP VIEW IF EXISTS `student`;
CREATE ALGORITHM=UNDEFINED DEFINER=`root`@`localhost` SQL SECURITY DEFINER VIEW `student` AS select `ps`.`projectid` AS `projid`,`u`.`id` AS `studentid`,`u`.`username` AS `stuname`,`u`.`account` AS `stuno`,`ui`.`grade` AS `grade`,`ui`.`clazz` AS `clazz`,`ui`.`major` AS `major` from ((`user` `u` join `user_info` `ui`) join `project_student` `ps`) where ((`u`.`valid` = 1) and (`u`.`id` = `ui`.`uid`) and (`u`.`id` = `ps`.`studentid`) and (`u`.`type` = '学生')) ;

-- ----------------------------
-- View structure for thesis_student
-- ----------------------------
DROP VIEW IF EXISTS `thesis_student`;
CREATE ALGORITHM=UNDEFINED DEFINER=`root`@`%` SQL SECURITY DEFINER VIEW `thesis_student` AS select `t`.`id` AS `id`,`t`.`orgid` AS `orgid`,`t`.`projid` AS `projid`,`t`.`topic` AS `topic`,`t`.`teacherid` AS `teacherid`,`t`.`studentid` AS `studentid`,`t`.`viewerid` AS `viewerid`,`t`.`defensestatus` AS `defensestatus`,`u`.`account` AS `account`,`u`.`username` AS `username` from (`thesis` `t` join `user` `u`) where ((`t`.`studentid` = `u`.`id`) and (`t`.`valid` = 1) and (`u`.`valid` = 1)) ;

-- ----------------------------
-- View structure for thesis_teacher
-- ----------------------------
DROP VIEW IF EXISTS `thesis_teacher`;
CREATE ALGORITHM=UNDEFINED DEFINER=`root`@`%` SQL SECURITY DEFINER VIEW `thesis_teacher` AS select `t`.`id` AS `id`,`t`.`orgid` AS `orgid`,`t`.`projid` AS `projid`,`t`.`topic` AS `topic`,`t`.`direction` AS `direction`,`t`.`source` AS `source`,`t`.`property` AS `property`,`t`.`checked` AS `checked`,`t`.`teacherid` AS `teacherid`,`t`.`studentid` AS `studentid`,`t`.`viewerid` AS `viewerid`,`t`.`defensestatus` AS `defensestatus`,`u`.`account` AS `account`,`u`.`username` AS `username` from (`thesis` `t` join `user` `u`) where ((`t`.`teacherid` = `u`.`id`) and (`t`.`valid` = 1) and (`u`.`valid` = 1)) ;
